{
    "World": [
        {
            "headline": "Bharat Bandh News Live Updates: Nationwide strike impacts transport, banking, schools; unions protest govt policies",
            "summary": "On February 12, a nationwide Bharat Bandh is being held by trade unions and farmer groups to protest central government policies deemed anti-worker and anti-farmer. The strike is expected to disrupt public sector banks, state transport, and government offices, but essential services and private offices will largely function. Punjab is expected to see massive support, with the Aam Aadmi Party actively backing the bandh alongside trade unions and farmer groups.",
            "key_points": [
                "Nationwide Bharat Bandh on February 12, 2026, protesting government policies.",
                "Disruptions expected in public sector banks, state transport, and government offices.",
                "Hospitals, emergency services, and private offices are expected to function normally.",
                "The strike demands restoration of the Old Pension Scheme and minimum wages."
            ]
        },
        {
            "headline": "'Stabbed them repeatedly': US-returned Bengaluru techie kills parents in villa over startup funding",
            "summary": "A US-returned techie, Rohan Chandra Bhat, has been arrested for allegedly murdering his parents in their Bengaluru villa. Driven by desperation to fund his new venture, Rohan reportedly stabbed his retired navy captain father and dentist mother after heated arguments over financial support.",
            "key_points": [
                "US-returned techie murdered his parents in Bengaluru.",
                "Motive was financial desperation to fund a startup.",
                "Victims were stabbed after arguments over money."
            ]
        },
        {
            "headline": "Bangladesh polls: Why India is watching closely",
            "summary": "Bangladesh votes Thursday in an election with significant implications for India. With Sheikh Hasina out, India hopes the frontrunner BNP can reset ties, despite historical friction. A tight contest is expected between the BNP alliance and a bloc led by Jamaat-e-Islami, with India also eyeing a constitutional referendum and key security concerns including insurgent groups and Chinese influence.",
            "key_points": [
                "Bangladesh election holds significant implications for India.",
                "India hopes for improved ties with the BNP alliance.",
                "Concerns include security, insurgent groups, and Chinese influence.",
                "A constitutional referendum is also being monitored."
            ]
        },
        {
            "headline": "'Gave poisoned laddoos': How ‘mystical healer’ preyed on greed and left a trail of deaths in Delhi",
            "summary": "A 72-year-old occultist, Kamruddin, has been arrested for allegedly poisoning three people with laddoos in Delhi. Cops describe him as a habitual offender with a criminal history in Uttar Pradesh and Rajasthan, including at least two prior murder cases.",
            "key_points": [
                "Occultist arrested for poisoning three people in Delhi.",
                "Preyed on victims with promises of mystical solutions and wealth.",
                "Suspect has a criminal history, including prior murder cases."
            ]
        },
        {
            "headline": "Taliban Takes the Helm at Afghan Embassy in Delhi: What India Stands to Gain?",
            "summary": "The Taliban has taken control of the Afghan Embassy in Delhi, prompting questions about India's potential gains from this development. This move has significant diplomatic and geopolitical implications for bilateral relations and regional dynamics.",
            "key_points": [
                "Taliban assumes control of the Afghan Embassy in Delhi.",
                "Raises questions about potential diplomatic gains for India.",
                "Significant diplomatic and geopolitical implications are expected."
            ]
        },
        {
            "headline": "Assam final electoral roll shows drop in voters across 25 of 35 districts",
            "summary": "The final electoral roll for Assam indicates a decrease in voters across 25 out of its 35 districts. This demographic shift could have implications for upcoming elections and political strategies in the state.",
            "key_points": [
                "Assam's final electoral roll shows a drop in voter numbers.",
                "Decrease observed in 25 out of 35 districts.",
                "Has potential implications for future elections and political strategies."
            ]
        },
        {
            "headline": "Ukraine will only hold elections after ceasefire, Zelenskyy says",
            "summary": "Ukrainian President Zelenskyy stated that national elections would only be held after a ceasefire, as current martial law prohibits them. This decision aligns with the constitution, which was declared on February 24, 2022, following Russia's full-scale invasion.",
            "key_points": [
                "Ukraine will only hold elections after a ceasefire is in place.",
                "Current martial law prohibits national elections.",
                "Decision adheres to the Ukrainian constitution implemented post-invasion."
            ]
        },
        {
            "headline": "Trump 'insisted' to Netanyahu that US nuclear talks with Iran continue",
            "summary": "Donald Trump reportedly insisted to Benjamin Netanyahu that the US continue nuclear negotiations with Iran. This highlights a complex diplomatic stance and ongoing efforts to address Iran's nuclear program.",
            "key_points": [
                "Trump urged Netanyahu for continued US-Iran nuclear talks.",
                "Highlights complex diplomatic efforts.",
                "Focus on Iran's nuclear program."
            ]
        },
        {
            "headline": "Nine killed as Cyclone Gezani batters Madagascar",
            "summary": "Tropical Cyclone Gezani collapsed houses in Madagascar's main port city and left at least 31 people dead as it crossed the Indian Ocean island with high winds and rain, authorities said Wednesday. The storm caused widespread destruction.",
            "key_points": [
                "Cyclone Gezani struck Madagascar, causing significant damage.",
                "At least 31 people have died.",
                "High winds and heavy rain led to widespread destruction."
            ]
        }
    ],
    "Business": [
        {
            "headline": "India's Defence Budget Rises by 15%: What Does it Mean for Indian Military?",
            "summary": "India's defense budget has seen a significant 15% increase, raising questions about its implications for the Indian military. This boost is expected to impact modernization efforts, procurement processes, and overall strategic capabilities.",
            "key_points": [
                "India's defense budget increased by 15%.",
                "Expected to impact military modernization and procurement.",
                "Raises questions about overall strategic capabilities and readiness."
            ]
        },
        {
            "headline": "Russia Stays Vital to India’s Oil Supply: Oil Analyst Rejects US Claim",
            "summary": "An oil analyst rejected US claims, asserting that Russia remains vital to India's oil supply despite international pressure. This underscores the enduring energy partnership between the two nations and India's strategic reliance on Russian crude.",
            "key_points": [
                "Russia is vital to India's oil supply, according to an oil analyst.",
                "US claims challenging this reliance were rejected.",
                "Highlights the enduring energy partnership between India and Russia."
            ]
        },
        {
            "headline": "'Historic deal': Donald Trump hails India-US trade agreement",
            "summary": "Donald Trump has lauded the India-US trade agreement as a \"historic deal,\" emphasizing its significance for economic ties between the two nations. This endorsement highlights the positive reception and potential impact of the agreement.",
            "key_points": [
                "Donald Trump calls the India-US trade agreement a \"historic deal.\"",
                "Emphasizes the significance for bilateral economic ties.",
                "Highlights the positive reception of the agreement."
            ]
        },
        {
            "headline": "Budget sets total expenditure at Rs 53.47 lakh crore for 2026-27 as govt balances growth with fiscal discipline: FM Sitharaman",
            "summary": "Finance Minister Nirmala Sitharaman announced a total expenditure of Rs 53.47 lakh crore for the 2026-27 budget, aiming to balance growth with fiscal discipline. The budget outlines strategies to support economic expansion while maintaining financial prudence.",
            "key_points": [
                "Total budget expenditure for 2026-27 set at Rs 53.47 lakh crore.",
                "Government aims to balance economic growth with fiscal discipline.",
                "Announcement made by FM Nirmala Sitharaman."
            ]
        },
        {
            "headline": "Direct tax collections rise 9.4% to Rs 19.44 lakh cr; corporate tax drives growth",
            "summary": "Direct tax collections have increased by 9.4% to Rs 19.44 lakh crore, with corporate tax primarily driving this growth. This strong performance indicates robust economic activity and improved tax compliance within the country.",
            "key_points": [
                "Direct tax collections rose by 9.4% to Rs 19.44 lakh crore.",
                "Corporate tax was the main driver of this growth.",
                "Indicates robust economic activity and improved tax compliance."
            ]
        },
        {
            "headline": "SBI overtakes TCS, ICICI Bank to become India’s 4th most valuable listed firm",
            "summary": "State Bank of India (SBI) has surpassed TCS and ICICI Bank in market capitalization, becoming India's fourth most valuable listed firm. This significant achievement reflects a strong performance and growing investor confidence in the public sector bank.",
            "key_points": [
                "SBI becomes India's 4th most valuable listed firm.",
                "Overtakes TCS and ICICI Bank in market capitalization.",
                "Reflects strong performance and investor confidence."
            ]
        },
        {
            "headline": "RBI strengthens mis-selling norms, full refund if proven",
            "summary": "The Reserve Bank of India (RBI) has reinforced its norms against mis-selling financial products, promising a full refund to customers if mis-selling is proven. This stringent measure aims to protect consumers and enhance trust in the financial sector.",
            "key_points": [
                "RBI strengthens anti-mis-selling norms for financial products.",
                "Customers guaranteed full refund if mis-selling is proven.",
                "Aims to protect consumers and boost trust in the financial sector."
            ]
        },
        {
            "headline": "Viksit Bharat: Rolls Royce CEO meets PM Modi",
            "summary": "The CEO of Rolls Royce met with Prime Minister Narendra Modi as part of the 'Viksit Bharat' initiative, indicating potential collaborations and investments in India. This high-profile meeting underscores international interest in India's development goals and economic potential.",
            "key_points": [
                "Rolls Royce CEO met with PM Modi.",
                "Meeting linked to the 'Viksit Bharat' initiative.",
                "Signals potential international collaborations and investments in India."
            ]
        },
        {
            "headline": "Spotify shares rise after record profits and spike in subscribers",
            "summary": "Spotify's shares have surged following the announcement of record profits and a significant increase in subscribers. This strong financial performance indicates continued growth and market confidence in the streaming giant, pushing its stock higher.",
            "key_points": [
                "Spotify shares rose due to record profits.",
                "Attributed to a significant spike in subscribers.",
                "Reflects continued growth and market confidence."
            ]
        },
        {
            "headline": "Heineken to cut up to 6,000 jobs as beer demand weakens",
            "summary": "Heineken plans to cut up to 6,000 jobs globally as it faces weakening demand for beer. This move reflects a strategic adjustment by the brewing giant to address challenging market conditions and optimize operations worldwide.",
            "key_points": [
                "Heineken plans to cut up to 6,000 jobs.",
                "Decision driven by weakening global beer demand.",
                "Represents a strategic adjustment to market conditions."
            ]
        }
    ],
    "Technology": [
        {
            "headline": "'Trying to isolate over 100m users': Russia blocks WhatsApp — will the ban be reversed?",
            "summary": "Russia attempted to block WhatsApp and Telegram, aiming to promote domestic platforms and increase internet control. WhatsApp stated this move would isolate over 100 million users, potentially reducing safety and sparking international concern.",
            "key_points": [
                "Russia attempts to block WhatsApp and Telegram.",
                "Aims to promote domestic platforms and increase internet control.",
                "WhatsApp warns of isolating over 100 million users and reducing safety."
            ]
        },
        {
            "headline": "Russia prepares Key Agenda for India AI Impact Summit 2026: Lavrov",
            "summary": "Russian Foreign Minister Lavrov announced that Russia is preparing a key agenda for the India AI Impact Summit 2026. This highlights the growing cooperation between India and Russia in the rapidly evolving field of artificial intelligence.",
            "key_points": [
                "Russia is preparing a key agenda for the India AI Impact Summit 2026.",
                "Announcement made by Russian Foreign Minister Lavrov.",
                "Highlights growing India-Russia cooperation in artificial intelligence."
            ]
        },
        {
            "headline": "Elon Musk shelves Mars plans and shifts focus to city on the Moon",
            "summary": "Elon Musk has reportedly put his ambitious Mars colonization plans on hold, shifting his primary focus to building a city on the Moon. This change in strategy signals a re-evaluation of his long-term space exploration goals.",
            "key_points": [
                "Elon Musk reportedly shelves Mars colonization plans.",
                "Shifts primary focus to building a city on the Moon.",
                "Represents a re-evaluation of his space exploration objectives."
            ]
        },
        {
            "headline": "AI agents need 'background checks' like humans, says Cisco's president",
            "summary": "Cisco's president stated that AI agents should undergo \"background checks\" similar to human employees, emphasizing the need for trust and accountability in AI development. This highlights growing concerns about AI ethics and responsible deployment in various applications.",
            "key_points": [
                "Cisco's president advocates for 'background checks' for AI agents.",
                "Emphasizes the need for trust and accountability in AI development.",
                "Highlights growing concerns about AI ethics and responsible deployment."
            ]
        },
        {
            "headline": "Could your home security system be your biggest threat?",
            "summary": "This article explores the potential vulnerabilities of modern home security systems, raising concerns that they could inadvertently become a significant security risk. It delves into issues like hacking and data privacy, urging users to consider the hidden dangers.",
            "key_points": [
                "Examines potential vulnerabilities in modern home security systems.",
                "Raises concerns about hacking and data privacy risks.",
                "Suggests that security systems could become a threat if compromised."
            ]
        }
    ],
    "Entertainment": [
        {
            "headline": "James Van Der Beek, star of 'Dawson's Creek', passes away at 48 after battle with colorectal cancer",
            "summary": "James Van Der Beek, widely recognized for his starring role in 'Dawson's Creek', has passed away at the age of 48. His family confirmed he died after a battle with colorectal cancer, leaving fans and colleagues mourning the loss of the beloved actor.",
            "key_points": [
                "James Van Der Beek passed away at 48.",
                "Cause of death was a battle with colorectal cancer.",
                "He was best known for his role in 'Dawson's Creek'."
            ]
        }
    ],
    "Sports": [
        {
            "headline": "‘We have got one more day’: Tilak Varma shares big Abhishek, Bumrah fitness update",
            "summary": "Tilak Varma provided positive fitness updates on Abhishek Sharma, who has been discharged from the hospital after a stomach infection, and Jasprit Bumrah, who is recovering well. Final decisions on their availability for the upcoming match against Namibia will be made closer to game time, as the team also prepares for their high-voltage encounter against Pakistan.",
            "key_points": [
                "Abhishek Sharma discharged from hospital after stomach infection.",
                "Jasprit Bumrah is recovering well and boosting team hopes.",
                "Availability for Namibia match to be decided soon.",
                "Team is also preparing for the Pakistan clash."
            ]
        },
        {
            "headline": "Bumrah yorker hits Ishan, Sanju Samson on standby for Abhishek",
            "summary": "Jasprit Bumrah showed good form in training, boosting hopes for his return against Namibia. Ishan Kishan faced a brief scare after being hit by a Bumrah yorker but resumed batting, while Sanju Samson is in contention if Abhishek Sharma's stomach infection persists.",
            "key_points": [
                "Jasprit Bumrah showed good form in training.",
                "Ishan Kishan was hit by a yorker but resumed batting.",
                "Sanju Samson is on standby for Abhishek Sharma.",
                "Washington Sundar also trained well."
            ]
        },
        {
            "headline": "From India vs Pakistan in 2007 to Afghanistan vs South Africa in 2026: All tied matches in T20 World Cup",
            "summary": "This article provides a historical overview of all tied matches in the T20 World Cup, from the iconic India vs Pakistan clash in 2007 to the recent Afghanistan vs South Africa game in 2026. It highlights the thrilling and rare occurrences of tied contests in the tournament's history.",
            "key_points": [
                "Comprehensive list of all tied T20 World Cup matches.",
                "Includes the notable India vs Pakistan match from 2007.",
                "Features the recent Afghanistan vs South Africa tied game in 2026."
            ]
        },
        {
            "headline": "NBA trade rumors: Los Angeles Clippers predicted to cut ties with $152.4 million superstar prior offseason after blockbuster James Harden departure",
            "summary": "Following James Harden's departure, the Los Angeles Clippers are predicted to cut ties with a $152.4 million superstar before the offseason. This move would signify a major roster overhaul for the team as they look to rebuild.",
            "key_points": [
                "Clippers predicted to cut ties with a $152.4 million superstar.",
                "This comes after James Harden's departure.",
                "Signifies a major roster overhaul for the team."
            ]
        }
    ],
    "Science": [
        {
            "headline": "Can your home withstand an earthquake? How building materials impact safety and a comeback of ancient techniques",
            "summary": "The article explores how various building materials affect a home's resilience to earthquakes, emphasizing safety. It highlights a renewed interest in ancient, earthquake-resistant construction techniques for modern application, showcasing their potential to improve structural integrity.",
            "key_points": [
                "Examines impact of building materials on earthquake resistance.",
                "Highlights a comeback of ancient, earthquake-resistant techniques.",
                "Focuses on enhancing home safety and structural integrity."
            ]
        },
        {
            "headline": "Russia Ready to Provide Vaccines Against Melanoma This Year",
            "summary": "Russia announced its readiness to provide vaccines against melanoma this year, marking a significant step in medical innovation. This development could have global implications for cancer treatment and prevention strategies, offering new hope to patients.",
            "key_points": [
                "Russia to provide melanoma vaccines this year.",
                "Marks a significant medical innovation.",
                "Could have global implications for cancer treatment."
            ]
        }
    ],
    "Health": [
        {
            "headline": "Damaged skin barrier? Why moisturizing matters more than exfoliating",
            "summary": "This article explains the importance of prioritizing moisturizing over exfoliating when dealing with a damaged skin barrier. It elaborates on how proper hydration helps repair and strengthen the skin's natural defenses, contrasting it with the potential harm of excessive exfoliation.",
            "key_points": [
                "Prioritize moisturizing over exfoliating for a damaged skin barrier.",
                "Moisturizing helps repair and strengthen skin's natural defenses.",
                "Excessive exfoliation can worsen skin barrier issues."
            ]
        },
        {
            "headline": "Hello, Doctor. India’s top doctors here to answer your questions",
            "summary": "TOI+ subscribers now have access to \"Hello, Doctor,\" a first-of-its-kind digital clinic where leading Indian doctors provide evidence-based guidance. The initiative has received phenomenal response, allowing users to send questions for expert medical advice in everyday language.",
            "key_points": [
                "\"Hello, Doctor\" digital clinic launched for TOI+ subscribers.",
                "Provides access to leading Indian doctors for medical advice.",
                "Aims to offer clear, evidence-based guidance in simple language."
            ]
        },
        {
            "headline": "Obesity linked to 70% higher infection risk, study finds",
            "summary": "A new study has found a significant link between obesity and a 70% higher risk of infection. This research underscores the impact of obesity on the immune system and overall susceptibility to various diseases.",
            "key_points": [
                "Obesity is linked to a 70% higher risk of infection.",
                "The study highlights obesity's impact on the immune system.",
                "Increased susceptibility to diseases for obese individuals."
            ]
        },
        {
            "headline": "Drinking coffee or tea daily linked to lower dementia risk, study show",
            "summary": "A study suggests that daily consumption of coffee or tea is linked to a lower risk of dementia. This research offers potential insights into dietary factors that could protect cognitive health and contribute to long-term brain well-being.",
            "key_points": [
                "Daily coffee or tea consumption linked to lower dementia risk.",
                "Study provides insights into cognitive health protection.",
                "Suggests potential dietary factors for brain health."
            ]
        }
    ]
}