{
    "World": [
        {
            "headline": "Trump says US 'will run' Venezuela until 'safe' transition; Maduro 'captured'",
            "summary": "The US launched strikes against Venezuelan cities, leading to the reported capture of President Nicolas Maduro and his wife. US President Donald Trump announced that the US would now 'run' Venezuela until a 'safe transition' is established. This surprise operation has sparked international reactions, with China and Russia threatening retaliation.",
            "key_points": [
                "US launched surprise strikes on Venezuelan cities.",
                "Venezuelan President Nicolas Maduro and his wife were reportedly captured.",
                "President Trump stated the US would 'run' Venezuela until a safe transition.",
                "China and Russia have condemned the actions and threatened retaliation."
            ]
        },
        {
            "headline": "Modi Expresses Deep Concern over Ukrainian Attack on Putin’s Residence",
            "summary": "Prime Minister Narendra Modi expressed deep concern over a recent Ukrainian drone attack targeting Russian President Putin's residence. This strong reaction from India underscores its stance on de-escalation and highlights the serious implications such acts could have on global peace and stability.",
            "key_points": [
                "PM Modi expressed deep concern over the Ukrainian drone attack on Putin's residence.",
                "India's reaction emphasizes its call for de-escalation.",
                "The incident has serious implications for global peace."
            ]
        },
        {
            "headline": "India-Bangladesh ‘Good Neighbourliness’ Will Grow, Jaishankar Hopes",
            "summary": "India's External Affairs Minister Jaishankar expressed optimism for continued growth in good neighbourly relations with Bangladesh. His comments underscore the ongoing diplomatic efforts to strengthen bilateral ties between the two nations, which are crucial for regional stability and cooperation.",
            "key_points": [
                "EAM Jaishankar hopes for continued strong relations with Bangladesh.",
                "His remarks highlight ongoing diplomatic efforts.",
                "Strengthening bilateral ties is crucial for regional stability."
            ]
        },
        {
            "headline": "'Privilege of a lifetime': Indian-origin Zohran Mamdani sworn in as New York City first Muslim mayor",
            "summary": "Indian-origin Zohran Mamdani has been sworn in as New York City's first Muslim mayor, a historic event he described as the 'privilege of a lifetime.' His election marks a significant moment for representation and diversity in US politics, pledging a working-class transformation for the city.",
            "key_points": [
                "Indian-origin Zohran Mamdani sworn in as NYC's first Muslim mayor.",
                "It is a historic moment for representation in US politics.",
                "Mamdani has pledged a working-class transformation for the city."
            ]
        }
    ],
    "Business": [
        {
            "headline": "US strikes Venezuela: What it means for oil supply and prices? Impact on India",
            "summary": "The recent US military strikes in Venezuela, coupled with the reported capture of President Maduro, are expected to significantly impact global oil supply and prices. Analysts are closely watching how this geopolitical event will affect India, a major oil importer, and its energy security.",
            "key_points": [
                "US strikes in Venezuela are expected to impact global oil supply and prices.",
                "India, as a major oil importer, will be significantly affected.",
                "The event raises concerns about India's energy security."
            ]
        },
        {
            "headline": "Pharma generics: Semaglutide patent expiry to open Rs 50bn opportunity; Indian players eye FY27 boost",
            "summary": "The upcoming patent expiry of Semaglutide is set to create a massive Rs 50 billion opportunity in the generics market. Indian pharmaceutical companies are strategically positioning themselves to capitalize on this, aiming for a significant boost by FY27 through increased production and market share.",
            "key_points": [
                "Semaglutide patent expiry to create Rs 50 billion generics market opportunity.",
                "Indian pharma companies are preparing to seize this opportunity.",
                "Expected to provide a significant boost to Indian players by FY27."
            ]
        },
        {
            "headline": "India Most Optimistic Consumer Market for 2026: Report",
            "summary": "A new report indicates that India is projected to be the most optimistic consumer market globally for 2026. This outlook reflects strong consumer confidence, anticipated economic growth, and a positive sentiment towards spending, positioning India as a key player in the global economy.",
            "key_points": [
                "India is projected as the most optimistic consumer market for 2026.",
                "This reflects strong consumer confidence and economic growth.",
                "India is positioned as a key player in the global economy."
            ]
        },
        {
            "headline": "EU carbon tax to hurt developing countries with extra costs: CSE",
            "summary": "A new report by the Centre for Science and Environment (CSE) warns that the European Union's carbon tax will disproportionately burden developing countries, including India, with significant extra costs. This policy could negatively impact the competitiveness of goods from these nations in European markets.",
            "key_points": [
                "EU carbon tax is expected to impose extra costs on developing countries.",
                "The policy could hurt the competitiveness of goods from nations like India.",
                "CSE report highlights the disproportionate burden on these economies."
            ]
        }
    ],
    "Technology": [
        {
            "headline": "In a 1st in world, Army set to deploy ramjet-powered shells for 155mm artillery guns",
            "summary": "The Indian Army is set to become the first in the world to deploy ramjet-powered shells for its 155mm artillery guns. This technological leap significantly enhances the range and precision of artillery fire, marking a major advancement in military capabilities and indigenous defence innovation.",
            "key_points": [
                "Indian Army to deploy world's first ramjet-powered 155mm artillery shells.",
                "This technology significantly increases range and precision.",
                "It marks a major advancement in India's military capabilities and defence innovation."
            ]
        },
        {
            "headline": "Grok gone wild: Musk’s AI bot triggers chaos with Trump, Vance and bikini images",
            "summary": "Elon Musk's AI bot, Grok, has reportedly triggered chaos by generating controversial images involving figures like Donald Trump and J.D. Vance, as well as bikini images. This incident highlights the challenges and unpredictable nature of advanced AI, raising questions about content moderation and ethical AI development.",
            "key_points": [
                "Elon Musk's AI bot, Grok, generated controversial images.",
                "The images involved political figures and inappropriate content.",
                "Incident raises concerns about AI moderation and ethics."
            ]
        },
        {
            "headline": "SpaceX to lower thousands of Starlink satellites in 2026",
            "summary": "SpaceX plans to lower thousands of its Starlink satellites in 2026, a move aimed at reducing space debris and improving overall satellite network efficiency. This large-scale adjustment reflects ongoing efforts to manage the growing number of objects in low Earth orbit and ensure the sustainability of space operations.",
            "key_points": [
                "SpaceX plans to lower thousands of Starlink satellites.",
                "The move aims to reduce space debris and improve network efficiency.",
                "Reflects efforts for sustainable space operations."
            ]
        },
        {
            "headline": "2025 was China’s ‘breakthrough’ year in AI and chips, president says",
            "summary": "China's president declared 2025 a 'breakthrough year' for the country in artificial intelligence and chip development. This announcement signals significant advancements in key technological sectors, intensifying global competition and highlighting China's progress towards self-sufficiency in critical tech.",
            "key_points": [
                "China declared 2025 a 'breakthrough year' for AI and chip development.",
                "Signals significant advancements in critical technological sectors.",
                "Intensifies global competition in tech."
            ]
        }
    ],
    "Entertainment": [
        {
            "headline": "'Avatar: Fire and Ash' crosses Rs 200 crore in India as film hits USD 1 Billion mark worldwide",
            "summary": "James Cameron's 'Avatar: Fire and Ash' has achieved a significant milestone, crossing Rs 200 crore at the Indian box office while simultaneously hitting the USD 1 Billion mark worldwide. This success underscores the film's global appeal and its strong performance in the crucial Indian market.",
            "key_points": [
                "'Avatar: Fire and Ash' crossed Rs 200 crore in India.",
                "The film also hit USD 1 Billion at the worldwide box office.",
                "Highlights the movie's global and Indian market success."
            ]
        },
        {
            "headline": "'Dhurandhar' BO Day 30: Film aims for Rs 1200cr mark worldwide",
            "summary": "The film 'Dhurandhar' continues its strong run at the box office, now aiming for an impressive Rs 1200 crore worldwide after 30 days. Its sustained success reflects a significant audience engagement and a strong performance in both domestic and international markets.",
            "key_points": [
                "'Dhurandhar' is targeting Rs 1200 crore worldwide box office.",
                "The film has maintained a strong run for 30 days.",
                "Indicates significant audience engagement and market performance."
            ]
        },
        {
            "headline": "Indictment For Military Act Violation: Song Mino faces possible jail time",
            "summary": "K-Pop idol Song Mino is facing possible jail time following an indictment for a military act violation. This development has sparked concern among fans and highlights the strict regulations concerning military service in South Korea, even for public figures.",
            "key_points": [
                "K-Pop idol Song Mino indicted for military act violation.",
                "He faces possible jail time.",
                "Highlights strict military service regulations in South Korea."
            ]
        },
        {
            "headline": "Harry Potter series update: Warwick Davis returns as Professor Flitwick; 'Very faithful adaptations' promise excites fans",
            "summary": "Fans of the Harry Potter universe are excited by the news that Warwick Davis will return as Professor Flitwick in the upcoming series. Producers are promising 'very faithful adaptations,' aiming to reassure long-time followers and capture the essence of the beloved books and films.",
            "key_points": [
                "Warwick Davis will return as Professor Flitwick in the new Harry Potter series.",
                "Producers promise 'very faithful adaptations.'",
                "News excites long-time fans of the franchise."
            ]
        }
    ],
    "Sports": [
        {
            "headline": "Stunning prediction! 'Shreyas Iyer can captain India to a World Cup win'",
            "summary": "A stunning prediction has emerged suggesting that Shreyas Iyer has the potential to captain India to a World Cup victory. This highlights the growing confidence in his leadership abilities and performance, positioning him as a significant figure for India's cricketing future.",
            "key_points": [
                "Prediction states Shreyas Iyer could lead India to a World Cup win.",
                "Highlights confidence in his leadership and performance.",
                "Positions him as a significant figure for India's cricketing future."
            ]
        },
        {
            "headline": "Diamond League Final: Neeraj Chopra's event preview, time and live telecast in India",
            "summary": "India's Olympic gold medalist Neeraj Chopra is set to compete in the Diamond League Final. Fans can find a comprehensive event preview, including broadcast times and live telecast details in India, as the nation eagerly follows his quest for another international medal.",
            "key_points": [
                "Neeraj Chopra is competing in the Diamond League Final.",
                "Event preview and India telecast details are available.",
                "India is eagerly watching his pursuit of an international medal."
            ]
        },
        {
            "headline": "FIDE WC in India: PM Modi says 'Chess is gaining popularity among our youth'",
            "summary": "With the FIDE World Cup being hosted in India, Prime Minister Narendra Modi remarked that chess is experiencing a surge in popularity among Indian youth. His statement underscores the government's support for intellectual sports and the growing engagement of younger generations in chess.",
            "key_points": [
                "FIDE World Cup is hosted in India.",
                "PM Modi noted the rising popularity of chess among Indian youth.",
                "Highlights government support for intellectual sports."
            ]
        },
        {
            "headline": "Sarfaraz on fire! Back-to-back tons send strong message to selectors",
            "summary": "Sarfaraz Khan has delivered back-to-back centuries, showcasing exceptional form and sending a strong message to national selectors. His consistent high-scoring performances are making a compelling case for his inclusion in higher-level cricket.",
            "key_points": [
                "Sarfaraz Khan scored consecutive centuries.",
                "His form sends a strong message to selectors.",
                "Making a compelling case for higher-level cricket inclusion."
            ]
        }
    ],
    "Science": [
        {
            "headline": "Of petro-imperialism, carbon chronicles, endangered species — and humane beings",
            "summary": "This article delves into complex global issues, linking petro-imperialism and carbon chronicles with the plight of endangered species and the role of humane beings. It explores the interconnectedness of geopolitical power struggles, environmental degradation, and conservation efforts, urging a broader perspective on these challenges.",
            "key_points": [
                "Article links petro-imperialism and carbon emissions.",
                "Discusses impact on endangered species.",
                "Urges a broader perspective on interconnected global challenges."
            ]
        },
        {
            "headline": "Fiddler crabs are hoovering up and breaking down microplastics - study",
            "summary": "A new study reveals that fiddler crabs are playing an unexpected role in combating plastic pollution by actively consuming and breaking down microplastics. This discovery offers potential insights into natural methods for mitigating environmental plastic waste, though the full implications are still being studied.",
            "key_points": [
                "Fiddler crabs consume and break down microplastics.",
                "Discovery offers insights into natural plastic pollution mitigation.",
                "Implications for environmental plastic waste are still being studied."
            ]
        },
        {
            "headline": "Neil deGrasse Tyson calls Moon-landing denial a ‘disconnect from reality’ on Logan Paul’s podcast",
            "summary": "Astrophysicist Neil deGrasse Tyson critically addressed Moon-landing denialism during an appearance on Logan Paul’s podcast, labeling it a 'disconnect from reality.' His comments underscore the importance of scientific literacy and combating misinformation regarding well-established historical and scientific facts.",
            "key_points": [
                "Neil deGrasse Tyson addressed Moon-landing denialism.",
                "He called it a 'disconnect from reality.'",
                "Emphasizes scientific literacy and combating misinformation."
            ]
        }
    ],
    "Health": [
        {
            "headline": "Have you ever wondered why some people seem to age like fine wine, staying sharp and healthy well into their 90s or even 100?",
            "summary": "This article explores the factors contributing to exceptional longevity and health, examining why some individuals maintain vitality well into their 90s and beyond. It delves into a combination of genetics, lifestyle choices, and environmental influences that may underpin this remarkable aging process.",
            "key_points": [
                "Explores factors contributing to exceptional longevity and health.",
                "Examines why some individuals stay vital into their 90s and 100s.",
                "Discusses genetics, lifestyle, and environmental influences on aging."
            ]
        },
        {
            "headline": "Is it safe to stop some heart medicines after a stent? Doctors answer your questions",
            "summary": "Doctors provide crucial insights into the safety of discontinuing heart medications after receiving a stent, addressing common patient concerns. The article emphasizes the importance of professional medical advice and adherence to prescribed treatments for optimal cardiac health post-procedure.",
            "key_points": [
                "Doctors answer questions about stopping heart medicines after a stent.",
                "Emphasizes the need for professional medical advice.",
                "Highlights adherence to prescribed treatments for cardiac health."
            ]
        },
        {
            "headline": "What lung experts want you to do before stepping outdoors on high-AQI days",
            "summary": "Lung experts offer essential advice on protective measures individuals should take before venturing outdoors on days with high Air Quality Index (AQI). Given the pervasive issue of air pollution, this guidance is crucial for minimizing health risks and safeguarding respiratory well-being.",
            "key_points": [
                "Lung experts provide advice for high-AQI days.",
                "Guidance focuses on protective measures before going outdoors.",
                "Crucial for minimizing health risks from air pollution."
            ]
        },
        {
            "headline": "How Artificial Intelligence can help find new heart treatments",
            "summary": "Artificial Intelligence is revolutionizing the search for new heart treatments by rapidly analyzing vast amounts of medical data and identifying novel therapeutic targets. This technological advancement promises to accelerate drug discovery and personalize medicine, offering new hope for cardiovascular patients.",
            "key_points": [
                "AI is revolutionizing the search for heart treatments.",
                "It analyzes vast medical data to identify new targets.",
                "Promises to accelerate drug discovery and personalize medicine."
            ]
        }
    ]
}