{
    "World": [
        {
            "headline": "Bangladesh: Former PM & BNP chairman Khaleda Zia passes away at 80",
            "summary": "Khaleda Zia, the former Prime Minister of Bangladesh and long-time leader of the Bangladesh Nationalist Party (BNP), has died at the age of 80. Her passing marks a significant moment in Bangladeshi politics, as she was a prominent figure for decades.",
            "key_points": [
                "Khaleda Zia, former PM of Bangladesh and BNP chairman, died at 80.",
                "Her death marks a significant event in the country's political landscape."
            ]
        },
        {
            "headline": "BEST bus mows down 4, injures 14 in Mumbai; driver suspended",
            "summary": "A BEST bus in Mumbai tragically mowed down four people and injured fourteen others in an incident near Bhandup railway station. The driver has been suspended following the accident, which echoes a similar event from a year prior.",
            "key_points": [
                "Four people killed and 14 injured by a BEST bus in Mumbai.",
                "The bus driver has been suspended.",
                "This incident is similar to one that occurred a year ago."
            ]
        },
        {
            "headline": "BJP-Shiv Sena finalise 137-90 seat-sharing deal for BMC campaign",
            "summary": "The BJP and Shiv Sena have successfully finalized their seat-sharing agreement, adopting a 137-90 formula for upcoming campaigns. The allied parties are now set to launch a joint campaign for the Brihanmumbai Municipal Corporation (BMC) elections.",
            "key_points": [
                "BJP and Shiv Sena agreed on a 137-90 seat-sharing formula.",
                "They will conduct a joint campaign for BMC elections."
            ]
        },
        {
            "headline": "Former PM Bhattarai states 'zero chance of monarchy restoration in Nepal'",
            "summary": "Former Prime Minister Baburam Bhattarai has firmly stated that there is \"zero chance\" of the monarchy being restored in Nepal. His comments come amid ongoing political discussions and reflect the current democratic trajectory of the nation.",
            "key_points": [
                "Ex-PM Baburam Bhattarai dismisses monarchy restoration in Nepal.",
                "His statement reinforces Nepal's democratic path."
            ]
        },
        {
            "headline": "SC upholds stringent Pocso provisions, highlights Sengar's dominant position",
            "summary": "The Supreme Court has upheld stringent provisions related to Pocso offenses, emphasizing the dominant position of individuals like Sengar in such cases. This ruling reinforces the judiciary's commitment to protecting minors.",
            "key_points": [
                "Supreme Court upholds stringent Pocso offense provisions.",
                "The ruling underscores the importance of addressing dominant positions in such crimes."
            ]
        },
        {
            "headline": "Trump praises Netanyahu as 'hero' Israel never had, warns of consequences if Israel doesn't exist",
            "summary": "Donald Trump has lauded Benjamin Netanyahu as a \"hero\" for Israel, asserting that the nation \"won't exist if\" certain conditions are not met. His comments reflect strong support for the Israeli leader and a critical perspective on regional stability.",
            "key_points": [
                "Donald Trump called Netanyahu a \"hero\" for Israel.",
                "He linked Israel's existence to specific unstated conditions."
            ]
        },
        {
            "headline": "Putin, Generals Unveil 'Alarming Retaliation' after Kyiv Attacks; Zelensky's Palace at Risk?",
            "summary": "Following alleged attacks by Kyiv on Russian targets, Vladimir Putin and his generals have reportedly unveiled plans for \"alarming retaliation.\" Speculation includes a potential Russian attack on Zelensky's palace, signaling a significant escalation in the conflict.",
            "key_points": [
                "Russia plans \"alarming retaliation\" after Kyiv attacks.",
                "Zelensky's palace is speculated as a potential target.",
                "This suggests a major escalation in the conflict."
            ]
        },
        {
            "headline": "Trump 'humiliates' Zelensky, offers 15-year security deal as Ukraine sought 50",
            "summary": "Donald Trump reportedly \"humiliated\" Ukrainian President Zelensky by offering a 15-year security deal, significantly shorter than the 50 years Ukraine was seeking. This move highlights ongoing tensions and differing priorities between the two leaders regarding long-term security commitments.",
            "key_points": [
                "Trump offered Ukraine a 15-year security deal.",
                "Ukraine was seeking a 50-year security commitment.",
                "The offer indicates a divergence in US-Ukraine security expectations."
            ]
        },
        {
            "headline": "Ukraine 90% towards peace, but final 10% poses biggest challenge",
            "summary": "Ukraine claims to have achieved 90% progress towards a peace settlement, yet acknowledges that the remaining 10% could be the most difficult to resolve. This highlights the complex and often intractable nature of the final stages of peace negotiations.",
            "key_points": [
                "Ukraine believes it is 90% close to a peace agreement.",
                "The final 10% of negotiations are expected to be the most challenging.",
                "Underscores the difficulty of finalizing peace deals."
            ]
        },
        {
            "headline": "Winter storm forecast brings snow and ice to Midwest and Northeast US",
            "summary": "A significant winter storm is forecasted to bring substantial snow and ice, causing widespread concerns across the Midwest and Northeast regions of the United States. Residents are bracing for hazardous travel conditions and potential disruptions.",
            "key_points": [
                "A major winter storm is predicted for the US Midwest and Northeast.",
                "The storm is expected to bring heavy snow and ice.",
                "It will cause hazardous conditions and potential disruptions."
            ]
        },
        {
            "headline": "Rs 450-crore ethanol plant to leave Rajasthan due to farmer protests",
            "summary": "A proposed Rs 450-crore ethanol plant is set to pull out of Rajasthan, citing ongoing farmer protests as the reason. This development underscores the challenges industrial projects face amid local opposition and agricultural concerns.",
            "key_points": [
                "Rs 450-crore ethanol plant will exit Rajasthan.",
                "The decision is a direct result of farmer protests.",
                "Highlights challenges for industrial projects due to local opposition."
            ]
        },
        {
            "headline": "EC: 1.3 lakh Bengal voters unmapped due to tech errors, no hearing",
            "summary": "The Election Commission has announced that 1.3 lakh voters in Bengal remain unmapped due to technical errors, with no further hearings planned for their inclusion. This situation raises concerns about voter disenfranchisement ahead of elections.",
            "key_points": [
                "1.3 lakh voters in Bengal are unmapped due to technical errors.",
                "The Election Commission states no further hearings will be held.",
                "Raises concerns about voter disenfranchisement."
            ]
        },
        {
            "headline": "Elderly deaths and distress reported during SIR hearings in Bengal",
            "summary": "Reports of elderly deaths and significant distress have emerged amidst the ongoing Socio-Economic Review (SIR) hearings across Bengal. Concerns are growing about the impact of these administrative processes on vulnerable populations.",
            "key_points": [
                "Elderly deaths and distress linked to SIR hearings in Bengal.",
                "Concerns raised about the impact on vulnerable populations."
            ]
        },
        {
            "headline": "Four Chennai teens detained for attacking migrant laborers",
            "summary": "Four teenagers in Chennai have been detained by authorities for their alleged involvement in an attack on migrant laborers. The incident highlights concerns about social tensions and safety for migrant communities.",
            "key_points": [
                "Four Chennai teenagers detained for attacking migrant laborers.",
                "Incident raises concerns about migrant safety."
            ]
        },
        {
            "headline": "PIL filed in Supreme Court against racial abuse of North-East people, TOI report cited",
            "summary": "A Public Interest Litigation (PIL) has been filed in the Supreme Court addressing the racial abuse faced by people from India's North-Eastern states. The PIL notably cites a report from The Times of India, bringing the issue to national judicial attention.",
            "key_points": [
                "PIL filed in Supreme Court regarding racial abuse of North-Easterners.",
                "The petition references a TOI report on the issue.",
                "Aims to bring national judicial attention to the problem."
            ]
        },
        {
            "headline": "NCP factions unite for Pune civic polls",
            "summary": "The rival factions of the Nationalist Congress Party (NCP) have decided to set aside their differences and join hands for the upcoming Pune civic polls. This unexpected alliance could significantly impact the electoral landscape of the city.",
            "key_points": [
                "NCP factions have united for the Pune civic polls.",
                "This alliance could influence the city's electoral outcome."
            ]
        },
        {
            "headline": "Rahul Gandhi terms Anjel's killing in Dehradun a 'horrific hate crime'",
            "summary": "Rahul Gandhi has condemned the killing of Anjel in Dehradun as a \"horrific hate crime,\" drawing national attention to the incident. His statement calls for justice and highlights the gravity of such prejudiced acts.",
            "key_points": [
                "Rahul Gandhi labeled the Dehradun killing of Anjel a 'hate crime.'",
                "The statement brings national attention to the incident."
            ]
        },
        {
            "headline": "Teen dies after fall from mall shed in Delhi; family alleges foul play",
            "summary": "A teenager tragically died after falling from a restaurant shed inside a Model Town mall in Delhi, with his family alleging foul play. Police are investigating the circumstances surrounding the incident.",
            "key_points": [
                "Teenager died after falling from a mall shed in Delhi.",
                "Family alleges foul play, police investigation ongoing."
            ]
        },
        {
            "headline": "Karnataka man forces 3-year-old to drink alcohol; excise department acts",
            "summary": "In a disturbing incident in Karnataka, a man was caught forcing a three-year-old child to consume alcohol at a bar, prompting intervention from the excise department. The act has sparked widespread outrage and concern for child welfare.",
            "key_points": [
                "Man forced a 3-year-old to drink alcohol in Karnataka.",
                "Excise department has taken action.",
                "Incident sparked outrage over child welfare."
            ]
        },
        {
            "headline": "Scrap truck topples on Nainital highway, UP power dept driver crushed",
            "summary": "A horrific accident occurred on the Nainital highway when a scrap truck toppled onto a Bolero vehicle, resulting in the immediate death of a Uttar Pradesh power department driver who was crushed alive. Emergency services responded to the scene.",
            "key_points": [
                "Scrap truck overturned on Nainital highway.",
                "UP power department driver was crushed and died."
            ]
        },
        {
            "headline": "Tripura youth Anjel Chakma urged father to take VRS after landing first job before his death",
            "summary": "Anjel Chakma, a youth from Tripura, had urged his father to take voluntary retirement from the BSF after securing his first job, according to kin. This poignant detail emerges following his tragic death in Uttarakhand, emphasizing his aspirations to support his family.",
            "key_points": [
                "Anjel Chakma asked his father to take VRS after getting his first job.",
                "This highlights his aspirations to support his family."
            ]
        },
        {
            "headline": "Bengaluru man driven to brink by wife's suicide, mob, and dowry case; mother survives suicide attempt",
            "summary": "A Bengaluru man was reportedly pushed to the brink by a series of tragedies including his wife's suicide, mob harassment, and a dowry case. His mother survived a suicide attempt when her noose snapped, revealing the extreme distress faced by the family.",
            "key_points": [
                "Bengaluru man faced severe distress from wife's suicide, mob, and dowry case.",
                "His mother survived a suicide attempt.",
                "Highlights extreme family suffering."
            ]
        },
        {
            "headline": "Delhi grapples with severe fog and pollution, AQI hits 'severe'",
            "summary": "Delhi is experiencing its second-longest fog spell of the season, significantly reducing visibility and causing severe air pollution, with the AQI hitting critical levels. Residents are struggling with respiratory issues, and travel has been impacted.",
            "key_points": [
                "Delhi faces its second-longest severe fog spell.",
                "Air quality has deteriorated to 'severe' levels.",
                "Visibility is poor, impacting health and travel."
            ]
        },
        {
            "headline": "Retired IAF engineer murdered by daughter-in-law over property dispute in Delhi",
            "summary": "A retired IAF engineer was brutally murdered by his daughter-in-law in Delhi, reportedly over a property dispute. The accused has been arrested, and the incident highlights domestic conflicts turning deadly.",
            "key_points": [
                "Retired IAF engineer killed by daughter-in-law in Delhi.",
                "Motive was a property dispute.",
                "Accused has been arrested."
            ]
        },
        {
            "headline": "Indian-origin Jagdeep Singh arrested in Canada for fake gun threat",
            "summary": "Jagdeep Singh, an Indian-origin individual, has been arrested in Canada for allegedly threatening a man with a fake gun. The incident is under investigation by Canadian authorities.",
            "key_points": [
                "Indian-origin Jagdeep Singh arrested in Canada.",
                "Accused of threatening a man with a fake gun."
            ]
        },
        {
            "headline": "Canadian journalist discusses potential jail time after two Indians murdered in Toronto",
            "summary": "A Canadian journalist has commented on the recent murders of two Indian individuals in Toronto within a week, discussing potential jail terms of \"maybe up to 3 years\" for related offenses. The tragic incidents have raised concerns within the Indian diaspora.",
            "key_points": [
                "Two Indian individuals murdered in Toronto within a week.",
                "A Canadian journalist discusses potential sentencing for related crimes.",
                "Raises concerns within the Indian community in Canada."
            ]
        },
        {
            "headline": "NRI praises India's growth and affordability after 8-year return",
            "summary": "An NRI who returned to India after eight years abroad shared a viral post commending the country's significant growth and affordability. His observations highlight positive developments and changes within India.",
            "key_points": [
                "An NRI's viral post praises India's growth and affordability.",
                "He returned after an 8-year absence."
            ]
        },
        {
            "headline": "Indian-origin IT worker who assaulted 17 women saved from deportation in Melbourne",
            "summary": "An Indian-origin IT worker, who sexually assaulted 17 women in Melbourne and has a 3-year-old daughter, has reportedly been saved from deportation. The controversial decision has drawn criticism and questions about justice.",
            "key_points": [
                "Indian-origin IT worker assaulted 17 women in Melbourne.",
                "He was saved from deportation despite the crimes.",
                "Decision has sparked controversy."
            ]
        },
        {
            "headline": "Indian-origin student Manojh Lella arrested in Dallas for family threats",
            "summary": "Manoj Lella, an Indian-origin student, has been arrested in Dallas for allegedly threatening his family. The details of the incident are under investigation by local authorities.",
            "key_points": [
                "Indian-origin student Manojh Lella arrested in Dallas.",
                "Accused of threatening his family."
            ]
        },
        {
            "headline": "Indian-origin man in NZ shocked by child's potential deportation",
            "summary": "An Indian-origin man in New Zealand expressed shock and pleaded \"Don't break our family\" upon learning his child faces potential deportation. The case highlights the emotional and legal complexities of immigration policies.",
            "key_points": [
                "Indian-origin man in NZ fears his child's deportation.",
                "Highlights the emotional toll of immigration policies."
            ]
        },
        {
            "headline": "Two Indian women killed in California car crash while seeking jobs",
            "summary": "Two Indian women were tragically killed in a car crash in California, with their families revealing they were in the US looking for jobs. The incident sheds light on the aspirations and vulnerabilities of immigrants.",
            "key_points": [
                "Two Indian women died in a California car crash.",
                "They were in the US seeking employment.",
                "Highlights immigrant aspirations and vulnerabilities."
            ]
        },
        {
            "headline": "Indian-origin electrician rapes 75-year-old in Sydney",
            "summary": "An Indian-origin electrician has been accused of raping a 75-year-old woman in Sydney, reportedly making disturbing comments during the assault. The horrific crime has led to legal proceedings.",
            "key_points": [
                "Indian-origin electrician accused of raping a 75-year-old woman in Sydney.",
                "The incident involves disturbing details."
            ]
        },
        {
            "headline": "Fundraiser seeks justice for Indian-origin man who died in Canadian ER wait",
            "summary": "A fundraiser has been launched seeking justice for an Indian-origin man who tragically died in Canada while waiting at an emergency room. His family asserts their status as Canadian citizens and taxpayers, questioning the healthcare system's accountability.",
            "key_points": [
                "Indian-origin man died waiting at a Canadian ER.",
                "Fundraiser seeks justice, questioning healthcare accountability.",
                "Family highlights their Canadian citizenship and tax contributions."
            ]
        },
        {
            "headline": "Canada physician defends doctors over Indian-origin man's ER death",
            "summary": "A Canadian physician has defended duty doctors, arguing they should not be blamed for the death of an Indian-origin man who died waiting at an ER, likening their situation to \"fighting forest fires with a garden hose.\" The statement highlights systemic issues in healthcare.",
            "key_points": [
                "Canadian physician defends ER doctors regarding an Indian-origin man's death.",
                "Blames systemic issues, not individual doctors.",
                "Compares situation to \"fighting forest fires with a garden hose.\"] compensates for Systemic failures in healthcare."
            ]
        },
        {
            "headline": "Russian forces advance deep into enemy defenses, reports General Gerasimov",
            "summary": "General Staff Chief Gerasimov has announced that Russian forces have successfully advanced deep into enemy defenses in Ukraine. This report indicates significant tactical gains and a shift in the conflict's front lines.",
            "key_points": [
                "Russian forces reportedly made deep advances into enemy lines.",
                "General Staff Chief Gerasimov confirmed the gains."
            ]
        },
        {
            "headline": "Venezuela reaffirms support for Somalia’s territorial integrity",
            "summary": "Venezuela has publicly reaffirmed its strong support for Somalia’s territorial integrity, emphasizing the importance of sovereignty and international law. This statement highlights diplomatic alignments on geopolitical issues.",
            "key_points": [
                "Venezuela publicly supports Somalia's territorial integrity.",
                "Emphasizes sovereignty and international law."
            ]
        },
        {
            "headline": "Thailand and Cambodia agree to resume ceasefire",
            "summary": "Thailand and Cambodia have reached an agreement to resume their ceasefire, a positive step towards de-escalating long-standing border tensions. The decision signals a diplomatic effort to foster regional stability.",
            "key_points": [
                "Thailand and Cambodia agreed to resume their ceasefire.",
                "Aims to de-escalate border tensions."
            ]
        },
        {
            "headline": "Russian Sherpa: G20 incomplete without South Africa",
            "summary": "The Russian Sherpa has stated that the G20 organization is considered incomplete without the inclusion of South Africa, underscoring the nation's critical role in global economic governance. This highlights the importance of broader representation in international forums.",
            "key_points": [
                "Russian Sherpa believes G20 needs South Africa for completeness.",
                "Emphasizes South Africa's crucial role in global economic governance."
            ]
        },
        {
            "headline": "Putin: Russia's high-demand arms production soared since 2022",
            "summary": "President Putin announced that Russia's production of high-demand arms has significantly increased since 2022, signaling a robust military-industrial complex. This surge in production is likely in response to ongoing geopolitical events and demand.",
            "key_points": [
                "Putin stated Russia's arms production has soared since 2022.",
                "Indicates a robust military-industrial complex."
            ]
        },
        {
            "headline": "Russia and US commit to ongoing talks on Ukraine settlement: Kremlin",
            "summary": "The Kremlin has announced that Russia and the United States have committed to continuing talks regarding a settlement in Ukraine. This indicates ongoing diplomatic efforts to resolve the protracted conflict, despite evident disagreements.",
            "key_points": [
                "Russia and US committed to continue Ukraine settlement talks.",
                "Signals ongoing diplomatic efforts despite disagreements."
            ]
        },
        {
            "headline": "Russia asserts contribution to building a just, multipolar world in 2025",
            "summary": "Russia has asserted its significant contribution to establishing a just and multipolar world order in 2025, outlining its vision for global governance. This statement reflects Russia's foreign policy objectives and its role on the international stage.",
            "key_points": [
                "Russia claims a significant role in creating a multipolar world in 2025.",
                "Reflects its foreign policy and vision for global governance."
            ]
        },
        {
            "headline": "Trump: US strikes ISIS targets in Northwest Nigeria",
            "summary": "Donald Trump has confirmed that the US carried out strikes on ISIS targets in Northwest Nigeria. This operation indicates a continued focus on combating extremist groups in Africa.",
            "key_points": [
                "Trump confirmed US strikes on ISIS in Northwest Nigeria.",
                "Reflects ongoing efforts against extremist groups."
            ]
        },
        {
            "headline": "Kremlin announces new Putin-Trump phone call in near future",
            "summary": "The Kremlin has announced that a new phone call between Presidents Putin and Trump is expected to take place in the very near future. This indicates ongoing high-level communication between the two leaders on international affairs.",
            "key_points": [
                "A phone call between Putin and Trump is expected soon.",
                "Signals ongoing high-level communication."
            ]
        },
        {
            "headline": "Russian MoD: Air defence destroys 89 Ukrainian drones",
            "summary": "The Russian Ministry of Defence reported that its air defense systems successfully destroyed 89 Ukrainian drones. This claim highlights the intensity of the ongoing conflict and the efforts to counter aerial threats.",
            "key_points": [
                "Russian air defense systems destroyed 89 Ukrainian drones.",
                "Indicates intense aerial activity in the conflict."
            ]
        },
        {
            "headline": "Russian Army strikes Ukrainian military-linked energy facilities",
            "summary": "The Russian Ministry of Defence announced that the Russian Army has carried out strikes on Ukrainian energy facilities linked to its military operations. This targeting indicates an effort to disrupt Ukraine's logistical and operational capabilities.",
            "key_points": [
                "Russian Army attacked Ukrainian energy facilities.",
                "Targets were linked to military operations.",
                "Aims to disrupt Ukraine's capabilities."
            ]
        },
        {
            "headline": "Russian Army takes control of Andreyevka settlement in Dnepropetrovsk region",
            "summary": "The Russian Army has reportedly taken control of the Andreyevka settlement in Ukraine's Dnepropetrovsk Region. This territorial gain marks a strategic advance in the ongoing conflict.",
            "key_points": [
                "Russian Army gained control of Andreyevka settlement.",
                "Marks a strategic advance in the Dnepropetrovsk region."
            ]
        },
        {
            "headline": "Reports: France reduces handouts for Ukrainian migrants",
            "summary": "Reports indicate that France is scaling back its financial handouts and support for Ukrainian migrants. This policy adjustment could affect thousands of displaced individuals and signals a shift in European aid strategies.",
            "key_points": [
                "France is reportedly reducing aid to Ukrainian migrants.",
                "This policy shift could affect many displaced individuals."
            ]
        },
        {
            "headline": "US VP announces 'breakthrough' in Ukraine talks after Russia-US consultations",
            "summary": "The US Vice President has announced a \"breakthrough\" in Ukraine talks following recent consultations between Russia and the United States. This development suggests potential progress in diplomatic efforts to resolve the conflict.",
            "key_points": [
                "US Vice President announced a \"breakthrough\" in Ukraine talks.",
                "Followed consultations between Russia and the US.",
                "Suggests progress in diplomatic efforts."
            ]
        },
        {
            "headline": "Lavrov threatens Kyiv after alleged drone attack on Putin's residence",
            "summary": "Russian Foreign Minister Sergei Lavrov has issued a direct threat to Kyiv following an alleged drone attack on President Putin's residence. This warning signals a severe escalation in rhetoric and potential for further retaliation.",
            "key_points": [
                "Russian FM Lavrov threatened Kyiv directly.",
                "The threat follows an alleged drone attack on Putin's residence.",
                "Indicates significant escalation."
            ]
        },
        {
            "headline": "Germany's New Year's fireworks: When tradition becomes trauma",
            "summary": "Germany's traditional New Year's fireworks celebrations are increasingly being viewed as a source of trauma due to injuries, accidents, and social disorder. This raises questions about the future of the festive custom.",
            "key_points": [
                "Germany's New Year's fireworks are causing trauma.",
                "Concerns include injuries, accidents, and disorder.",
                "The future of the tradition is being questioned."
            ]
        },
        {
            "headline": "Three Turkish police officers killed in IS group raid",
            "summary": "Three Turkish police officers were killed during a raid on Islamic State (IS) group militants, highlighting the ongoing fight against terrorism in the region. The operation resulted in a significant loss for law enforcement.",
            "key_points": [
                "Three Turkish police officers died during an IS group raid.",
                "Highlights ongoing counter-terrorism efforts."
            ]
        },
        {
            "headline": "North Korea confirms long-range cruise missile test on Sunday",
            "summary": "North Korea has announced that it successfully fired long-range cruise missiles in a test conducted on Sunday. This latest launch continues a series of weapons demonstrations by the reclusive nation, raising regional security concerns.",
            "key_points": [
                "North Korea conducted a long-range cruise missile test on Sunday.",
                "Continues a series of weapons demonstrations.",
                "Raises regional security concerns."
            ]
        },
        {
            "headline": "One dead, three missing after migrant boat sinks off Greek island",
            "summary": "A migrant boat has sunk off a Greek island, resulting in one confirmed death and three individuals reported missing. Rescue operations are underway, highlighting the ongoing humanitarian crisis in the Mediterranean.",
            "key_points": [
                "Migrant boat sank off a Greek island.",
                "One person confirmed dead, three are missing.",
                "Highlights ongoing humanitarian crisis."
            ]
        },
        {
            "headline": "China stages drills near Taiwan, warns 'separatist forces'",
            "summary": "China has conducted military drills near Taiwan, which it states are a clear warning to \"separatist forces.\" These exercises escalate tensions in the region and reiterate Beijing's stance on Taiwan's sovereignty.",
            "key_points": [
                "China held military drills near Taiwan.",
                "Drills are a warning to \"separatist forces.\"",
                "Escalates regional tensions."
            ]
        },
        {
            "headline": "More than 3,000 migrants died reaching Spain in 2025",
            "summary": "Tragically, more than 3,000 migrants lost their lives attempting to reach Spain in 2025, highlighting the extreme dangers of irregular migration routes. This grim statistic underscores the humanitarian crisis at Europe's borders.",
            "key_points": [
                "Over 3,000 migrants died trying to reach Spain in 2025.",
                "Highlights the extreme dangers of irregular migration.",
                "Underscores the humanitarian crisis."
            ]
        },
        {
            "headline": "NATO chief Rutte rejects EU calls for defense independence from US",
            "summary": "NATO chief Mark Rutte has rejected calls for the European Union to establish defense independence from the United States. His stance reinforces the importance of transatlantic cooperation and existing security alliances.",
            "key_points": [
                "NATO chief Rutte rejected EU defense independence from the US.",
                "Emphasizes continued transatlantic cooperation."
            ]
        },
        {
            "headline": "US visa ban targets ex-Commissioner Breton over alleged censorship",
            "summary": "The US has reportedly imposed a visa ban on former European Commissioner Thierry Breton, citing alleged censorship issues. This move is part of a broader debate concerning freedom of speech and digital content moderation.",
            "key_points": [
                "US issued a visa ban on ex-Commissioner Thierry Breton.",
                "The ban is due to alleged censorship.",
                "Highlights ongoing debate on free speech and content moderation."
            ]
        },
        {
            "headline": "Europeans show solidarity with Denmark after Trump’s Greenland threat",
            "summary": "European nations have expressed solidarity with Denmark following Donald Trump’s threat regarding Greenland. The collective response underscores strong alliances and a unified front against perceived external pressures.",
            "key_points": [
                "Europeans stand with Denmark after Trump's Greenland threat.",
                "Highlights strong alliances and unified European front."
            ]
        },
        {
            "headline": "Iran’s currency collapse sparks second day of protests",
            "summary": "The collapse of Iran's currency has triggered a second day of protests, as citizens express anger over economic instability and devaluation. The demonstrations reflect growing public discontent with the financial situation.",
            "key_points": [
                "Iran's currency collapse led to a second day of protests.",
                "Citizens are protesting economic instability."
            ]
        },
        {
            "headline": "Heavy snowfall closes schools in 14 Turkish provinces",
            "summary": "Heavy snowfall has led to the closure of schools in 14 Turkish provinces, giving children an unexpected break. The severe weather conditions have disrupted daily life across a significant portion of the country.",
            "key_points": [
                "Schools closed in 14 Turkish provinces due to heavy snowfall.",
                "Severe weather disrupted daily life."
            ]
        },
        {
            "headline": "Donald Trump calls climate change a 'hoax'; US voter agreement questioned",
            "summary": "Donald Trump has publicly dismissed climate change as a \"hoax,\" raising questions about whether his views align with those of US voters. This article explores public opinion regarding climate science and political rhetoric.",
            "key_points": [
                "Donald Trump publicly stated climate change is a 'hoax.'",
                "Raises questions about US voter agreement with his stance."
            ]
        },
        {
            "headline": "PM Kurti's ruling party wins Kosovo snap election with 50%",
            "summary": "Prime Minister Albin Kurti's ruling party has secured a decisive victory in Kosovo's snap election, winning with 50% of the votes. This outcome solidifies his party's mandate and shapes the country's political future.",
            "key_points": [
                "PM Albin Kurti's party won Kosovo's snap election with 50% of votes.",
                "The victory solidifies their political mandate."
            ]
        }
    ],
    "Business": [
        {
            "headline": "AI, IndiGo in intense competition for pilots, offering up to Rs 50 lakh joining bonus",
            "summary": "Air India and IndiGo are fiercely competing to attract pilots, driven by the fallout from new Flight Duty Time Limitations (FDTL) regulations. The intense demand has led to airlines offering substantial joining bonuses, reportedly up to Rs 50 lakh.",
            "key_points": [
                "Air India and IndiGo are competing for pilots.",
                "New FDTL regulations are increasing pilot demand.",
                "Joining bonuses of up to Rs 50 lakh are being offered."
            ]
        },
        {
            "headline": "Government approves Rs 79,000 crore military modernization projects",
            "summary": "The Indian government has given its mega approval for military modernization projects totaling Rs 79,000 crore. This significant investment is aimed at enhancing the country's defense capabilities and supporting indigenous production.",
            "key_points": [
                "Indian government approves major military modernization.",
                "Projects are valued at Rs 79,000 crore.",
                "Aims to boost defense capabilities."
            ]
        },
        {
            "headline": "Gold prices fall before New Year due to profit booking, focus on 2026",
            "summary": "Gold prices have experienced a decline ahead of the New Year, primarily attributed to profit booking after hitting record highs. Attention is now shifting to the outlook and trends for gold in 2026.",
            "key_points": [
                "Gold prices dropped before the New Year.",
                "The fall is due to profit booking after record highs.",
                "Market focus is now on gold trends for 2026."
            ]
        },
        {
            "headline": "KBC17: Kumar Mangalam Birla discusses close family ties with Ratan Tata",
            "summary": "During an appearance on KBC17, industrialist Kumar Mangalam Birla spoke about the close family ties shared with Ratan Tata, highlighting the strong connections between two of India's most prominent business families. His insights offered a glimpse into their personal relationships.",
            "key_points": [
                "Kumar Mangalam Birla revealed close family ties with Ratan Tata on KBC17.",
                "The discussion highlighted the strong personal connections between their families."
            ]
        },
        {
            "headline": "DAC approves Rs 1,600-crore lease for two more 'Predator' drones",
            "summary": "The Defence Acquisition Council (DAC) has approved a Rs 1,600-crore lease for two additional 'Predator' drones, bolstering India's surveillance and reconnaissance capabilities. This acquisition signifies a continued focus on modernizing military assets.",
            "key_points": [
                "DAC approved a Rs 1,600-crore lease.",
                "The lease is for two more 'Predator' drones.",
                "Aims to enhance India's surveillance capabilities."
            ]
        },
        {
            "headline": "9 bankers, 3 insurance staff, 32 farmers booked in crop damages fraud",
            "summary": "A large-scale crop damages fraud has led to the booking of 9 bankers, 3 insurance staff, and 32 farmers. This extensive network highlights corruption within the agricultural insurance sector, leading to significant financial irregularities.",
            "key_points": [
                "Multiple bankers, insurance staff, and farmers booked for crop damages fraud.",
                "Highlights widespread corruption in agricultural insurance."
            ]
        },
        {
            "headline": "Road ministry to remove arbitration for National Highway disputes over Rs 10 crore",
            "summary": "The Road Ministry plans to eliminate arbitration as a method for resolving disputes exceeding Rs 10 crore in the National Highway sector. This policy change aims to streamline conflict resolution and potentially speed up project execution.",
            "key_points": [
                "Road Ministry to end arbitration for NH disputes over Rs 10 crore.",
                "Aims to streamline conflict resolution in infrastructure projects."
            ]
        },
        {
            "headline": "Top stock market recommendations for December 30, 2025",
            "summary": "This article provides a curated list of top stock market recommendations for December 30, 2025, offering insights for investors. It includes analysis and tips for potential buys in the current market.",
            "key_points": [
                "Provides a list of top stock recommendations.",
                "Offers insights for investors for December 30, 2025."
            ]
        },
        {
            "headline": "Record 44.5GW of green energy added in 2025",
            "summary": "The year 2025 saw a record addition of 44.5 gigawatts (GW) of green energy capacity, marking a significant milestone in renewable energy deployment. This achievement reflects global efforts towards sustainable power generation.",
            "key_points": [
                "A record 44.5 GW of green energy capacity was added in 2025.",
                "Marks significant progress in renewable energy."
            ]
        },
        {
            "headline": "RBI warns banks on KYC rejections, plans new fraud rules amid backlog",
            "summary": "The RBI has issued a directive warning banks against rejecting KYC updates amidst a significant backlog, while also announcing plans for new fraud rules. This move aims to protect customers and streamline banking operations.",
            "key_points": [
                "RBI warns banks about rejecting KYC updates due to backlog.",
                "New fraud rules are being planned by RBI.",
                "Aims to protect customers and streamline banking."
            ]
        },
        {
            "headline": "Government: 8% families received 100 days work under NREGA in last 3 FYs",
            "summary": "The government reported that 8% of eligible families received 100 days of work under the NREGA scheme over the last three financial years. This statistic offers insight into the scheme's reach and impact on rural employment.",
            "key_points": [
                "8% of families received 100 days of NREGA work in the last 3 FYs.",
                "Provides insight into the scheme's rural employment impact."
            ]
        },
        {
            "headline": "Industrial output growth surges to 6.7% in November, a two-year high",
            "summary": "India's industrial output growth surged to 6.7% in November, reaching a two-year high. This robust performance signals a significant recovery and positive momentum in the manufacturing and industrial sectors.",
            "key_points": [
                "Industrial output grew by 6.7% in November.",
                "This marks a two-year high for industrial growth.",
                "Indicates strong recovery in industrial sectors."
            ]
        },
        {
            "headline": "Arvind Fashions to acquire Flipkart’s stake in youth brands arm for Rs 135 crore",
            "summary": "Arvind Fashions has announced its decision to buy Flipkart’s stake in its youth brands arm for Rs 135 crore. This strategic acquisition is set to strengthen Arvind Fashions' position in the youth fashion market.",
            "key_points": [
                "Arvind Fashions is buying Flipkart's stake in a youth brands arm.",
                "The deal is valued at Rs 135 crore.",
                "Aims to strengthen Arvind Fashions' market position."
            ]
        },
        {
            "headline": "Silver price swings 14% in a day in volatile global markets",
            "summary": "Silver prices experienced a dramatic 14% swing within a single day in global markets, underscoring its volatile nature. This significant fluctuation highlights the metal's sensitivity to market dynamics and investor sentiment.",
            "key_points": [
                "Silver prices saw a 14% swing in one day globally.",
                "Demonstrates the metal's high volatility."
            ]
        },
        {
            "headline": "Indian bank profits rise for 7th year as bad loans hit multi-year low",
            "summary": "Indian banks have reported a seventh consecutive year of rising profits, while simultaneously seeing bad loans fall to a multi-year low. This positive trend indicates a healthy and improving financial landscape for the banking sector.",
            "key_points": [
                "Indian banks report 7th consecutive year of profit growth.",
                "Bad loans have fallen to a multi-year low.",
                "Indicates a strong and improving banking sector."
            ]
        },
        {
            "headline": "Oswal's Axis takes Guinea to World Bank, seeking $29 billion",
            "summary": "Oswal's Axis has initiated action against Guinea at the World Bank, seeking a substantial sum of $29 billion. This move signals a major international dispute involving significant financial claims.",
            "key_points": [
                "Oswal's Axis is suing Guinea at the World Bank.",
                "They are seeking $29 billion.",
                "Represents a major international financial dispute."
            ]
        },
        {
            "headline": "Indian exports gain zero-duty access to Australia, minister welcomes 'fresh opportunities'",
            "summary": "Indian exports will now enjoy zero-duty access to Australia, a move welcomed by the minister as opening up \"fresh opportunities.\" This trade agreement is expected to significantly boost bilateral trade relations and economic growth.",
            "key_points": [
                "Indian exports now have zero-duty access to Australia.",
                "Minister hails the move as providing \"fresh opportunities.\"",
                "Expected to boost bilateral trade and economic growth."
            ]
        },
        {
            "headline": "RBI: ATMs reduced in India in FY25 due to digital payment shift",
            "summary": "The Reserve Bank of India (RBI) reports a reduction in the number of ATMs across India in fiscal year 2025, a trend attributed to the growing shift towards digital payments. This reflects the evolving landscape of financial transactions in the country.",
            "key_points": [
                "Number of ATMs in India decreased in FY25.",
                "RBI attributes this to the rise of digital payments.",
                "Reflects changing financial transaction landscape."
            ]
        },
        {
            "headline": "IndiGo cancels over 50 flights due to fog, AI issues advisory",
            "summary": "IndiGo cancelled more than 50 flights on a \"Terrible Tuesday\" due to dense fog, while Air India also issued an advisory to passengers. The widespread disruptions highlight the significant impact of adverse weather on air travel.",
            "key_points": [
                "IndiGo cancelled over 50 flights due to dense fog.",
                "Air India also issued a travel advisory.",
                "Weather significantly disrupted air travel."
            ]
        },
        {
            "headline": "Adani Defence aims to fill India's AWACS gap",
            "summary": "Adani Defence is reportedly focusing on developing solutions to address India's current gap in Airborne Warning and Control System (AWACS) capabilities. This strategic initiative could bolster national security and defense readiness.",
            "key_points": [
                "Adani Defence is working to bridge India's AWACS deficiency.",
                "The initiative aims to enhance national security."
            ]
        },
        {
            "headline": "China begins rare-earth magnet exports to India: Report",
            "summary": "China has reportedly started exporting rare-earth magnets to India, marking a significant development in trade relations for critical materials. This move could impact India's manufacturing and technology sectors.",
            "key_points": [
                "China started exporting rare-earth magnets to India.",
                "Significant for trade relations and India's tech sector."
            ]
        },
        {
            "headline": "Ruble strengthens against 'weaponized' dollar amid global confidence in Russia's stewardship",
            "summary": "The Ruble has reportedly gained significant strength against the US dollar, which some describe as \"weaponized,\" as Russia's economic stewardship supposedly wins global confidence. This narrative suggests a shift in international financial dynamics.",
            "key_points": [
                "Ruble strengthened against the US dollar.",
                "Attributed to global confidence in Russia's economic management.",
                "Suggests a shift in international financial dynamics."
            ]
        },
        {
            "headline": "US Investing Icon hails Russia-Alaska tunnel plan as 'wonderful vision'",
            "summary": "A prominent US investing icon has praised the proposed Russia-Alaska tunnel plan as a \"wonderful\" and visionary project for the future. This endorsement highlights potential long-term infrastructure developments and international connectivity.",
            "key_points": [
                "US investing icon praised the Russia-Alaska tunnel plan.",
                "Called it a \"wonderful\" vision for future infrastructure."
            ]
        },
        {
            "headline": "Global trade fractured in 2025 due to tariffs and new 'China shock'",
            "summary": "Global trade experienced significant disruption in 2025, characterized by the widespread implementation of tariffs and a new \"China shock\" to the international economy. These factors contributed to a complex and challenging year for commerce worldwide.",
            "key_points": [
                "Global trade was severely disrupted in 2025.",
                "Tariffs played a major role in the disruption.",
                "A new \"China shock\" impacted the international economy."
            ]
        },
        {
            "headline": "Portuguese minister calls for end to energy price distortions",
            "summary": "A Portuguese minister has stated that \"energy price distortions must end,\" highlighting concerns about market imbalances and their impact on consumers and businesses. This call advocates for more equitable energy policies within Europe.",
            "key_points": [
                "Portuguese minister calls for an end to distorted energy prices.",
                "Highlights concerns about market imbalances.",
                "Advocates for more equitable European energy policies."
            ]
        },
        {
            "headline": "Exclusive: Details emerge on how Ukraine secured €90 billion EU loan",
            "summary": "An exclusive report details the intricate negotiations and conditions that led to Ukraine securing a massive €90 billion loan from the European Union. This financial package is crucial for Ukraine's wartime economy and reconstruction.",
            "key_points": [
                "Report details how Ukraine obtained a €90 billion EU loan.",
                "Highlights complex negotiations for critical financial aid."
            ]
        }
    ],
    "Technology": [
        {
            "headline": "Complete guide to taking screenshots on MacOS",
            "summary": "This comprehensive guide provides a step-by-step tutorial on taking screenshots on MacOS, covering all built-in tools, various keyboard shortcuts, system settings, and different file formats. It aims to equip users with all necessary knowledge for efficient screen capturing.",
            "key_points": [
                "Detailed guide for taking screenshots on MacOS.",
                "Covers built-in tools, keyboard shortcuts, and file formats."
            ]
        },
        {
            "headline": "India narrowing AI gap with Silicon Valley, says Elevation's Krishna Mehra",
            "summary": "Krishna Mehra of Elevation Capital asserts that India has significantly narrowed the artificial intelligence gap with Silicon Valley. This indicates India's growing prowess and investment in the cutting-edge technology sector.",
            "key_points": [
                "Krishna Mehra claims India is closing the AI gap with Silicon Valley.",
                "Highlights India's increasing capabilities in AI."
            ]
        },
        {
            "headline": "Amit Shah: India gears up for chip independence and global push",
            "summary": "Home Minister Amit Shah announced that India is preparing for chip independence and a global push in semiconductor manufacturing. This ambitious plan aims to reduce reliance on foreign imports and establish India as a key player in the tech industry.",
            "key_points": [
                "Amit Shah stated India aims for chip independence.",
                "India plans a global push in semiconductor manufacturing.",
                "Aims to reduce foreign reliance and become a tech leader."
            ]
        },
        {
            "headline": "Europe defends digital rules after US targets Breton with visa ban",
            "summary": "Europe is defending its digital regulations after the US reportedly targeted Commissioner Thierry Breton with a visa ban. This diplomatic spat highlights ongoing tensions over digital policy and regulatory sovereignty between the two powers.",
            "key_points": [
                "Europe defends its digital rules against US actions.",
                "US reportedly imposed a visa ban on Commissioner Breton.",
                "Highlights tensions over digital policy between Europe and US."
            ]
        },
        {
            "headline": "'AI slop': What's next for the internet in 2026?",
            "summary": "This article explores the concept of \"AI slop\" and its implications for the future of the internet in 2026. It discusses how the proliferation of low-quality, AI-generated content might shape online experiences.",
            "key_points": [
                "Examines \"AI slop\" and its impact on the internet's future.",
                "Discusses proliferation of low-quality, AI-generated content."
            ]
        },
        {
            "headline": "How 2025 redefined social media: From age verification to AI slop",
            "summary": "The year 2025 saw social media significantly redefined by new developments ranging from widespread age verification measures to the emergence of \"AI slop\" content. These changes impacted user experience and content moderation policies.",
            "key_points": [
                "2025 brought major changes to social media.",
                "Includes developments like age verification and \"AI slop.\"",
                "Impacted user experience and content policies."
            ]
        },
        {
            "headline": "Report reveals top European countries using generative AI tools",
            "summary": "This article explores a report detailing which countries in Europe are most actively utilizing generative AI tools. The findings shed light on regional adoption rates and the varying integration of AI across European economies.",
            "key_points": [
                "Identifies European countries with highest generative AI tool usage.",
                "Reveals regional adoption rates and AI integration."
            ]
        },
        {
            "headline": "Robots in 2025: Expanding presence in sports, homes, and hospitals",
            "summary": "The year 2025 saw a notable expansion of robots into diverse environments, from assisting in sports arenas to integrated roles in homes and hospitals. This trend highlights the increasing versatility and adoption of robotic technology.",
            "key_points": [
                "Robots expanded into sports arenas, homes, and hospitals in 2025.",
                "Highlights increasing versatility and adoption of robotics."
            ]
        },
        {
            "headline": "AI video depicting Paris coup causes Macron major headache",
            "summary": "An AI-generated video falsely depicting a coup in Paris has caused significant political problems for President Macron, highlighting the growing threat of deepfake technology and misinformation. The incident underscores the challenges of verifying digital content.",
            "key_points": [
                "AI-generated video falsely showed a coup in Paris.",
                "Caused political issues for President Macron.",
                "Highlights the threat of deepfake misinformation."
            ]
        }
    ],
    "Entertainment": [
        {
            "headline": "Ranveer Singh's 'Dhurandhar' crosses Rs 1078 crore worldwide box office",
            "summary": "Ranveer Singh's latest film, 'Dhurandhar', has achieved a massive box office success, grossing an astounding Rs 1078 crore worldwide by its 25th day. This makes it one of the highest-earning films of the year.",
            "key_points": [
                "'Dhurandhar' starring Ranveer Singh achieved Rs 1078 crore worldwide.",
                "The film's box office performance is exceptional."
            ]
        },
        {
            "headline": "Salman Khan emotional at 'Ikkis' screening, pauses by Dharmendra's poster",
            "summary": "During the screening of the film 'Ikkis', Bollywood superstar Salman Khan was visibly emotional, particularly when he paused by a poster of veteran actor Dharmendra. The moment captured the deep respect and connection he shares with the industry legend.",
            "key_points": [
                "Salman Khan showed emotion at the 'Ikkis' film screening.",
                "He was particularly moved by Dharmendra's poster.",
                "The event highlighted his respect for the veteran actor."
            ]
        },
        {
            "headline": "Optical illusion test: Couple or bomb? Reveals your relationship view",
            "summary": "An intriguing optical illusion personality test asks viewers to identify whether they see a couple in love or a bomb explosion first. The initial perception reportedly reveals insights into one's beliefs about love and relationships.",
            "key_points": [
                "Optical illusion reveals insights into views on love and relationships.",
                "First image seen (couple or bomb) indicates belief or fear in relationships."
            ]
        },
        {
            "headline": "Gingerbread tradition signals escalation in Jenner-Chalamet romance",
            "summary": "A recent gingerbread tradition has sparked speculation that the romance between Jenner and Chalamet is seriously escalating. Fans are interpreting this festive activity as a sign of their deepening relationship.",
            "key_points": [
                "A gingerbread tradition hints at a growing romance between Jenner and Chalamet.",
                "Fans see this as a sign of their relationship deepening."
            ]
        },
        {
            "headline": "Kannada TV actress Nandini CM dies by suicide in Bengaluru",
            "summary": "Kannada television actress Nandini CM has tragically died by suicide in Bengaluru. The news has sent shockwaves through the entertainment industry and among her fans.",
            "key_points": [
                "Kannada TV actress Nandini CM died by suicide.",
                "The incident occurred in Bengaluru."
            ]
        },
        {
            "headline": "Vijay prioritized respect, insisted Mohanlal's name first in 'Jilla'",
            "summary": "In a notable display of respect, actor Vijay reportedly insisted that superstar Mohanlal's name appear first in the credits for their film 'Jilla'. This gesture highlighted his regard for the veteran actor over personal stardom.",
            "key_points": [
                "Actor Vijay ensured Mohanlal's name appeared first in 'Jilla' credits.",
                "This act demonstrated Vijay's respect for the veteran actor."
            ]
        },
        {
            "headline": "South Korean beauty creator Daddoa dies at 29, shocking fans globally",
            "summary": "Popular South Korean beauty creator Daddoa has tragically passed away at the age of 29, leaving her vast fanbase across the world in shock and mourning. Her sudden death has sparked an outpouring of tributes.",
            "key_points": [
                "South Korean beauty creator Daddoa died at age 29.",
                "Her death shocked fans worldwide."
            ]
        },
        {
            "headline": "Legendary French actress Brigitte Bardot dies aged 91",
            "summary": "Brigitte Bardot, the iconic French actress and animal rights activist, has passed away at the age of 91. Her death marks the end of an era for French cinema and global activism.",
            "key_points": [
                "Iconic French actress Brigitte Bardot died at 91.",
                "Known for her contributions to cinema and animal rights."
            ]
        },
        {
            "headline": "Cecilia Giménez, painter who 'botched' Ecce Homo, dies at 94",
            "summary": "Cecilia Giménez, famously known as the amateur painter who \"botched\" the Ecce Homo fresco restoration, has died at the age of 94. Her unexpected restoration gained worldwide notoriety and became a cultural phenomenon.",
            "key_points": [
                "Cecilia Giménez, known for the \"botched\" Ecce Homo, died at 94.",
                "Her restoration gained unexpected global fame."
            ]
        }
    ],
    "Sports": [
        {
            "headline": "Smriti Mandhana nearing record, set to surpass Shubman Gill",
            "summary": "Smriti Mandhana is on the verge of making history, needing just 62 more runs to surpass Shubman Gill in a significant cricket record. Her next performance could see her achieve this notable milestone.",
            "key_points": [
                "Smriti Mandhana needs 62 runs to break a record.",
                "She is poised to surpass Shubman Gill's achievement."
            ]
        },
        {
            "headline": "Who is Steve Ballmer? Los Angeles Clippers' owner in controversy",
            "summary": "Steve Ballmer, the owner of the Los Angeles Clippers, is facing scrutiny amid controversies involving Aspiration and Kawhi Leonard. This article delves into his life, net worth, and the details surrounding these recent issues.",
            "key_points": [
                "Steve Ballmer is the owner of the LA Clippers.",
                "He is currently involved in controversies with Aspiration and Kawhi Leonard.",
                "The article covers his life and financial status."
            ]
        },
        {
            "headline": "UConn routs Butler 94-47, extends winning streak to 29 games",
            "summary": "UConn delivered a dominant performance against Butler, defeating them 94-47 and extending their impressive winning streak to 29 games. This road victory further solidifies their strong season.",
            "key_points": [
                "UConn defeated Butler with a score of 94-47.",
                "The team extended its winning streak to 29 games."
            ]
        },
        {
            "headline": "No. 4 UCLA tops Ohio State 82-75, extends winning streak to six",
            "summary": "Fourth-ranked UCLA secured a victory over Ohio State with a score of 82-75, pushing their winning streak to six games. This win came during a crucial Big Ten play showdown.",
            "key_points": [
                "UCLA defeated Ohio State 82-75.",
                "The victory extended UCLA's winning streak to six games."
            ]
        },
        {
            "headline": "Lakers end skid with 124-101 win over Kings, led by Doncic and James",
            "summary": "The Lakers successfully ended their three-game losing streak, securing a 124-101 victory against the Kings. The team's strong performance was spearheaded by Luka Dončić and LeBron James.",
            "key_points": [
                "Lakers snapped a three-game losing streak.",
                "They defeated the Kings 124-101.",
                "Luka Dončić and LeBron James led the team to victory."
            ]
        },
        {
            "headline": "'Shreyas Iyer can captain India to a World Cup win,' stunning prediction states",
            "summary": "A bold prediction suggests that Shreyas Iyer possesses the leadership qualities to captain India to a World Cup victory. This assertion has sparked debate and excitement among cricket enthusiasts about his potential future role.",
            "key_points": [
                "Prediction claims Shreyas Iyer could lead India to a World Cup win.",
                "Highlights his potential as a future captain."
            ]
        },
        {
            "headline": "Cricketers like Clarke and Yuvraj who bravely battled cancer",
            "summary": "This article profiles several cricketers, including Michael Clarke and Yuvraj Singh, who have courageously fought and overcome cancer. Their stories serve as an inspiration both on and off the field.",
            "key_points": [
                "Highlights cricketers who battled cancer.",
                "Features inspirational stories from figures like Clarke and Yuvraj."
            ]
        },
        {
            "headline": "Tendulkar's surprising pick for his favorite among 201 wickets",
            "summary": "Sachin Tendulkar, despite taking 201 wickets in his career, has revealed a surprising choice for his single favorite. His selection offers a unique insight into his memorable moments on the pitch.",
            "key_points": [
                "Sachin Tendulkar has a surprising favorite among his 201 wickets.",
                "Offers a unique insight into his playing career."
            ]
        },
        {
            "headline": "Indian-origin Jatinder Singh to captain Oman in Asia Cup 2025",
            "summary": "Indian-origin cricketer Jatinder Singh has been named the captain for Oman in the upcoming Asia Cup 2025. This leadership role marks a significant milestone in his career and for Oman cricket.",
            "key_points": [
                "Jatinder Singh, of Indian origin, will captain Oman in Asia Cup 2025.",
                "A significant milestone for his career and Oman cricket."
            ]
        },
        {
            "headline": "Neeraj Chopra's Diamond League Final: Preview, time, and India telecast",
            "summary": "A preview of Neeraj Chopra's performance at the Diamond League Final provides details on his event, along with crucial information on its timing and live telecast options in India. Fans can anticipate another strong showing from the javelin star.",
            "key_points": [
                "Details on Neeraj Chopra's Diamond League Final event are available.",
                "Information provided for Indian viewers on timing and live telecast."
            ]
        },
        {
            "headline": "PM Modi: Chess gaining popularity among Indian youth during FIDE WC",
            "summary": "During the FIDE World Championship in India, Prime Minister Narendra Modi remarked on the increasing popularity of chess among Indian youth. His statement highlights the growing interest in intellectual sports in the country.",
            "key_points": [
                "PM Modi noted the rising popularity of chess among Indian youth.",
                "Comments made during the FIDE World Championship in India."
            ]
        },
        {
            "headline": "Sehwag faces criticism for promoting India vs Pakistan match",
            "summary": "Former cricketer Virender Sehwag has come under fire for promoting an India vs Pakistan match, with critics invoking the sentiment \"We can't forget Pahalgam.\" The controversy highlights the sensitive political undertones often associated with sporting events between the two nations.",
            "key_points": [
                "Virender Sehwag criticized for promoting IND vs PAK match.",
                "Critics referenced \"Pahalgam,\" linking sports to political sentiments."
            ]
        },
        {
            "headline": "Aaryavir Sehwag follows father's footsteps, smashes boundaries",
            "summary": "Aaryavir Sehwag, son of cricketing legend Virender Sehwag, is making waves with his impressive batting skills, \"smashing boundaries for fun.\" His emergence suggests he might be following in his father's illustrious footsteps.",
            "key_points": [
                "Aaryavir Sehwag, Virender Sehwag's son, is showcasing strong batting skills.",
                "He appears to be following in his father's cricketing footsteps."
            ]
        },
        {
            "headline": "Sachin Tendulkar reveals 'two reasons' for Dhoni's promotion over Yuvraj",
            "summary": "Sachin Tendulkar has finally broken his silence on why MS Dhoni was promoted ahead of Yuvraj Singh in a crucial match, revealing \"two reasons\" for the strategic decision. His insights clarify a long-standing question among cricket fans.",
            "key_points": [
                "Sachin Tendulkar explained Dhoni's promotion over Yuvraj.",
                "He cited \"two reasons\" for the decision.",
                "Clarifies a historical cricketing strategy."
            ]
        },
        {
            "headline": "Hanuma Vihari moves to Tripura after leaving Andhra Pradesh",
            "summary": "Cricketer Hanuma Vihari has made a significant move, joining the Tripura cricket team after parting ways with Andhra Pradesh. This transfer marks a new chapter in his domestic career.",
            "key_points": [
                "Cricketer Hanuma Vihari has joined Tripura.",
                "He previously played for Andhra Pradesh."
            ]
        },
        {
            "headline": "Rohit Sharma opens up on returning to action",
            "summary": "Rohit Sharma has shared his thoughts on the necessity of returning to the field, expressing a personal drive to play again. His statement offers a glimpse into his current mindset and future plans.",
            "key_points": [
                "Rohit Sharma expressed his desire to return to play.",
                "His comments give insight into his current focus."
            ]
        },
        {
            "headline": "Sarfaraz hits back-to-back centuries, sending strong message to selectors",
            "summary": "Sarfaraz Khan is in exceptional form, having scored back-to-back centuries, which is sending a strong message to national selectors. His consistent performance is making a compelling case for higher-level consideration.",
            "key_points": [
                "Sarfaraz Khan has scored consecutive centuries.",
                "His performance is a strong signal to selectors."
            ]
        },
        {
            "headline": "Samson scores century in KCL thriller, but Muhammad steals the show",
            "summary": "Sanju Samson smashed a brilliant century in a thrilling KCL match, but it was Muhammad who ultimately stole the show with his impactful performance. The game delivered high drama and individual brilliance.",
            "key_points": [
                "Sanju Samson scored a century in a KCL match.",
                "Muhammad's performance overshadowed Samson's century."
            ]
        },
        {
            "headline": "Social media reacts after Kyrgios beats Sabalenka in Dubai exhibition",
            "summary": "Social media erupted following Nick Kyrgios's victory over Aryna Sabalenka in a \"Battle of the Sexes\" exhibition match in Dubai. The unexpected result generated significant discussion and engagement online.",
            "key_points": [
                "Nick Kyrgios defeated Aryna Sabalenka in a Dubai exhibition match.",
                "The \"Battle of the Sexes\" result caused a stir on social media."
            ]
        },
        {
            "headline": "Anthony Joshua 'stable' after car crash kills two in Nigeria",
            "summary": "Boxer Anthony Joshua is reported to be in a stable condition after being involved in a car crash in Nigeria that tragically killed two people. The incident is under investigation.",
            "key_points": [
                "Boxer Anthony Joshua was in a car crash in Nigeria.",
                "Two people were killed in the accident.",
                "Joshua is reported to be in stable condition."
            ]
        },
        {
            "headline": "AFCON 2025: Cameroon and Côte d’Ivoire draw, Algeria secures progression",
            "summary": "In the AFCON 2025 qualifiers, Cameroon and Côte d’Ivoire played to a draw, while Algeria secured its progression in the tournament. The results shape the lineup for the upcoming stages of the prestigious African football competition.",
            "key_points": [
                "Cameroon and Côte d’Ivoire drew in AFCON 2025 qualifiers.",
                "Algeria has advanced to the next stage."
            ]
        }
    ],
    "Science": [
        {
            "headline": "5 animals that live centuries longer than humans",
            "summary": "This article explores five incredible animal species known for their astonishing longevity, living for centuries beyond the typical human lifespan. It highlights the biological marvels of the natural world.",
            "key_points": [
                "Discusses five animal species with exceptionally long lifespans.",
                "Highlights natural world's biological marvels."
            ]
        },
        {
            "headline": "Demonic curse tablet found in ancient German latrine sparks debate",
            "summary": "An ancient demonic curse tablet discovered in a German latrine has sparked a debate among historians and archaeologists, questioning whether it signifies medieval witchcraft or an ancient grudge. The find offers a rare glimpse into historical beliefs and practices.",
            "key_points": [
                "Ancient demonic curse tablet found in a German latrine.",
                "Debate whether it's medieval witchcraft or an ancient grudge.",
                "Offers insight into historical beliefs."
            ]
        },
        {
            "headline": "Rosatom delivers first fuel batch for Kudankulam Nuclear Plant Unit 3",
            "summary": "Russia's Rosatom has successfully completed the delivery of the first batch of nuclear fuel for Unit 3 of the Kudankulam Nuclear Power Plant in India. This marks a critical step towards the operationalization of the new reactor.",
            "key_points": [
                "Rosatom delivered the first nuclear fuel batch for Kudankulam Unit 3.",
                "Crucial step for the plant's new reactor operation."
            ]
        },
        {
            "headline": "Russia's Soyuz rocket launches 52 satellites from Vostochny Cosmodrome",
            "summary": "A Russian Soyuz rocket successfully launched from the Vostochny Cosmodrome, placing 52 satellites into orbit. This mission represents a significant achievement in Russia's space program and global satellite deployment.",
            "key_points": [
                "Soyuz rocket launched from Vostochny Cosmodrome.",
                "Successfully placed 52 satellites into orbit."
            ]
        },
        {
            "headline": "Russian Soyuz-2.1a launches from Plesetsk, MoD confirms",
            "summary": "The Russian Ministry of Defence has confirmed the successful launch of a Soyuz-2.1a rocket from the Plesetsk Cosmodrome. This launch contributes to Russia's ongoing space activities and national defense capabilities.",
            "key_points": [
                "Russian Soyuz-2.1a rocket successfully launched from Plesetsk.",
                "Confirmed by the Ministry of Defence."
            ]
        },
        {
            "headline": "Space in 2026: Anticipated Moon missions, eclipses, and auroras",
            "summary": "The year 2026 is set to be significant for space exploration and celestial events, with anticipated Moon missions, stunning eclipses, and vibrant auroras. This outlook provides a glimpse into upcoming astronomical highlights.",
            "key_points": [
                "2026 will feature Moon missions and celestial events.",
                "Anticipated events include eclipses and auroras."
            ]
        },
        {
            "headline": "Hungary’s water guardians use thermal spa waste to combat drought",
            "summary": "In an innovative approach, Hungary’s \"water guardians\" are utilizing waste from thermal spas to fight persistent drought conditions. This sustainable method showcases creative solutions to environmental challenges.",
            "key_points": [
                "Hungary uses thermal spa waste to fight drought.",
                "Showcases an innovative and sustainable environmental solution."
            ]
        },
        {
            "headline": "Outlook for the world's oceans in 2026",
            "summary": "This article offers an outlook on what 2026 might hold for the world's oceans, discussing potential environmental changes, conservation efforts, and scientific discoveries. It highlights ongoing challenges and future prospects for marine ecosystems.",
            "key_points": [
                "Provides a forecast for global oceans in 2026.",
                "Covers potential environmental changes and conservation efforts."
            ]
        }
    ],
    "Health": [
        {
            "headline": "8 expert-backed ways to fall back asleep after waking in panic",
            "summary": "Experiencing panic awakenings at night can disrupt sleep, but experts offer eight practical strategies to help you calm down and fall back asleep. These tips aim to provide effective remedies for disturbed nocturnal rest.",
            "key_points": [
                "Provides 8 expert-backed ways to cope with panic awakenings at night.",
                "Offers strategies to help fall back asleep easily."
            ]
        },
        {
            "headline": "Why a doctor with no heart disease history died of a heart attack",
            "summary": "This article explores the perplexing case of a doctor with no prior history of heart disease who tragically died from a heart attack. It delves into the potential underlying causes and lessons learned from such unexpected fatalities.",
            "key_points": [
                "Examines a case of a doctor dying from a heart attack without prior history.",
                "Investigates potential reasons for unexpected cardiac events."
            ]
        },
        {
            "headline": "'I ran 5km daily but still needed stents: Lessons learned'",
            "summary": "An individual who consistently ran 5km daily shares their surprising experience of still requiring two stents, despite a seemingly healthy lifestyle. The article recounts their personal journey and the crucial lessons they learned about heart health.",
            "key_points": [
                "Personal story of someone active who still required heart stents.",
                "Highlights that exercise alone may not prevent all heart issues.",
                "Shares lessons learned about comprehensive heart health."
            ]
        },
        {
            "headline": "Understanding food noise: Why you can't stop thinking about eating",
            "summary": "This article defines \"food noise\" as the persistent thoughts about eating, exploring its psychological and physiological origins. It aims to shed light on why some individuals find themselves constantly preoccupied with food.",
            "key_points": [
                "Explains \"food noise\" as continuous thoughts about eating.",
                "Investigates the reasons behind constant food preoccupation."
            ]
        },
        {
            "headline": "Understanding body inflammation: Causes, responses, and remedies",
            "summary": "This article provides an overview of what causes inflammation in the body, detailing how the immune system responds to various triggers. It also offers recommended remedies to manage and reduce inflammatory responses.",
            "key_points": [
                "Explains the causes and body's response to inflammation.",
                "Provides recommended remedies for managing inflammation."
            ]
        },
        {
            "headline": "Doctor: 40-50% chronic constipation patients don't respond to laxatives",
            "summary": "A doctor explains that a significant percentage (40-50%) of chronic constipation patients do not respond effectively to traditional laxatives. The article delves into the reasons behind this common issue and explores alternative approaches to treatment.",
            "key_points": [
                "Many chronic constipation patients don't respond to laxatives.",
                "Article explains the reasons and explores alternative treatments."
            ]
        },
        {
            "headline": "5 herbs to combine with giloy for joint inflammation and arthritis pain relief",
            "summary": "This article suggests five specific herbs that can be combined with giloy to effectively relieve pain associated with joint inflammation and arthritis. It offers natural remedies for managing chronic discomfort.",
            "key_points": [
                "Recommends 5 herbs to combine with giloy.",
                "Aims to relieve joint inflammation and arthritis pain."
            ]
        },
        {
            "headline": "Doctor warns against carbonated drinks for children under 5 due to caffeine",
            "summary": "A doctor has issued a warning against giving carbonated drinks to children under five years old, explaining that the caffeine content can overstimulate their developing brains. The advice emphasizes the importance of healthy beverage choices for young children.",
            "key_points": [
                "Doctor advises against carbonated drinks for children under 5.",
                "Caffeine can overstimulate developing brains."
            ]
        },
        {
            "headline": "5 ways AI transformed healthcare in Europe in 2025",
            "summary": "This article outlines five significant ways artificial intelligence transformed healthcare in Europe during 2025. It highlights innovative applications of AI that have improved diagnostics, treatment, and patient care across the continent.",
            "key_points": [
                "Highlights 5 key AI transformations in European healthcare in 2025.",
                "Covers improvements in diagnostics, treatment, and patient care."
            ]
        },
        {
            "headline": "Review of 2025's top health trends on social media",
            "summary": "This article provides a retrospective look at the most prominent health trends that dominated social media platforms throughout 2025. It examines the popularity and impact of these wellness phenomena.",
            "key_points": [
                "Reviews the major health trends on social media in 2025.",
                "Examines their popularity and impact."
            ]
        },
        {
            "headline": "Health in 2025: Medical breakthroughs offering new hope",
            "summary": "The year 2025 brought several medical breakthroughs that offer new hope in the fight against various diseases and conditions. This article highlights key advancements that have the potential to revolutionize healthcare.",
            "key_points": [
                "2025 saw significant medical breakthroughs.",
                "These advancements offer new hope in healthcare.",
                "Potential to revolutionize treatments."
            ]
        },
        {
            "headline": "Why limiting children's screen time is crucial this Christmas",
            "summary": "This article explains why limiting children's screen time is particularly important during the Christmas holiday period. It outlines the health and developmental benefits of reducing digital exposure for young ones.",
            "key_points": [
                "Emphasizes limiting children's screen time during Christmas.",
                "Highlights health and developmental benefits of reduced digital exposure."
            ]
        },
        {
            "headline": "Experts on guilt-free eating: Christmas is not inherently fattening",
            "summary": "Experts clarify that Christmas itself is not inherently fattening, offering insights on how to enjoy festive meals without guilt. The article provides advice for maintaining a balanced perspective on holiday eating.",
            "key_points": [
                "Experts say Christmas eating isn't inherently fattening.",
                "Provides advice for guilt-free festive eating."
            ]
        },
        {
            "headline": "Why swearing can surprisingly be good for your health",
            "summary": "This article explores the unexpected health benefits of swearing, suggesting that it can sometimes be a positive emotional release. It delves into the psychological aspects of profanity and its potential role in well-being.",
            "key_points": [
                "Discusses surprising health benefits of swearing.",
                "Suggests it can be a positive emotional release."
            ]
        }
    ]
}