{
    "World": [
        {
            "headline": "Trump warns Iran against 'hanging' protestors; threatens 'strong action'",
            "summary": "US President Donald Trump has issued a stern warning to Iran, threatening 'strong action' if the government proceeds with the execution of protestors. He urged Iranians to revolt against the regime, pledging support for their cause.",
            "key_points": [
                "Trump threatens strong action against Iran over protestors.",
                "He urged Iranians to 'take over your institutions' and revolt.",
                "This follows ongoing anti-government demonstrations in Iran."
            ]
        },
        {
            "headline": "'Ready to induct women in infantry if there is societal acceptance': Army chief",
            "summary": "India's Army chief stated that the force is prepared to induct women into infantry units, provided there is sufficient societal acceptance. This move would mark a significant shift in gender roles within the Indian military, potentially expanding opportunities for women beyond existing roles.",
            "key_points": [
                "Indian Army chief open to inducting women in infantry.",
                "Condition for induction is 'societal acceptance'.",
                "This signifies potential expansion of women's roles in the military."
            ]
        },
        {
            "headline": "Another Hindu man killed in Bangladesh, 8th casualty since December 18",
            "summary": "A Hindu man has been killed in Bangladesh, marking the eighth such casualty since December 18. This incident raises significant concerns about the safety of religious minorities in the country, especially in the context of recent unrest.",
            "key_points": [
                "Eighth Hindu casualty in Bangladesh since December 18.",
                "Incident highlights concerns about minority safety.",
                "Follows a period of heightened unrest in the region."
            ]
        },
        {
            "headline": "Pakistan sent Sindoor SOS after seeing Indian forces’ movement; 8 terror camps still active along Pakistan-side of border: Army chief",
            "summary": "India's Army chief revealed that Pakistan issued a 'Sindoor SOS' after detecting Indian troop movements, indicating a state of alert. He also stated that eight terror camps remain active on the Pakistani side of the border, underscoring persistent security threats.",
            "key_points": [
                "Pakistan issued a 'Sindoor SOS' in response to Indian troop movement.",
                "Eight active terror camps reportedly exist on Pakistan's side of the border.",
                "Highlights ongoing cross-border security challenges and tensions."
            ]
        },
        {
            "headline": "The great Indian dilemma: Is diaspora gambling with its safety for life abroad? Explained",
            "summary": "This article explores the increasing concerns about the safety of the Indian diaspora abroad, questioning if the pursuit of life overseas comes with significant risks. Recent incidents involving Indian-origin individuals in countries like Canada and the US have brought this issue into sharp focus.",
            "key_points": [
                "Concerns growing about the safety of the Indian diaspora.",
                "Examines risks associated with living abroad for Indians.",
                "Recent incidents in Canada and US highlight the dilemma."
            ]
        },
        {
            "headline": "Shivank Avasthi killer arrested in Canada: Cops believe accused Babatunde Afuwape randomly targeted Indian student, did not know him",
            "summary": "Canadian authorities have arrested the alleged killer of Indian student Shivank Avasthi, identifying him as Babatunde Afuwape. Police believe the targeting was random and that the accused had no prior connection to the victim, raising concerns about safety for international students.",
            "key_points": [
                "Killer of Indian student Shivank Avasthi arrested in Canada.",
                "Police believe the attack was random.",
                "Raises concerns about safety for Indian students abroad."
            ]
        },
        {
            "headline": "India-China Border Calm Settles as Grazing Rights Resume: Indian Army Chief",
            "summary": "The Indian Army Chief confirmed that the border situation with China has stabilized, with traditional grazing rights resuming in certain areas. This development signals a de-escalation of tensions and a return to pre-standoff practices along the disputed frontier.",
            "key_points": [
                "India-China border situation is now calm.",
                "Traditional grazing rights have resumed.",
                "Signals de-escalation along the disputed frontier."
            ]
        },
        {
            "headline": "BRICS Responding to Changing Global Realities: Jaishankar",
            "summary": "India's External Affairs Minister Jaishankar stated that BRICS is actively responding to evolving global realities, highlighting its growing influence in shaping international discourse. This comes as India launches its BRICS Presidency website and logo, signaling its leadership role in the bloc.",
            "key_points": [
                "BRICS is adapting to changing global realities.",
                "India launches its BRICS Presidency website and logo.",
                "Highlights BRICS's increasing influence on global discourse."
            ]
        },
        {
            "headline": "India Counters German Concerns Over Its Russian Defense Partnerships",
            "summary": "India has addressed and countered concerns raised by Germany regarding its defense partnerships with Russia. New Delhi reaffirmed its sovereign right to maintain strategic ties, emphasizing that these relationships are based on national interest and historical cooperation.",
            "key_points": [
                "India addressed German concerns on Russian defense partnerships.",
                "India asserted its right to strategic ties.",
                "Emphasized national interest and historical cooperation."
            ]
        },
        {
            "headline": "Taliban Takes the Helm at Afghan Embassy in Delhi: What India Stands to Gain?",
            "summary": "The Taliban has officially taken control of the Afghan Embassy in Delhi, prompting questions about India's potential diplomatic and strategic gains from this development. This move signifies a shift in engagement, allowing for direct, albeit unofficial, communication channels.",
            "key_points": [
                "Taliban assumes control of Afghan Embassy in Delhi.",
                "Raises questions about India's potential gains.",
                "Signifies a shift in diplomatic engagement for India."
            ]
        },
        {
            "headline": "Chinese Army Conducting Live-Fire Exercises in Yellow Sea From January 12-14",
            "summary": "The Chinese Army is conducting live-fire exercises in the Yellow Sea from January 12-14, as announced by their Ministry of Defense. These drills are part of regular military training but often draw regional attention due to ongoing geopolitical tensions in the South China Sea.",
            "key_points": [
                "Chinese Army conducting live-fire exercises in Yellow Sea.",
                "Drills take place from January 12-14.",
                "Part of regular training, but watched regionally."
            ]
        },
        {
            "headline": "2025 was deadliest year for Ukrainian civilians since 2022, UN says",
            "summary": "The United Nations reports that 2025 marked the deadliest year for Ukrainian civilians since the initial invasion in 2022. This grim statistic underscores the escalating humanitarian crisis and the severe impact of ongoing hostilities on the civilian population.",
            "key_points": [
                "2025 was the deadliest year for Ukrainian civilians since 2022.",
                "UN report highlights escalating humanitarian crisis.",
                "Indicates severe impact of ongoing hostilities."
            ]
        },
        {
            "headline": "Russia targets Ukraine's power grid in another major attack",
            "summary": "Russia has launched another major attack targeting Ukraine's power grid, causing widespread damage and outages across the country. These continued assaults aim to cripple essential infrastructure, impacting civilian life and hampering Ukraine's defense efforts.",
            "key_points": [
                "Russia launched major attack on Ukraine's power grid.",
                "Caused widespread damage and outages.",
                "Aims to cripple essential infrastructure."
            ]
        },
        {
            "headline": "Estonia bans 261 Russians who fought in Ukraine from entering country",
            "summary": "Estonia has imposed a ban on 261 Russian nationals who participated in the conflict in Ukraine, preventing their entry into the country. This measure is part of Estonia's broader policy to sanction individuals involved in the aggression against Ukraine.",
            "key_points": [
                "Estonia banned 261 Russians who fought in Ukraine.",
                "Measure prevents their entry into the country.",
                "Part of Estonia's sanctions policy against aggression."
            ]
        },
        {
            "headline": "Israel cuts ties with three global organisations after US withdrawal",
            "summary": "Israel has severed its ties with three global organizations following the United States' withdrawal from them. This decision aligns Israel's foreign policy with that of its key ally, potentially impacting international cooperation on various fronts.",
            "key_points": [
                "Israel cuts ties with three global organizations.",
                "Decision follows US withdrawal from the same bodies.",
                "Aligns Israel's policy with its key ally."
            ]
        },
        {
            "headline": "US to host Denmark and Greenland officials as Trump renews threats",
            "summary": "The United States is set to host officials from Denmark and Greenland amidst renewed threats from Donald Trump regarding the autonomous territory. The meeting aims to discuss the strategic importance of Greenland and address future cooperation.",
            "key_points": [
                "US to host Denmark and Greenland officials.",
                "Meeting follows renewed threats from Trump regarding Greenland.",
                "Aims to discuss strategic importance and cooperation."
            ]
        },
        {
            "headline": "The Netherlands to propose new sanctions package against Iran",
            "summary": "The Netherlands is preparing to propose a new package of sanctions against Iran, in response to its ongoing actions and human rights concerns. This move reflects growing international pressure on Tehran and calls for accountability from the global community.",
            "key_points": [
                "Netherlands to propose new sanctions against Iran.",
                "In response to Iran's actions and human rights concerns.",
                "Adds to growing international pressure on Tehran."
            ]
        },
        {
            "headline": "European Parliament bans Iranian diplomats in response to crackdown",
            "summary": "The European Parliament has banned Iranian diplomats from its premises, escalating its response to the ongoing crackdown on protests in Iran. This diplomatic measure signifies a strong condemnation of the Iranian regime's actions and a show of support for protestors.",
            "key_points": [
                "European Parliament bans Iranian diplomats from its premises.",
                "Response to ongoing crackdown on protests in Iran.",
                "Strong condemnation of the Iranian regime's actions."
            ]
        },
        {
            "headline": "North Korea's Kim shakes up security detail amid 'decapitation' fears",
            "summary": "North Korean leader Kim Jong Un has reportedly restructured his personal security detail amidst growing fears of a 'decapitation strike.' This shake-up suggests heightened paranoia within the regime and a focus on consolidating internal power.",
            "key_points": [
                "Kim Jong Un shakes up personal security detail.",
                "Action taken amid fears of a 'decapitation strike.'",
                "Suggests heightened paranoia within the North Korean regime."
            ]
        },
        {
            "headline": "Tibetan Government-In-Exile Urges India To Understand China’s Colonial Mindset",
            "summary": "The Tibetan Government-In-Exile has urged India to gain a deeper understanding of China's 'colonial mindset,' suggesting a cautious approach to dealings with Beijing. This appeal highlights the historical and ongoing tensions in the region and emphasizes shared concerns.",
            "key_points": [
                "Tibetan Government-In-Exile urges India to understand China's 'colonial mindset.'",
                "Suggests a cautious approach to relations with Beijing.",
                "Highlights historical tensions and shared concerns."
            ]
        }
    ],
    "Business": [
        {
            "headline": "India's import of Russian crude down 29% month-on-month in Dec: Report",
            "summary": "India's imports of Russian crude oil experienced a significant 29% month-on-month decline in December, according to a recent report. This reduction could signal a shift in India's energy procurement strategy or a response to evolving global oil market dynamics.",
            "key_points": [
                "Indian crude imports from Russia fell 29% in December.",
                "Indicates potential shift in India's energy strategy.",
                "Could reflect changes in global oil market conditions."
            ]
        },
        {
            "headline": "Nvidia AI chips in China! US approves sale of H200 chips; commerce dept sets strict limitations",
            "summary": "The US Commerce Department has approved the sale of Nvidia's advanced H200 AI chips to China, but with strict limitations. This decision reflects the ongoing balancing act between commercial interests and national security concerns in the global technology sector.",
            "key_points": [
                "US allows Nvidia H200 AI chip sales to China.",
                "Commerce Department imposes strict limitations on sales.",
                "Balances commercial and national security interests."
            ]
        },
        {
            "headline": "Budget 2026 expectations: Deloitte calls for customs duty overhaul; seeks higher allocations for exports",
            "summary": "As Budget 2026 approaches, Deloitte India is advocating for a comprehensive overhaul of customs duties and increased allocations for exports. These recommendations aim to boost India's manufacturing competitiveness and strengthen its position in global trade.",
            "key_points": [
                "Deloitte India calls for customs duty reforms in Budget 2026.",
                "Seeks higher budget allocations to promote exports.",
                "Aims to enhance India's manufacturing and global trade."
            ]
        },
        {
            "headline": "What Paytm, Ola and FirstCry stumbles say about founder hubris",
            "summary": "The recent challenges faced by prominent Indian startups like Paytm, Ola, and FirstCry are being seen as cautionary tales about founder hubris. Their struggles highlight the importance of sustainable business models and realistic growth expectations beyond initial hype.",
            "key_points": [
                "Paytm, Ola, FirstCry face recent business stumbles.",
                "Challenges attributed to founder hubris.",
                "Emphasizes need for sustainable models and realistic growth."
            ]
        },
        {
            "headline": "Mutual fund SIP inflows surge to Rs 3.34 lakh cr in 2025; contributions peaked in December",
            "summary": "Mutual Fund SIP (Systematic Investment Plan) inflows in India surged to an impressive Rs 3.34 lakh crore in 2025, with contributions peaking in December. This robust growth indicates increasing investor confidence and a growing trend towards disciplined long-term investing among Indians.",
            "key_points": [
                "India's mutual fund SIP inflows reached Rs 3.34 lakh crore in 2025.",
                "Monthly contributions peaked in December.",
                "Reflects growing investor confidence and disciplined investing."
            ]
        },
        {
            "headline": "Precious metals surge: Silver jumps Rs 6,000 to lifetime high; gold hits fresh record",
            "summary": "Precious metals markets witnessed a significant surge, with silver prices leaping by Rs 6,000 to reach a new lifetime high, and gold also hitting a fresh record. This rally is driven by various factors, including geopolitical uncertainties and inflation concerns, making safe-haven assets more attractive.",
            "key_points": [
                "Silver jumps Rs 6,000 to a lifetime high.",
                "Gold also reaches a new record price.",
                "Driven by geopolitical uncertainty and inflation concerns."
            ]
        },
        {
            "headline": "On govt nudge, quick commerce firms begin dropping 10-minute promise; experts say it won’t hit business",
            "summary": "Following government encouragement, quick commerce companies in India are starting to abandon their ultra-fast 10-minute delivery promises. Industry experts believe this strategic shift will not significantly impact their business models, suggesting a move towards more sustainable and realistic delivery timelines.",
            "key_points": [
                "Quick commerce firms dropping 10-minute delivery promise.",
                "Initiative follows government 'nudge'.",
                "Experts anticipate minimal impact on business."
            ]
        },
        {
            "headline": "Russia Boosts Economic Cooperation at Indian Regional Forum",
            "summary": "Russia actively enhanced its economic cooperation at an Indian regional forum, underscoring efforts to strengthen bilateral trade and investment ties. Discussions focused on new opportunities for collaboration across various sectors, signaling a strategic alignment between the two nations.",
            "key_points": [
                "Russia increased economic cooperation at an Indian forum.",
                "Aimed at strengthening bilateral trade and investment.",
                "Focused on new opportunities across sectors."
            ]
        },
        {
            "headline": "India Boosts Defense Muscle with Successful Test of Third-Gen MPATGM",
            "summary": "India successfully tested its Third-Generation Man-Portable Anti-Tank Guided Missile (MPATGM), significantly boosting its defense capabilities. This indigenous development enhances the military's anti-armor strength, reducing reliance on foreign imports and bolstering national security.",
            "key_points": [
                "India successfully tested its Third-Gen MPATGM.",
                "Significantly boosts national defense capabilities.",
                "Enhances anti-armor strength and reduces import reliance."
            ]
        }
    ],
    "Technology": [
        {
            "headline": "Isro’s toughest year in decades: 6 launches, 3 strategic setbacks",
            "summary": "The Indian Space Research Organisation (Isro) experienced one of its most challenging years in decades, marked by six launches and three significant strategic setbacks. Despite these difficulties, Isro continues to push the boundaries of space exploration and technology development.",
            "key_points": [
                "Isro faced a tough year with 6 launches and 3 strategic setbacks.",
                "Challenges represent one of its most difficult periods in decades.",
                "Despite setbacks, Isro continues space exploration efforts."
            ]
        },
        {
            "headline": "Apple turns to Google to power AI upgrade for Siri",
            "summary": "Apple is reportedly partnering with Google to enhance its virtual assistant, Siri, by integrating Google's advanced AI capabilities. This collaboration signals Apple's strategic move to catch up in the competitive AI landscape and improve Siri's functionality.",
            "key_points": [
                "Apple partners with Google to upgrade Siri's AI.",
                "Google's AI will power improved Siri functionalities.",
                "Strategic move by Apple to compete in the AI market."
            ]
        },
        {
            "headline": "US Pentagon embraces Elon Musk's Grok despite global backlash",
            "summary": "The US Pentagon has decided to adopt Elon Musk's Grok AI, despite facing global backlash and concerns over its usage. This endorsement highlights the Pentagon's focus on leveraging cutting-edge AI technologies for national security, even amid controversy.",
            "key_points": [
                "US Pentagon adopts Elon Musk's Grok AI.",
                "Decision made despite global backlash.",
                "Focus on advanced AI for national security."
            ]
        },
        {
            "headline": "Why Does Indo-Russian Tech Cooperation Matter More Than Ever Just Now?",
            "summary": "This analysis explores the heightened importance of Indo-Russian technological cooperation in the current geopolitical climate. It suggests that strategic alignments and shared interests are driving a deeper collaboration in technology, particularly in critical sectors.",
            "key_points": [
                "Indo-Russian tech cooperation is gaining increased importance.",
                "Driven by current geopolitical climate and shared interests.",
                "Focus on deeper collaboration in critical technology sectors."
            ]
        }
    ],
    "Entertainment": [
        {
            "headline": "The gravity of glamour: Why the 2026 Golden Globes swapped 'quiet' for 'heavy'",
            "summary": "The 2026 Golden Globes saw a distinct shift in fashion and atmosphere, moving from understated elegance to overt glamour. This trend reflected a collective desire for bold, statement-making looks, signaling a return to opulence in Hollywood.",
            "key_points": [
                "2026 Golden Globes featured a shift to 'heavy' glamour.",
                "Move from 'quiet' elegance to opulent fashion.",
                "Reflects a desire for bold, statement-making red carpet looks."
            ]
        },
        {
            "headline": "'Parasakthi' BO day 4: Sivakarthikeyan film sees slow run",
            "summary": "Sivakarthikeyan's latest film, 'Parasakthi', is experiencing a slow run at the box office on its fourth day, collecting Rs 2.40 crore. This performance suggests a lukewarm reception from audiences despite the star power, impacting its overall commercial success.",
            "key_points": [
                "Sivakarthikeyan's 'Parasakthi' sees slow box office performance.",
                "Collected Rs 2.40 crore on day 4.",
                "Indicates a lukewarm audience reception."
            ]
        },
        {
            "headline": "Supreme Court SLP Hearing: Bench to hear urgent film appeal; CBFC faces political backlash",
            "summary": "The Supreme Court is set to hear an urgent appeal concerning a film, while the Censor Board of Film Certification (CBFC) is facing significant political backlash. This situation highlights ongoing tensions between creative freedom and regulatory oversight within the Indian film industry.",
            "key_points": [
                "Supreme Court to hear urgent film appeal.",
                "CBFC facing political backlash.",
                "Highlights ongoing tensions in Indian film censorship."
            ]
        },
        {
            "headline": "Joe Keery’s Golden Globes moment cements the leading man era",
            "summary": "Joe Keery's appearance at the Golden Globes has been widely acclaimed, solidifying his status as a burgeoning leading man in Hollywood. His sophisticated presence and post-'Stranger Things' glow-up have garnered significant positive attention from fans and critics alike.",
            "key_points": [
                "Joe Keery's Golden Globes appearance was well-received.",
                "Cements his status as a leading man.",
                "His 'glow-up' has been noted by fans and critics."
            ]
        },
        {
            "headline": "'Sarvam Maya': How the film marks Nivin Pauly’s big comeback",
            "summary": "The film 'Sarvam Maya' is being hailed as a major comeback vehicle for actor Nivin Pauly, who has struggled with recent box office performances. Its critical reception and audience response are expected to redefine his career trajectory in the Malayalam film industry.",
            "key_points": [
                "'Sarvam Maya' is seen as Nivin Pauly's comeback film.",
                "Aims to redefine his career after recent struggles.",
                "Critical and audience reception is key to its success."
            ]
        }
    ],
    "Sports": [
        {
            "headline": "Kohli, Rohit discuss '27 ODI WC plans with Gambhir? Batting coach reveals details",
            "summary": "Reports suggest that Virat Kohli and Rohit Sharma, key figures in Indian cricket, have discussed plans for the 2027 ODI World Cup with batting coach Gautam Gambhir. This early strategizing indicates a serious intent to build a strong team for the prestigious tournament.",
            "key_points": [
                "Kohli and Rohit reportedly discussed 2027 ODI World Cup plans.",
                "Discussions held with batting coach Gautam Gambhir.",
                "Highlights early strategic planning for the tournament."
            ]
        },
        {
            "headline": "Sarfaraz on fire! Back-to-back tons send strong message to selectors",
            "summary": "Sarfaraz Khan has delivered back-to-back centuries, sending a powerful message to national selectors for a spot in the Indian cricket team. His consistent high-scoring performances in domestic cricket are putting pressure on the selection committee.",
            "key_points": [
                "Sarfaraz Khan scored consecutive centuries.",
                "Performance is a strong message to national selectors.",
                "Aims for a spot in the Indian cricket team."
            ]
        },
        {
            "headline": "Diamond League Final: Neeraj Chopra's event preview, time and live telecast in India",
            "summary": "A preview of Neeraj Chopra's participation in the Diamond League Final has been released, including details on his event time and live telecast options in India. All eyes will be on the Olympic gold medalist as he aims for another strong performance on the international stage.",
            "key_points": [
                "Preview released for Neeraj Chopra's Diamond League Final event.",
                "Includes event time and live telecast details for India.",
                "Chopra aims for another strong international performance."
            ]
        },
        {
            "headline": "FIDE WC in India: PM Modi says 'Chess is gaining popularity among our youth'",
            "summary": "Prime Minister Narendra Modi noted the growing popularity of chess among Indian youth during the FIDE World Cup in India. His comments underscore the government's recognition of chess as a mind sport and its increasing appeal across the country.",
            "key_points": [
                "PM Modi observes increasing popularity of chess among Indian youth.",
                "Comments made during the FIDE World Cup in India.",
                "Highlights the growing appeal of chess as a mind sport."
            ]
        },
        {
            "headline": "'We can't forget Pahalgam': Sehwag under fire for promoting IND vs PAK",
            "summary": "Former Indian cricketer Virender Sehwag is facing criticism for promoting an India vs Pakistan match, with some reminding him of the Pahalgam incident. This backlash highlights the sensitive political undertones that often accompany sporting events between the two nations.",
            "key_points": [
                "Virender Sehwag criticized for promoting IND vs PAK match.",
                "Reminded of the sensitive Pahalgam incident.",
                "Highlights political tensions around India-Pakistan sports."
            ]
        }
    ],
    "Science": [
        {
            "headline": "Indian-origin scientist Shri Kulkarni wins Royal Astronomical Society’s Gold Medal",
            "summary": "Indian-origin scientist Shri Kulkarni has been awarded the prestigious Gold Medal by the Royal Astronomical Society. This recognition celebrates his significant contributions to the field of astronomy and astrophysics, bringing pride to the global Indian scientific community.",
            "key_points": [
                "Indian-origin scientist Shri Kulkarni awarded Gold Medal.",
                "Awarded by the Royal Astronomical Society.",
                "Recognizes contributions to astronomy and astrophysics."
            ]
        },
        {
            "headline": "Indian-origin mathematician Nalini Joshi named New South Wales’ Scientist of the Year",
            "summary": "Indian-origin mathematician Nalini Joshi has been honored as New South Wales' Scientist of the Year, acknowledging her groundbreaking work in mathematical sciences. Her achievement underscores the global impact of Indian talent in scientific research and innovation.",
            "key_points": [
                "Nalini Joshi, an Indian-origin mathematician, wins Scientist of the Year.",
                "Awarded by New South Wales.",
                "Recognizes her significant contributions to mathematics."
            ]
        }
    ],
    "Health": [
        {
            "headline": "Indore contaminated water crisis: A fortnight later, govt admits 15 deaths",
            "summary": "The government has finally acknowledged 15 deaths in Indore's contaminated water crisis, two weeks after the outbreak. This admission comes amid growing public concern and calls for accountability, highlighting a significant public health failure.",
            "key_points": [
                "Government admits 15 deaths in Indore water crisis.",
                "Admission comes two weeks after outbreak.",
                "Highlights public health failure and accountability issues."
            ]
        },
        {
            "headline": "Pune lab confirms Nipah in 2 samples, both nurses critical",
            "summary": "A lab in Pune has confirmed the presence of the Nipah virus in two samples, with both affected individuals, who are nurses, in critical condition. This confirmation raises immediate public health alarms and prompts urgent containment measures to prevent further spread.",
            "key_points": [
                "Nipah virus confirmed in two samples in Pune.",
                "Both affected individuals are critical nurses.",
                "Triggers immediate public health alert and containment efforts."
            ]
        },
        {
            "headline": "99% of first heart attacks and strokes linked to these 4 risk factors",
            "summary": "A new study indicates that a staggering 99% of first-time heart attacks and strokes are attributable to just four common risk factors. Identifying and managing these factors could significantly reduce the incidence of cardiovascular events globally.",
            "key_points": [
                "99% of first heart attacks and strokes linked to four risk factors.",
                "Highlights critical preventable causes of cardiovascular events.",
                "Emphasizes the importance of managing these factors."
            ]
        },
        {
            "headline": "Air pollution is making people more tired and sick, warns chest physician and reveals the hidden dangers",
            "summary": "A chest physician warns that air pollution is increasingly contributing to fatigue and illness among the population, revealing hidden dangers beyond respiratory issues. The pervasive presence of pollutants is taking a toll on overall public health.",
            "key_points": [
                "Air pollution linked to increased fatigue and illness.",
                "Chest physician warns of hidden health dangers.",
                "Highlights broad impact of pollutants on public health."
            ]
        },
        {
            "headline": "Preschooler’s backpack should be less than 700 grams, worn 6 inches above waist: Spine endoscopist reveals risk of carrying heavy school bags",
            "summary": "A spine endoscopist advises that preschoolers' backpacks should weigh under 700 grams and be worn 6 inches above the waist to prevent health risks. Carrying heavy school bags improperly can lead to significant spinal issues in young children.",
            "key_points": [
                "Preschoolers' backpacks should be under 700 grams.",
                "Should be worn 6 inches above the waist.",
                "Improper carrying risks spinal issues in children."
            ]
        }
    ]
}