{
    "World": [
        {
            "headline": "Trump extends travel ban to over 30 countries, includes Palestine, Syria, Zimbabwe: Full list",
            "summary": "Donald Trump has extended a travel ban to more than 30 countries, notably including Palestine, Syria, and Zimbabwe. This move expands existing restrictions, impacting a significant number of nations and their citizens.",
            "key_points": [
                "Trump extends travel ban to over 30 countries.",
                "Palestine, Syria, and Zimbabwe are among the newly included nations.",
                "The full list of affected countries has been released."
            ]
        },
        {
            "headline": "‘Shock like nothing they’ve seen’: Trump orders naval blockade of Venezuelan oil tankers",
            "summary": "In an unprecedented move, Donald Trump has ordered a naval blockade of Venezuelan oil tankers, intensifying pressure on the Maduro regime. This action has been described as a significant escalation with potentially far-reaching implications.",
            "key_points": [
                "Trump orders a naval blockade of Venezuelan oil tankers.",
                "The move escalates pressure on the Maduro regime.",
                "The action is considered unprecedented and shocking."
            ]
        },
        {
            "headline": "'Radicalised in Sydney': How Bondi beach shooter from Hyderabad’s Toli Chowki took to extremism; visited India 6 times in over 27 years",
            "summary": "The Bondi beach shooter, identified as being from Hyderabad's Toli Chowki, reportedly became radicalized in Sydney and visited India six times over 27 years. This new information provides deeper insight into his path to extremism and his connections to both countries.",
            "key_points": [
                "Bondi beach shooter from Hyderabad radicalized in Sydney.",
                "He visited India six times in 27 years.",
                "The report details his path to extremism and bi-national links."
            ]
        },
        {
            "headline": "H-1Bs getting 221(g) slip from visa officers after social media vetting begins: What does this mean?",
            "summary": "H-1B visa applicants are increasingly receiving 221(g) slips after social media vetting has been implemented by visa officers. This new scrutiny requires additional information or review, causing delays and uncertainty for many applicants.",
            "key_points": [
                "H-1B visa applicants are facing increased scrutiny.",
                "221(g) slips are being issued after social media vetting.",
                "This process is causing delays and uncertainty for applicants."
            ]
        },
        {
            "headline": "'Ram ka naam badnaam na karo', Tharoor tells government",
            "summary": "Shashi Tharoor has urged the government not to tarnish the name of Ram, signaling criticism of political actions or statements. This comes amidst ongoing debates and controversies involving religious and political narratives.",
            "key_points": [
                "Shashi Tharoor criticizes the government.",
                "He warns against tarnishing the name of Ram.",
                "The statement highlights ongoing political and religious debates."
            ]
        },
        {
            "headline": "Nightclub fire: Luthra brothers taken to Goa by police; to be produced at Mapusa court today",
            "summary": "The Luthra brothers, involved in a nightclub fire incident, have been apprehended and transported to Goa by the police. They are scheduled to appear before the Mapusa court today to face legal proceedings.",
            "key_points": [
                "Luthra brothers arrested in connection with a nightclub fire.",
                "Police have taken them to Goa.",
                "They are expected to be produced in Mapusa court today."
            ]
        },
        {
            "headline": "Who is Mustapha Kharbouch? Police release timeline of suspect’s movement in Brown University attack",
            "summary": "Police have released a detailed timeline of suspect Mustapha Kharbouch's movements in connection with the Brown University attack. Authorities are actively working to establish his identity and role in the incident.",
            "key_points": [
                "Police release timeline of Mustapha Kharbouch's movements.",
                "He is a suspect in the Brown University attack.",
                "Authorities are investigating his identity and involvement."
            ]
        },
        {
            "headline": "Vehicle ban chaos: Delhi restricts non-BS VI entry; commuters, residents slam abrupt move",
            "summary": "Delhi has implemented an abrupt ban on non-BS VI vehicles entering the city, leading to widespread chaos and criticism from commuters and residents. The sudden restriction aims to combat air pollution but has caused significant disruption.",
            "key_points": [
                "Delhi imposes abrupt ban on non-BS VI vehicles.",
                "The move has caused chaos and public outcry.",
                "The restriction is aimed at curbing air pollution."
            ]
        },
        {
            "headline": "Epstein Files Showdown: Schumer Challenges Trump, Bondi To ‘COME CLEAN’ Ahead Of Deadline",
            "summary": "Senator Schumer has publicly challenged Donald Trump and Florida AG Bondi to disclose their connections to the Epstein files before a looming deadline. This intensifies political pressure for transparency regarding the controversial documents.",
            "key_points": [
                "Schumer challenges Trump and Bondi on Epstein files.",
                "He demands transparency before the deadline.",
                "The issue heightens political pressure for disclosure."
            ]
        },
        {
            "headline": "Putin ‘LAUGHS’ At Russian Gas Faceoff In EU Parliament; Italy, France & Finland Leaders Fight",
            "summary": "Vladimir Putin reportedly \"laughs\" at the ongoing dispute over Russian gas within the EU Parliament, where leaders from Italy, France, and Finland are in strong disagreement. This highlights deep divisions within the EU regarding energy policy and Russia's role.",
            "key_points": [
                "Putin reacts to EU's Russian gas dispute.",
                "Italy, France, and Finland leaders are at odds.",
                "The incident reveals deep EU divisions on energy policy."
            ]
        },
        {
            "headline": "'Trump's Retribution...': Susie Wiles' EXPLOSIVE Vanity Fair Interviews; White House Responds",
            "summary": "Susie Wiles' explosive interviews in Vanity Fair detailing \"Trump's retribution\" have drawn a response from the White House. The articles likely expose internal dynamics and political maneuvers from the former administration.",
            "key_points": [
                "Susie Wiles' Vanity Fair interviews discuss 'Trump's retribution'.",
                "The White House has issued a response.",
                "The interviews likely reveal insights into Trump's political actions."
            ]
        },
        {
            "headline": "Mark Kelly ‘HUMILIATES’ Trump’s War Secy Amid Refusal To Release Full Venezuela Strike Video",
            "summary": "Senator Mark Kelly reportedly \"humiliated\" Trump's War Secretary during a confrontation over the refusal to release the full video of a Venezuela strike. This incident highlights tensions between the legislature and executive over transparency in military actions.",
            "key_points": [
                "Senator Mark Kelly confronts Trump's War Secretary.",
                "The dispute is over releasing a Venezuela strike video.",
                "Tensions rise over military action transparency."
            ]
        },
        {
            "headline": "‘Obama Dropped BOMBS…’: Senator Sheehy Rips Schumer After Private Venezuela Strike Briefing",
            "summary": "Senator Sheehy criticized Senator Schumer following a private briefing on a Venezuela strike, referencing past actions by the Obama administration. This suggests ongoing political disagreements and differing interpretations of US foreign policy in the region.",
            "key_points": [
                "Senator Sheehy criticizes Schumer after Venezuela strike briefing.",
                "She references Obama administration's past actions.",
                "Highlights political disagreements on foreign policy."
            ]
        },
        {
            "headline": "Flames erupt from windows and, roof as a massive blaze engulfs a NYC apartment building",
            "summary": "A massive blaze has engulfed an apartment building in New York City, with flames seen erupting from windows and the roof. Emergency services are on scene battling the extensive fire.",
            "key_points": [
                "Massive fire engulfs NYC apartment building.",
                "Flames visible from windows and roof.",
                "Emergency services are responding."
            ]
        },
        {
            "headline": "Woman posed as heiress and defrauded nearly $30 million from banks and institutions, FBI says",
            "summary": "The FBI reports that a woman successfully defrauded banks and institutions of nearly $30 million by posing as an heiress. The elaborate scheme highlights sophisticated financial deception.",
            "key_points": [
                "Woman defrauded $30 million by posing as heiress.",
                "The FBI is investigating the case.",
                "The incident showcases a sophisticated financial scam."
            ]
        },
        {
            "headline": "Kay Flock sentenced to 30 yrs in prison for Bronx shootings",
            "summary": "Rapper Kay Flock has been sentenced to 30 years in prison for his involvement in Bronx shootings. The conviction concludes a high-profile case involving the music artist.",
            "key_points": [
                "Rapper Kay Flock receives 30-year prison sentence.",
                "The sentence is for his role in Bronx shootings.",
                "The case concludes a notable legal battle."
            ]
        },
        {
            "headline": "Rob Reiner death case: Nick charged with 2 counts of first-degree murder",
            "summary": "In the Rob Reiner death case, Nick has been charged with two counts of first-degree murder. This development marks a significant step in the ongoing investigation into the tragic deaths.",
            "key_points": [
                "Nick charged with two counts of first-degree murder.",
                "The charges relate to the Rob Reiner death case.",
                "This is a major development in the ongoing investigation."
            ]
        },
        {
            "headline": "Doctor who helped sell ketamine to Perry avoids prison",
            "summary": "The doctor involved in providing ketamine to Matthew Perry, the late actor, has reportedly avoided a prison sentence. This outcome concludes a legal aspect related to the actor's tragic death.",
            "key_points": [
                "Doctor avoids prison sentence in Matthew Perry ketamine case.",
                "The doctor was involved in selling ketamine to the late actor.",
                "The legal proceeding concludes this aspect of Perry's death."
            ]
        },
        {
            "headline": "Vikram Bhatt, wife Shwetambari sent to judicial custody",
            "summary": "Filmmaker Vikram Bhatt and his wife Shwetambari have been sent to judicial custody following legal proceedings. This development indicates serious charges or an ongoing investigation against them.",
            "key_points": [
                "Filmmaker Vikram Bhatt and wife sent to judicial custody.",
                "This follows legal proceedings.",
                "The development suggests serious charges or an investigation."
            ]
        },
        {
            "headline": "SC takes up plea of cash row judge; seeks parliament reply",
            "summary": "The Supreme Court has taken up the plea of a judge involved in a cash row, seeking a reply from the parliament. This indicates a significant legal and political matter being addressed by the highest court.",
            "key_points": [
                "Supreme Court addresses plea of judge in cash row.",
                "Parliament's reply has been sought.",
                "The matter involves significant legal and political implications."
            ]
        },
        {
            "headline": "Relief for Gandhis as court dismisses ED plaint in Herald case",
            "summary": "The Gandhis have received relief as a court dismissed the Enforcement Directorate's complaint in the National Herald case. This decision is a significant development in the long-running legal and political battle.",
            "key_points": [
                "Court dismisses ED complaint in National Herald case.",
                "This brings relief for the Gandhi family.",
                "A significant development in the long-running legal battle."
            ]
        },
        {
            "headline": "No Nehru papers missing from PMML",
            "summary": "Authorities have confirmed that no papers belonging to Jawaharlal Nehru are missing from the Prime Minister's Museum and Library (PMML). This clarification addresses earlier concerns about the integrity of historical documents.",
            "key_points": [
                "No Nehru papers are missing from PMML.",
                "The clarification addresses previous concerns.",
                "Ensures the integrity of historical documents."
            ]
        },
        {
            "headline": "India, Ethiopia now in strategic tie-up",
            "summary": "India and Ethiopia have formalized a new strategic partnership, elevating their bilateral relations. This tie-up is expected to deepen cooperation across various sectors, benefiting both nations.",
            "key_points": [
                "India and Ethiopia establish a strategic partnership.",
                "Bilateral relations are elevated.",
                "Cooperation is expected to deepen across sectors."
            ]
        },
        {
            "headline": "SC: Gangsters jump state to dodge arrest, need one agency for entire NCR",
            "summary": "The Supreme Court has noted that gangsters exploit state borders to evade arrest, advocating for a single agency to handle crime across the entire National Capital Region (NCR). This measure aims to improve law enforcement efficacy.",
            "key_points": [
                "SC notes gangsters exploit state borders.",
                "Advocates for a single agency for NCR crime.",
                "Aims to enhance law enforcement efficacy."
            ]
        },
        {
            "headline": "Sessions court confirms 2 years' jail for Maharashtra minister, brother",
            "summary": "A sessions court has upheld a two-year jail sentence for a Maharashtra minister and his brother, confirming their conviction. This ruling marks a significant legal setback for the political figures.",
            "key_points": [
                "Sessions court confirms 2-year jail for Maharashtra minister and brother.",
                "The conviction is upheld.",
                "This is a significant legal setback for the political figures."
            ]
        },
        {
            "headline": "West Bengal draft voter list: 7cr names included, 58L deleted, 1.7cr flagged for discrepancies",
            "summary": "West Bengal's draft voter list has been updated, including 7 crore names after a SIR deletion drive, while 58 lakh names were deleted and 1.7 crore flagged for discrepancies. This massive exercise aims to refine the electoral roll.",
            "key_points": [
                "West Bengal updates draft voter list.",
                "7 crore names included, 58 lakh deleted.",
                "1.7 crore names flagged for discrepancies."
            ]
        },
        {
            "headline": "Woman’s video on Delhi’s toxic air sparks outcry as she plans to move parents out",
            "summary": "A woman's viral video highlighting Delhi's toxic air has sparked public outcry, as she discusses her plan to move her parents out of the \"gas chamber\" city. Her emotional plea underscores the severe health concerns associated with air pollution.",
            "key_points": [
                "Woman's video on Delhi's toxic air goes viral.",
                "She plans to move her parents due to pollution.",
                "The video highlights severe health concerns in Delhi."
            ]
        },
        {
            "headline": "Gujarat man poses as 'dream bride', dupes 10 friends; 'Kinjal Patel' arrested",
            "summary": "A man in Gujarat was arrested for allegedly posing as a \"dream bride\" named 'Kinjal Patel' and defrauding ten of his friends. This unusual cybercrime case highlights a deceptive social engineering scheme.",
            "key_points": [
                "Gujarat man arrested for cybercrime.",
                "He posed as a 'dream bride' and duped 10 friends.",
                "The case involves a deceptive social engineering scheme."
            ]
        },
        {
            "headline": "Gurgaon Hayabusa crash video: Overspeeding bike crashes into cab; rider tumbles on highway",
            "summary": "A video from Gurgaon shows an overspeeding Hayabusa motorcycle attempting a risky overtake, resulting in a crash with a cab and the rider tumbling on a busy highway. The incident highlights the dangers of reckless driving.",
            "key_points": [
                "Overspeeding Hayabusa crashes into a cab in Gurgaon.",
                "Rider tumbles on a busy highway.",
                "The incident highlights reckless driving dangers."
            ]
        },
        {
            "headline": "Confusion at Bengaluru airport as new cab pickup zones enforced",
            "summary": "Bengaluru's Kempegowda International Airport is experiencing confusion and passenger frustration due to the enforcement of new cab pickup zones. The change has led to chaos and inconvenience for commuters.",
            "key_points": [
                "New cab pickup zones cause confusion at Bengaluru airport.",
                "Passengers report frustration and inconvenience.",
                "The change impacts airport travel infrastructure."
            ]
        },
        {
            "headline": "Chennai’s Anna Nagar parking revamp to add 2,100 bays, ease congestion",
            "summary": "Chennai's Anna Nagar is undergoing a parking revamp that will introduce 2,100 new marked bays, aiming to ease congestion and reduce roadside chaos. This initiative seeks to improve traffic flow and urban planning.",
            "key_points": [
                "Anna Nagar, Chennai, undergoing parking revamp.",
                "2,100 new marked bays will be added.",
                "Aims to ease congestion and improve urban planning."
            ]
        },
        {
            "headline": "'Thiruparankundram pillar is Jain, not Hindu': Tamil Nadu govt tells HC",
            "summary": "The Tamil Nadu government has informed the High Court that the Thiruparankundram pillar is Jain, not Hindu, citing archaeological texts and Digambara practices. This statement clarifies a long-standing debate over the religious attribution of the historical artifact.",
            "key_points": [
                "Tamil Nadu govt states Thiruparankundram pillar is Jain, not Hindu.",
                "Cites archaeological texts and Digambara practices.",
                "Clarifies debate over religious attribution of the artifact."
            ]
        },
        {
            "headline": "Women sue Tinder and Hinge for ‘accommodating rapists’ after being drugged and raped by cardiologist",
            "summary": "Women in Colorado are suing dating apps Tinder and Hinge, alleging the platforms accommodated a cardiologist who drugged and raped them on dates. The lawsuit raises serious questions about dating app safety and accountability.",
            "key_points": [
                "Women sue Tinder and Hinge in Colorado.",
                "Allegations of apps accommodating a rapist cardiologist.",
                "Raises questions about dating app safety and accountability."
            ]
        },
        {
            "headline": "'Ilhan Omar lying': ICE says 'zero record' of her son being pulled over",
            "summary": "ICE has denied claims by Ilhan Omar that her son was pulled over, stating there is \"zero record\" of such an incident and asserting they do not judge by color. This directly refutes her statements, leading to a public dispute.",
            "key_points": [
                "ICE denies Ilhan Omar's claim about son being pulled over.",
                "States 'zero record' of incident and refutes racial bias.",
                "This creates a public dispute over the matter."
            ]
        },
        {
            "headline": "Indian-origin American diplomat says Indians bribe to get US jobs",
            "summary": "An Indian-origin American diplomat has made controversial statements, alleging that Indians bribe to secure jobs in the US, describing it as an \"honor among thieves\" environment. These remarks have stirred debate and potential diplomatic implications.",
            "key_points": [
                "Indian-origin diplomat claims Indians bribe for US jobs.",
                "Describes an 'honor among thieves' environment.",
                "Remarks could stir debate and have diplomatic implications."
            ]
        },
        {
            "headline": "'Going to die in Canada': Indian-origin Jasmeet Singh charged in US for cross-border threats linked to Lawrence Bishnoi gang",
            "summary": "Indian-origin Jasmeet Singh has been charged in the US for making cross-border threats, allegedly linked to the Lawrence Bishnoi gang, stating 'Going to die in Canada'. This case highlights international organized crime connections and threats.",
            "key_points": [
                "Indian-origin Jasmeet Singh charged in US.",
                "Accused of cross-border threats linked to Lawrence Bishnoi gang.",
                "Highlights international organized crime connections."
            ]
        },
        {
            "headline": "Menka Soni becomes first Indian-American woman to take oath on Gita",
            "summary": "Menka Soni has made history as the first Indian-American woman to take an oath on the Bhagavad Gita in the US. This act holds significant cultural and symbolic importance for the Indian diaspora.",
            "key_points": [
                "Menka Soni is the first Indian-American woman to take oath on Gita.",
                "Achieves historical and cultural significance.",
                "Important moment for the Indian diaspora in the US."
            ]
        },
        {
            "headline": "Brampton man, possibly of Indian-origin, killed in parking lot shooting",
            "summary": "A man, possibly of Indian-origin, was killed in a parking lot shooting in Brampton, Canada, with police having to break a window during the investigation. The incident is under investigation as authorities piece together the details.",
            "key_points": [
                "Brampton man, possibly Indian-origin, killed in shooting.",
                "Police had to break window during investigation.",
                "Incident under investigation in Canada."
            ]
        },
        {
            "headline": "Indian-origin man arrested in Canada for faking medical condition to have female physicians touch him",
            "summary": "An Indian-origin man in Canada has been arrested for faking a medical condition, using a fake Sikh name, to manipulate female physicians into touching him. The arrest exposes a disturbing case of deception and exploitation.",
            "key_points": [
                "Indian-origin man arrested in Canada.",
                "Faked medical condition to manipulate female physicians.",
                "Used a fake Sikh name in his scheme."
            ]
        },
        {
            "headline": "Canada unveils new 'Express Entry' category for doctors",
            "summary": "Canada has introduced a new 'Express Entry' category specifically for doctors, aiming to streamline the immigration process for medical professionals. This initiative seeks to attract healthcare talent to the country.",
            "key_points": [
                "Canada introduces new 'Express Entry' category for doctors.",
                "Aims to streamline immigration for medical professionals.",
                "Seeks to attract healthcare talent to the country."
            ]
        },
        {
            "headline": "Indian-origin woman detained by ICE from Green Card interview after living in US since 1994",
            "summary": "An Indian-origin woman, Bubbly Kaur, living in the US since 1994, was detained by ICE during her Green Card interview, describing the experience as a \"nightmare.\" This highlights the complexities and sometimes harsh realities of the US immigration system.",
            "key_points": [
                "Indian-origin woman Bubbly Kaur detained by ICE.",
                "Detained during Green Card interview despite living in US since 1994.",
                "Highlights complexities of US immigration system."
            ]
        },
        {
            "headline": "Ex-boss kills Indian man Gurjit Singh in New Zealand after woman who rejected him marries Singh",
            "summary": "An Indian man, Gurjit Singh, was tragically killed in New Zealand, stabbed over 40 times by his ex-boss after a woman who rejected the boss married Singh. The horrific incident is a case of extreme violence driven by revenge.",
            "key_points": [
                "Indian man Gurjit Singh killed in New Zealand.",
                "Ex-boss stabbed him over 40 times.",
                "Motive appears to be revenge after a woman married Singh."
            ]
        },
        {
            "headline": "Indian-origin millionaire Vikram Beri arrested in US; tried setting California winery on fire; crashed Tesla",
            "summary": "Indian-origin millionaire Vikram Beri was arrested in the US after allegedly attempting to set a California winery on fire and crashing his Tesla into two cars. The incident involves multiple charges and a high-profile individual.",
            "key_points": [
                "Indian-origin millionaire Vikram Beri arrested in US.",
                "Allegedly tried to set California winery on fire.",
                "Crashed his Tesla into two cars."
            ]
        },
        {
            "headline": "Eastern India’s largest indoor facility to come up at Science City, Kolkata",
            "summary": "Eastern India is set to get its largest indoor facility at Science City, Kolkata, aiming to significantly boost the city's MICE (Meetings, Incentives, Conferences, Exhibitions) footfall. This development promises economic and tourism growth.",
            "key_points": [
                "Eastern India to get largest indoor facility in Kolkata.",
                "Located at Science City.",
                "Aims to boost MICE footfall and economic growth."
            ]
        },
        {
            "headline": "Peace plan dilemma: When Ukraine says yes, Russia says no",
            "summary": "The path to peace in Ukraine faces a constant dilemma where a proposal acceptable to Ukraine is rejected by Russia, and vice versa. This deadlock highlights the profound obstacles to a resolution in the ongoing conflict.",
            "key_points": [
                "Peace in Ukraine faces a consistent dilemma.",
                "Proposals accepted by one side are rejected by the other.",
                "Highlights profound obstacles to conflict resolution."
            ]
        },
        {
            "headline": "India, Jordan Deepen Multi-Sector Partnership",
            "summary": "India and Jordan are strengthening their multi-sector partnership, aiming to expand cooperation across various fields. This move signifies a growing strategic alignment and shared interests between the two nations.",
            "key_points": [
                "India and Jordan strengthen multi-sector partnership.",
                "Aim to expand cooperation in various fields.",
                "Signifies growing strategic alignment."
            ]
        },
        {
            "headline": "India's Triumph in 1971 Redrew South Asia's Map: Statement",
            "summary": "A statement highlights India's decisive victory in 1971, which significantly redrew the geopolitical map of South Asia. This historical event had profound and lasting impacts on the region's political landscape.",
            "key_points": [
                "India's 1971 victory significantly impacted South Asia.",
                "The event redrew the region's geopolitical map.",
                "Highlights the lasting effects of the historical triumph."
            ]
        },
        {
            "headline": "Origins of Special Military Operation: The History of Ukrainian Conflict",
            "summary": "An analysis delves into the historical origins of the Ukrainian conflict, framed as the \"Special Military Operation.\" It seeks to provide context for the ongoing geopolitical tensions and the current state of affairs.",
            "key_points": [
                "Analyzes historical origins of the Ukrainian conflict.",
                "Frames it as the 'Special Military Operation'.",
                "Provides context for ongoing geopolitical tensions."
            ]
        },
        {
            "headline": "Kupyansk Under Control of Russian Army: Press Center of Zapad Battlegroup",
            "summary": "The Zapad Battlegroup's press center has announced that Kupyansk is now under the control of the Russian Army. This report marks a significant development in the ongoing military conflict in Ukraine.",
            "key_points": [
                "Kupyansk is reportedly under Russian Army control.",
                "Announcement made by Zapad Battlegroup.",
                "Significant development in the Ukrainian conflict."
            ]
        },
        {
            "headline": "Russian Air Defense Destroys 83 Ukrainian Drones Overnight: MoD",
            "summary": "Russia's Ministry of Defense (MoD) reported that its air defense systems destroyed 83 Ukrainian drones overnight. This indicates continued drone activity and ongoing defensive operations in the conflict zone.",
            "key_points": [
                "Russian MoD reports destruction of 83 Ukrainian drones.",
                "Incident occurred overnight.",
                "Indicates ongoing drone activity and defensive operations."
            ]
        },
        {
            "headline": "India, UAE to Enhance Coordination to Maintain Peace in West Asia: MEA",
            "summary": "India and the UAE have agreed to enhance coordination efforts aimed at maintaining peace and stability in West Asia, as stated by the Ministry of External Affairs (MEA). This collaboration underscores their shared commitment to regional security.",
            "key_points": [
                "India and UAE to enhance coordination for West Asia peace.",
                "MEA statement confirms collaboration.",
                "Underscores shared commitment to regional security."
            ]
        },
        {
            "headline": "Ukraine's NATO Dreams Were Always Doomed: Military Expert",
            "summary": "A military expert argues that Ukraine's aspirations to join NATO were inherently doomed. This analysis provides a critical perspective on the feasibility of Ukraine's integration into the military alliance.",
            "key_points": [
                "Military expert states Ukraine's NATO dreams were doomed.",
                "Provides critical perspective on NATO integration feasibility.",
                "Analysis on the challenges faced by Ukraine's aspirations."
            ]
        },
        {
            "headline": "Putin Ratifies India-Russia Agreement on Sending Troops to Their Territories",
            "summary": "President Putin has ratified an agreement between India and Russia concerning the reciprocal deployment of troops to each other's territories. This significant pact enhances military cooperation and strategic partnership.",
            "key_points": [
                "Putin ratifies India-Russia troop deployment agreement.",
                "Agreement allows reciprocal troop presence.",
                "Enhances military cooperation and strategic partnership."
            ]
        },
        {
            "headline": "India-Armenia Strengthen Defense Ties with Advanced Military Offerings: MEA Spokesperson",
            "summary": "India and Armenia are strengthening their defense ties through advanced military offerings, according to an MEA Spokesperson. This collaboration indicates a growing strategic partnership in defense capabilities.",
            "key_points": [
                "India and Armenia strengthen defense ties.",
                "Collaboration includes advanced military offerings.",
                "Indicates a growing strategic defense partnership."
            ]
        },
        {
            "headline": "Zelensky in Hot Water Seeking to Delay Elections Amid Mounting Political Pressure: Analyst",
            "summary": "An analyst suggests that Ukrainian President Zelensky is facing significant political pressure as he seeks to delay elections. This situation indicates internal challenges and scrutiny over democratic processes during wartime.",
            "key_points": [
                "Zelensky faces political pressure to delay elections.",
                "Analyst suggests he is 'in hot water'.",
                "Highlights internal challenges over democratic processes."
            ]
        },
        {
            "headline": "Russian Air Defenses Down 146 Ukrainian Drones Overnight: MoD",
            "summary": "Russia's Ministry of Defense reports that its air defense systems successfully intercepted and destroyed 146 Ukrainian drones overnight. This signifies continued intense aerial activity and defensive measures in the conflict zone.",
            "key_points": [
                "Russian MoD reports 146 Ukrainian drones destroyed overnight.",
                "Indicates intense aerial activity.",
                "Highlights ongoing defensive measures in conflict zone."
            ]
        },
        {
            "headline": "Seizing Russian Assets Would 'Expose Europe’s Absurdity:' Professor Jeffrey Sachs",
            "summary": "Professor Jeffrey Sachs has stated that seizing Russian assets would \"expose Europe's absurdity,\" implying severe repercussions and flawed logic behind such a move. His comment criticizes potential Western economic actions against Russia.",
            "key_points": [
                "Professor Jeffrey Sachs criticizes seizure of Russian assets.",
                "States it would 'expose Europe's absurdity'.",
                "Highlights potential repercussions and flawed logic."
            ]
        },
        {
            "headline": "NATO Specialists Presence in Ukraine Triggered Russia's Military Operation: Kremlin",
            "summary": "The Kremlin asserts that the presence of NATO specialists in Ukraine was a direct trigger for Russia's military operation. This statement reiterates Russia's justification for the conflict, emphasizing perceived security threats.",
            "key_points": [
                "Kremlin claims NATO specialists in Ukraine triggered Russia's operation.",
                "Reiterates Russia's justification for the conflict.",
                "Emphasizes perceived security threats as a motive."
            ]
        },
        {
            "headline": "Bangladesh Election Commission Demands Increased Security for Staff Ahead of 12 February Elections",
            "summary": "The Bangladesh Election Commission has called for increased security measures for its staff in anticipation of the upcoming February 12 elections. This demand underscores concerns about safety and stability during the electoral process.",
            "key_points": [
                "Bangladesh Election Commission demands increased staff security.",
                "Ahead of February 12 elections.",
                "Highlights safety concerns during electoral process."
            ]
        },
        {
            "headline": "Venezuela Denounces EU's Freeze of Russian Assets' as 'Theft and Piracy'",
            "summary": "Venezuela has vehemently denounced the European Union's freeze of Russian assets, labeling it as \"theft and piracy.\" This strong condemnation reflects a global divide on the legitimacy of sanctions and asset seizures.",
            "key_points": [
                "Venezuela denounces EU's freeze of Russian assets.",
                "Labels the action as 'theft and piracy'.",
                "Reflects global divide on sanctions and asset seizures."
            ]
        },
        {
            "headline": "Russian Air Defense Systems Destroy 141 Ukrainian Drones",
            "summary": "Russian air defense systems have destroyed 141 Ukrainian drones, according to recent reports. This incident reflects ongoing aerial confrontations and the sustained effort to counter drone attacks.",
            "key_points": [
                "Russian air defense systems destroyed 141 Ukrainian drones.",
                "Reflects ongoing aerial confrontations.",
                "Highlights sustained efforts to counter drone attacks."
            ]
        },
        {
            "headline": "Russia to Respond Promptly to State Asset Freeze by EU: Foreign Ministry",
            "summary": "Russia's Foreign Ministry announced that it will respond promptly to any move by the EU to freeze its state assets. This declaration signals a potential escalation in economic and political tensions between Russia and the European Union.",
            "key_points": [
                "Russia warns of prompt response to EU asset freeze.",
                "Statement from Foreign Ministry.",
                "Signals potential escalation in economic tensions."
            ]
        },
        {
            "headline": "Trump Says Prospects for Resolving Ukrainian Conflict Will Soon Become Clear",
            "summary": "Donald Trump has stated that the prospects for resolving the Ukrainian conflict will soon become clear. His comments suggest a potential shift or development in the geopolitical landscape regarding the ongoing war.",
            "key_points": [
                "Trump comments on Ukrainian conflict resolution.",
                "States prospects will 'soon become clear'.",
                "Suggests potential shift in geopolitical landscape."
            ]
        },
        {
            "headline": "Russian Air Defenses Destroy 41 Ukrainian Drones",
            "summary": "Russia's air defense systems reportedly destroyed 41 Ukrainian drones. This latest incident is part of the ongoing aerial engagement in the conflict zone, highlighting continuous drone activity.",
            "key_points": [
                "Russian air defenses destroy 41 Ukrainian drones.",
                "Latest incident in ongoing aerial engagement.",
                "Highlights continuous drone activity in conflict zone."
            ]
        },
        {
            "headline": "All of Donbass Russian: Kremlin on Zelensky's Idea to Hold 'Referendum on Territories'",
            "summary": "The Kremlin has asserted that \"All of Donbass is Russian\" in response to President Zelensky's idea of holding a \"referendum on territories.\" This statement firmly rejects any notion of Ukraine regaining control over the region through such means.",
            "key_points": [
                "Kremlin asserts 'All of Donbass is Russian'.",
                "Response to Zelensky's idea of a 'referendum on territories'.",
                "Firmly rejects Ukraine's potential control over the region."
            ]
        },
        {
            "headline": "Ukraine Simulated Dirty Bomb Based on Ionizing Radiation Sources: Russian MoD",
            "summary": "Russia's Ministry of Defense claims that Ukraine has simulated a \"dirty bomb\" using ionizing radiation sources. This accusation raises serious concerns about potential escalation and the nature of warfare.",
            "key_points": [
                "Russian MoD claims Ukraine simulated 'dirty bomb'.",
                "Based on ionizing radiation sources.",
                "Raises serious concerns about escalation."
            ]
        },
        {
            "headline": "Russian Air Defence Shoots Down 90 Ukrainian Drones: MoD",
            "summary": "The Russian Ministry of Defense reported shooting down 90 Ukrainian drones, continuing the pattern of frequent aerial interceptions. This signifies constant surveillance and defense operations in the conflict.",
            "key_points": [
                "Russian MoD reports shooting down 90 Ukrainian drones.",
                "Part of frequent aerial interceptions.",
                "Signifies constant surveillance and defense operations."
            ]
        },
        {
            "headline": "With Seversk Secured, The Liberation of Donbass Gains Critical Momentum: Military Expert",
            "summary": "A military expert suggests that with Seversk reportedly secured, the \"liberation of Donbass\" is gaining critical momentum. This assessment highlights a significant strategic advance in the ongoing conflict.",
            "key_points": [
                "Military expert claims Seversk secured.",
                "Suggests 'liberation of Donbass' gains momentum.",
                "Highlights a strategic advance in the conflict."
            ]
        },
        {
            "headline": "Putin Holds High-Stakes Talks on SMO Zone: Kremlin",
            "summary": "The Kremlin announced that President Putin is holding high-stakes talks regarding the \"Special Military Operation\" zone. These discussions likely involve strategic planning and operational decisions for the ongoing conflict.",
            "key_points": [
                "Putin holds high-stakes talks on 'SMO' zone.",
                "Announcement from the Kremlin.",
                "Discussions likely involve strategic planning and operational decisions."
            ]
        },
        {
            "headline": "Seversk Liberated: Key City in Securing Full Control of Donbass Border",
            "summary": "Seversk has reportedly been liberated, marking it as a key city in securing full control of the Donbass border. This development signifies a major strategic gain in the ongoing military operations.",
            "key_points": [
                "Seversk reportedly liberated.",
                "Considered key for securing Donbass border control.",
                "Significant strategic gain in military operations."
            ]
        },
        {
            "headline": "Russia Insists on Package of Agreements on Sustainable Peace in Ukraine: FM Lavrov",
            "summary": "Russian Foreign Minister Lavrov stated that Russia insists on a comprehensive package of agreements for sustainable peace in Ukraine. This emphasizes a long-term resolution approach rather than a temporary ceasefire.",
            "key_points": [
                "FM Lavrov insists on package of agreements for Ukraine peace.",
                "Emphasizes sustainable peace, not just a ceasefire.",
                "Highlights Russia's long-term resolution approach."
            ]
        },
        {
            "headline": "Russian Air Defense Systems Destroy 287 Ukrainian Drones Overnight: MoD",
            "summary": "Russia's Ministry of Defense claims its air defense systems destroyed a large number, 287, of Ukrainian drones overnight. This indicates continued intense aerial warfare and significant defensive operations.",
            "key_points": [
                "Russian MoD claims 287 Ukrainian drones destroyed overnight.",
                "Indicates intense aerial warfare.",
                "Highlights significant defensive operations."
            ]
        },
        {
            "headline": "Trump Seeks Real Settlement with Russia in Ukraine, NATO & EU Ignore Crisis’s Root Causes: Lavrov",
            "summary": "Russian Foreign Minister Lavrov suggested that Donald Trump seeks a genuine settlement with Russia in Ukraine, while NATO and the EU ignore the conflict's root causes. This frames Trump as a potential mediator and criticizes Western approaches.",
            "key_points": [
                "Lavrov states Trump seeks real settlement in Ukraine.",
                "Accuses NATO and EU of ignoring conflict's root causes.",
                "Frames Trump as potential mediator."
            ]
        },
        {
            "headline": "Russian Air Defense Systems Destroy 20 Ukrainian Drones Overnight: MoD",
            "summary": "The Russian Ministry of Defense reported the destruction of 20 Ukrainian drones overnight by its air defense systems. This adds to the continuous reports of aerial interceptions in the conflict zone.",
            "key_points": [
                "Russian MoD reports 20 Ukrainian drones destroyed overnight.",
                "Adds to continuous reports of aerial interceptions.",
                "Indicates ongoing air defense activities."
            ]
        },
        {
            "headline": "Hopes for Peace in Ukraine Becoming More Illusory Due to Europe’s Stance: Russian Envoy to UN",
            "summary": "Russia's envoy to the UN stated that hopes for peace in Ukraine are becoming more illusory due to Europe's current stance. This suggests that European policies are perceived as hindering a peaceful resolution.",
            "key_points": [
                "Russian Envoy to UN states peace hopes in Ukraine are illusory.",
                "Blames Europe's stance for hindering peace.",
                "Suggests European policies are an obstacle to resolution."
            ]
        }
    ],
    "Business": [
        {
            "headline": "Dense fog: IndiGo issues travel advisory; warns of potential flight delays",
            "summary": "IndiGo has issued a travel advisory due to dense fog, warning passengers of potential flight delays and disruptions. Travelers are advised to check their flight status before heading to the airport.",
            "key_points": [
                "IndiGo issues travel advisory due to dense fog.",
                "Potential flight delays are expected.",
                "Passengers should check flight status before travel."
            ]
        },
        {
            "headline": "How a widow's win opens doors for wronged investors",
            "summary": "A recent legal victory by a widow is setting a precedent, potentially opening new avenues for other wronged investors to seek justice. This case could empower individuals who have suffered financial losses due to malpractices.",
            "key_points": [
                "A widow's legal win creates a precedent for wronged investors.",
                "The victory may help other individuals seek justice for financial losses.",
                "This case highlights new possibilities for investor protection."
            ]
        },
        {
            "headline": "Ruchir Sharma column: Why my four 'Os' say AI is a bubble",
            "summary": "In his column, Ruchir Sharma argues that Artificial Intelligence is currently experiencing a market bubble, supported by his \"four Os\" framework. He suggests that the rapid growth and investment in AI may not be sustainable.",
            "key_points": [
                "Ruchir Sharma believes AI is a market bubble.",
                "His analysis uses a 'four Os' framework.",
                "The column raises concerns about AI investment sustainability."
            ]
        },
        {
            "headline": "Uber stock falls after analyst warnings: Europe adds pressure; investors react",
            "summary": "Uber's stock has declined following warnings from analysts and increased pressure from regulatory developments in Europe. Investors are reacting to concerns about the company's financial outlook and operating environment.",
            "key_points": [
                "Uber stock drops after analyst warnings.",
                "European regulations add pressure.",
                "Investors react to financial and operational concerns."
            ]
        },
        {
            "headline": "David Ellison makes hostile bid for WBD: $30 per share; challenges Netflix",
            "summary": "David Ellison has launched a hostile takeover bid for Warner Bros. Discovery (WBD) at $30 per share, aiming to challenge Netflix in the streaming market. This aggressive move signals a significant shake-up in the entertainment industry.",
            "key_points": [
                "David Ellison makes hostile bid for WBD at $30 per share.",
                "The bid aims to compete with Netflix.",
                "The move could significantly impact the entertainment industry."
            ]
        },
        {
            "headline": "Banking system laxity a cause for cyber conning: SC",
            "summary": "The Supreme Court has identified laxity within the banking system as a contributing factor to the rise in cyber fraud. This observation highlights the need for banks to enhance security measures to protect customers.",
            "key_points": [
                "SC attributes cyber conning to banking system laxity.",
                "Highlights the need for improved bank security.",
                "Aims to protect customers from cyber fraud."
            ]
        },
        {
            "headline": "IndiGo beats Air India duo to be country’s top international carrier",
            "summary": "IndiGo has surpassed the Air India duo to become India's leading international airline. This achievement marks a significant shift in the competitive aviation market.",
            "key_points": [
                "IndiGo becomes India's top international carrier.",
                "It surpasses Air India and its subsidiaries.",
                "Marks a significant shift in the aviation market."
            ]
        },
        {
            "headline": "Kraft Heinz split: Steve Cahillane named CEO for one division",
            "summary": "In the wake of Kraft Heinz's split, Steve Cahillane has been appointed CEO for one of the new divisions, with his role effective January 1, 2026. This leadership change is part of the company's restructuring.",
            "key_points": [
                "Steve Cahillane named CEO of a new Kraft Heinz division.",
                "Appointment is effective January 1, 2026.",
                "Part of the company's restructuring following its split."
            ]
        },
        {
            "headline": "NPS rules changed! Non-government subscribers can withdraw 80% of corpus from National Pension Scheme",
            "summary": "New rules for the National Pension Scheme (NPS) allow non-government subscribers to withdraw up to 80% of their corpus. This significant change provides greater liquidity and flexibility for pension holders.",
            "key_points": [
                "New NPS rules allow 80% corpus withdrawal for non-government subscribers.",
                "Provides greater liquidity and flexibility.",
                "Significant change for pension scheme holders."
            ]
        },
        {
            "headline": "IndiGo chaos aftermath: Aviation turbine fuel sales plunge over 4 per cent in early December",
            "summary": "Following the operational chaos experienced by IndiGo, aviation turbine fuel sales have seen a plunge of over 4 percent in early December. This suggests a direct impact of flight disruptions on fuel consumption in the airline sector.",
            "key_points": [
                "Aviation turbine fuel sales plunge after IndiGo chaos.",
                "Sales down over 4 percent in early December.",
                "Indicates impact of flight disruptions on fuel consumption."
            ]
        },
        {
            "headline": "Saregama to acquire 28% in Bhansali Productions",
            "summary": "Saregama, a major music label, is set to acquire a 28% stake in Bhansali Productions, a prominent film production house. This strategic investment signals expansion into the entertainment content creation sector.",
            "key_points": [
                "Saregama to acquire 28% stake in Bhansali Productions.",
                "Strategic investment by the music label.",
                "Signals expansion into entertainment content creation."
            ]
        },
        {
            "headline": "HDFC gets RBI nod to hike stake in IndusInd Bank to 9.5%",
            "summary": "HDFC has received approval from the RBI to increase its stake in IndusInd Bank to 9.5%. This move strengthens HDFC's position in the banking sector and reflects regulatory confidence.",
            "key_points": [
                "HDFC gets RBI approval to increase IndusInd Bank stake.",
                "Stake to be hiked to 9.5%.",
                "Strengthens HDFC's position in the banking sector."
            ]
        },
        {
            "headline": "US jobs stumble in November: Unemployment rate climbs to 4.6%; highest since 2021",
            "summary": "The US job market experienced a stumble in November, with the unemployment rate rising to 4.6%, its highest since 2021. This indicates a potential slowdown in economic recovery and job growth.",
            "key_points": [
                "US unemployment rate rises to 4.6% in November.",
                "Highest rate since 2021.",
                "Indicates a potential slowdown in job growth."
            ]
        },
        {
            "headline": "Elon Musk becomes first person to cross $600 bn net worth; SpaceX's $800 bn valuation helped",
            "summary": "Elon Musk has become the first individual to achieve a net worth exceeding $600 billion, largely propelled by SpaceX's $800 billion valuation. This milestone solidifies his position as the world's richest person.",
            "key_points": [
                "Elon Musk's net worth crosses $600 billion.",
                "First person to achieve this milestone.",
                "SpaceX's $800 billion valuation contributed significantly."
            ]
        },
        {
            "headline": "Russia Eyes More Indian Goods Despite Sanctions: Indian Export Organisation CEO",
            "summary": "Despite international sanctions, Russia is actively looking to import more goods from India, according to an Indian Export Organisation CEO. This indicates Russia's efforts to diversify its trade partners and India's potential to fill market gaps.",
            "key_points": [
                "Russia seeks more Indian goods despite sanctions.",
                "Indian Export Organisation CEO confirms interest.",
                "Highlights Russia's trade diversification efforts."
            ]
        },
        {
            "headline": "Russia, Pakistan Plan New Steel Mill Construction: Finance Minister Aurangzeb",
            "summary": "Russian and Pakistani officials are planning the construction of a new steel mill, as announced by Pakistan's Finance Minister Aurangzeb. This joint venture signifies growing economic cooperation between the two countries.",
            "key_points": [
                "Russia and Pakistan plan new steel mill construction.",
                "Announced by Pakistan's Finance Minister.",
                "Signifies growing economic cooperation."
            ]
        },
        {
            "headline": "India’s Exports Hit a Decade High, Marking a Major Trade Milestone: Commerce Ministry",
            "summary": "India's Commerce Ministry announced that the nation's exports have reached a decade-high, signifying a major trade milestone. This achievement reflects robust economic growth and increasing global market presence for Indian goods.",
            "key_points": [
                "India's exports hit a decade-high.",
                "Commerce Ministry reports major trade milestone.",
                "Reflects robust economic growth and global market presence."
            ]
        }
    ],
    "Technology": [
        {
            "headline": "Scale AI after Meta deal: Workers report strain; rivals rise in fast-changing market",
            "summary": "Following its deal with Meta, Scale AI is facing reports of worker strain while competitors are gaining traction in the rapidly evolving AI market. The company navigates challenges of growth and competition in a dynamic industry.",
            "key_points": [
                "Scale AI workers report strain after Meta deal.",
                "Competitors are emerging in the AI market.",
                "The company faces challenges amidst rapid industry change."
            ]
        },
        {
            "headline": "GCCs reshape India’s tech jobs: Hiring grows four times faster than IT services; AI-led roles drive surge",
            "summary": "Global Capability Centers (GCCs) are significantly reshaping India's tech job market, with hiring growing four times faster than in IT services. A surge in AI-led roles is primarily driving this transformation.",
            "key_points": [
                "GCCs are transforming India's tech job market.",
                "Hiring in GCCs grows 4x faster than IT services.",
                "AI-led roles are a primary driver of this surge."
            ]
        },
        {
            "headline": "Sennheiser ACCENTUM Open in Sakura Pink Launched",
            "summary": "Sennheiser has launched its new ACCENTUM Open headphones in a Sakura Pink color variant. This release offers consumers a fresh aesthetic option for their audio devices.",
            "key_points": [
                "Sennheiser launches ACCENTUM Open headphones.",
                "New color variant is Sakura Pink.",
                "Offers a fresh aesthetic option for consumers."
            ]
        }
    ],
    "Entertainment": [
        {
            "headline": "Oscars 2026: Ishaan Khatter's 'Homebound' gets shortlisted for Best International Feature Film",
            "summary": "The film 'Homebound', starring Ishaan Khatter, has been officially shortlisted for the 'Best International Feature Film' category at the upcoming Oscars 2026. This marks a significant achievement for the film and its creators on the global stage, bringing it closer to a prestigious nomination.",
            "key_points": [
                "Ishaan Khatter's 'Homebound' shortlisted for Best International Feature Film Oscar.",
                "This is a significant recognition for the film.",
                "The movie is now a contender for the prestigious award."
            ]
        },
        {
            "headline": "Virat Kohli and Anushka Sharma leave fans DISAPPOINTED after 'rude behaviour' with physically challenged boy",
            "summary": "Virat Kohli and Anushka Sharma have drawn criticism from fans who accused them of \"rude behaviour\" towards a physically challenged boy. This incident has led to public disappointment, prompting questions about their conduct.",
            "key_points": [
                "Virat Kohli and Anushka Sharma criticized for 'rude behaviour'.",
                "The incident involved a physically challenged boy.",
                "Fans expressed disappointment and questioned their actions."
            ]
        },
        {
            "headline": "'Dhurandhar' records biggest 2nd week; set to gross Rs 500 crore",
            "summary": "The film 'Dhurandhar' has achieved its biggest second-week collection, with projections indicating it will gross Rs 500 crore. This commercial success marks a significant milestone for the movie.",
            "key_points": [
                "'Dhurandhar' achieved its highest 2nd-week collection.",
                "The film is projected to gross Rs 500 crore.",
                "This marks a major commercial success."
            ]
        },
        {
            "headline": "‘Disclosure Day’ trailer: Steven Spielberg returns to sci-fi with Emily Blunt-led film",
            "summary": "The trailer for 'Disclosure Day' reveals Steven Spielberg's return to the sci-fi and UFO genre, featuring Emily Blunt in a leading role. The film promises a thrilling new addition to the director's renowned body of work.",
            "key_points": [
                "Steven Spielberg is back in the sci-fi/UFO genre.",
                "Emily Blunt stars in his new film, 'Disclosure Day'.",
                "The trailer has been released, teasing a new thriller."
            ]
        },
        {
            "headline": "Lisa Kennedy announces engagement: Who is Fred, the Fox host’s fiancé?",
            "summary": "Fox host Lisa Kennedy has announced her engagement, sparking interest in her fiancé, Fred. Details about Fred's identity and background are emerging following the announcement.",
            "key_points": [
                "Fox host Lisa Kennedy announces engagement.",
                "Her fiancé is identified as Fred.",
                "Details about Fred are being sought by the public."
            ]
        },
        {
            "headline": "Sunjay Kapur's Rs 30,000 crore estate row: Priya Kapur resists Will verification",
            "summary": "A massive estate dispute involving Sunjay Kapur's Rs 30,000 crore fortune sees Priya Kapur resisting the verification of his will, after Karisma Kapoor's children requested access. The family is embroiled in a significant legal battle over inheritance.",
            "key_points": [
                "Sunjay Kapur's Rs 30,000 crore estate is in dispute.",
                "Priya Kapur resists verification of the will.",
                "Karisma Kapoor's children are seeking access to it."
            ]
        },
        {
            "headline": "Megan Thee Stallion becomes Klay Thompson’s fashion guide in romantic moment",
            "summary": "Megan Thee Stallion was seen acting as Klay Thompson’s fashion guide in a surprising and romantic moment. This public display of affection and collaboration has captured media attention.",
            "key_points": [
                "Megan Thee Stallion guides Klay Thompson's fashion.",
                "The moment was unexpected and romantic.",
                "The celebrity interaction drew media attention."
            ]
        }
    ],
    "Sports": [
        {
            "headline": "IPL auction 2026: KKR break bank for Green; CSK bet big on uncapped Indians",
            "summary": "In the IPL 2026 auction, Kolkata Knight Riders (KKR) made a significant investment to acquire Cameron Green. Chennai Super Kings (CSK) focused on signing promising uncapped Indian players.",
            "key_points": [
                "KKR secured Cameron Green with a major bid.",
                "CSK invested heavily in uncapped Indian players.",
                "The IPL 2026 auction saw strategic team acquisitions."
            ]
        },
        {
            "headline": "IPL auction: How all 10 teams stack up after bidding; full list of players",
            "summary": "Following the IPL auction, an analysis shows how all ten teams have structured their squads with the new player acquisitions. A comprehensive list of all players and their respective teams is now available.",
            "key_points": [
                "Analysis of team compositions post IPL auction.",
                "All ten teams' player lineups are detailed.",
                "Full list of acquired players is provided."
            ]
        },
        {
            "headline": "IPL auction 2026: Most expensive player for each team across all 10 franchises - find out",
            "summary": "Details have emerged revealing the most expensive player acquired by each of the ten IPL franchises in the 2026 auction. This highlights the strategic spending and key picks made by teams to bolster their squads.",
            "key_points": [
                "Information on the most expensive player for each IPL team released.",
                "The 2026 auction saw significant investments by franchises.",
                "Strategic player acquisitions are highlighted."
            ]
        },
        {
            "headline": "Tyler Seguin injury update: Dallas Star’s center undergoes an ACL surgery",
            "summary": "Dallas Stars' center Tyler Seguin has undergone successful ACL surgery, addressing a significant knee injury. This procedure marks a crucial step in his recovery process and return to the ice.",
            "key_points": [
                "Tyler Seguin of Dallas Stars had ACL surgery.",
                "The surgery addresses a major knee injury.",
                "It's a key step in his recovery and return to play."
            ]
        },
        {
            "headline": "MLB trade rumor: Arizona Diamondbacks show interest in Alex Bregman to fill void left by Eugenio Suárez trade",
            "summary": "The Arizona Diamondbacks are reportedly showing interest in Alex Bregman to fill the void created by the trade of Eugenio Suárez. This potential move aims to strengthen the team's lineup for the upcoming season.",
            "key_points": [
                "Arizona Diamondbacks eye Alex Bregman.",
                "Move aims to replace Eugenio Suárez.",
                "Team seeks to strengthen its roster."
            ]
        },
        {
            "headline": "“You can’t be as frustrated as me” — Golden State Warriors owner Joe Lacob hilariously replies to fed-up fan after Stephen Curry’s 48-point night",
            "summary": "Golden State Warriors owner Joe Lacob humorously responded to a frustrated fan after Stephen Curry's impressive 48-point performance. His witty reply captured the complex emotions surrounding the team's season despite individual brilliance.",
            "key_points": [
                "Joe Lacob responds to a fan's frustration.",
                "This happened after Stephen Curry scored 48 points.",
                "The interaction highlights team dynamics and fan sentiment."
            ]
        },
        {
            "headline": "Stunning prediction! 'Shreyas Iyer can captain India to a World Cup win'",
            "summary": "A bold prediction suggests that Shreyas Iyer has the potential to captain India to a World Cup victory. This forecast sparks debate and excitement among cricket enthusiasts about future leadership.",
            "key_points": [
                "Prediction made that Shreyas Iyer can lead India to World Cup win.",
                "Forecast sparks debate among cricket fans.",
                "Highlights potential future leadership in Indian cricket."
            ]
        },
        {
            "headline": "Asia Cup 2025: Indian-origin Jatinder Singh to led Oman",
            "summary": "Indian-origin cricketer Jatinder Singh is set to captain Oman in the upcoming Asia Cup 2025. This appointment marks a significant moment for the player and his team on the international stage.",
            "key_points": [
                "Indian-origin Jatinder Singh to captain Oman in Asia Cup 2025.",
                "Significant appointment for the player.",
                "Oman prepares for the international tournament."
            ]
        },
        {
            "headline": "Diamond League Final: Neeraj Chopra's event preview, time and live telecast in India",
            "summary": "A preview for Neeraj Chopra's event at the Diamond League Final provides details on the competition, including timings and live telecast information for Indian viewers. Fans are eager to watch the javelin star compete.",
            "key_points": [
                "Preview for Neeraj Chopra's Diamond League Final event.",
                "Includes event details, timings, and Indian telecast info.",
                "Fans anticipate watching the javelin thrower."
            ]
        },
        {
            "headline": "FIDE WC in India: PM Modi says 'Chess is gaining popularity among our youth'",
            "summary": "During the FIDE World Championship in India, Prime Minister Modi remarked that chess is increasingly popular among Indian youth. His statement highlights the growing interest in the sport nationally.",
            "key_points": [
                "PM Modi comments on chess popularity in India.",
                "Statement made during FIDE World Championship.",
                "Highlights growing youth interest in the sport."
            ]
        },
        {
            "headline": "Hanuma Vihari joins Tripura after leaving Andhra Pradesh",
            "summary": "Cricketer Hanuma Vihari has officially joined the Tripura cricket team after his departure from Andhra Pradesh. This move marks a new chapter in his domestic career.",
            "key_points": [
                "Hanuma Vihari joins Tripura cricket team.",
                "He previously played for Andhra Pradesh.",
                "The move marks a new phase in his domestic career."
            ]
        },
        {
            "headline": "Guyana President: 'GSL not in competition with other T20 leagues but a partnership'",
            "summary": "The President of Guyana stated that the Guyana Super League (GSL) aims for partnership, not competition, with other T20 leagues. This emphasizes a collaborative approach to the global cricket landscape.",
            "key_points": [
                "Guyana President clarifies GSL's stance on T20 leagues.",
                "GSL seeks partnership, not competition.",
                "Emphasizes a collaborative approach in global cricket."
            ]
        },
        {
            "headline": "Sarfaraz on fire! Back-to-back tons send strong message to selectors",
            "summary": "Sarfaraz Khan has delivered back-to-back centuries, sending a powerful message to national selectors with his exceptional form. His consistent performance puts him in contention for higher honors.",
            "key_points": [
                "Sarfaraz Khan scores consecutive centuries.",
                "His form sends a strong message to selectors.",
                "He is in contention for higher cricket honors."
            ]
        },
        {
            "headline": "KCL thriller: Samson smashes century, but Muhammad steals show",
            "summary": "In a thrilling KCL match, Sanju Samson scored a century, but it was Muhammad who ultimately stole the show with a remarkable performance. The game delivered high drama and standout individual displays.",
            "key_points": [
                "Sanju Samson scored a century in KCL.",
                "Muhammad delivered a show-stealing performance.",
                "The match was a thrilling cricket encounter."
            ]
        }
    ],
    "Science": [
        {
            "headline": "Albert Einstein’s brain was stolen by a doctor and carried around for 40 years",
            "summary": "A historical account reveals that Albert Einstein's brain was controversially removed and kept by a doctor for forty years after his death. This extraordinary act allowed for decades of study, albeit under unusual circumstances.",
            "key_points": [
                "Albert Einstein's brain was stolen after his death.",
                "A doctor held onto the brain for 40 years.",
                "The brain was subject to decades of study."
            ]
        },
        {
            "headline": "How this waterfall in Hawaii creates rainbows that keep tourists coming back",
            "summary": "A unique waterfall in Hawaii is renowned for consistently producing stunning rainbows, captivating tourists and drawing them back repeatedly. The article explores the specific scientific conditions that contribute to this beautiful natural phenomenon.",
            "key_points": [
                "A Hawaiian waterfall is famous for its consistent rainbows.",
                "The phenomenon attracts tourists repeatedly.",
                "The article explains the scientific reasons behind the rainbows."
            ]
        },
        {
            "headline": "Why crows sometimes leave ‘gifts’ for humans who feed them",
            "summary": "Research explains why crows occasionally leave \"gifts\" like pebbles or small items for humans who feed them, suggesting a complex social behavior. This fascinating interaction highlights the intelligence and unique habits of these birds.",
            "key_points": [
                "Crows are known to leave 'gifts' for humans.",
                "This behavior is a form of complex social interaction.",
                "Research sheds light on the intelligence of crows."
            ]
        }
    ],
    "Health": [
        {
            "headline": "‘Your hair can come back’: Doctor shares science-backed plan to restore thinning hair",
            "summary": "A doctor has shared a science-backed plan offering hope for individuals experiencing thinning hair, claiming it can be restored. The plan likely involves specific treatments or lifestyle changes supported by scientific research.",
            "key_points": [
                "Doctor presents a science-backed plan for thinning hair.",
                "The plan offers potential for hair restoration.",
                "It likely includes specific treatments or lifestyle advice."
            ]
        },
        {
            "headline": "New review of medical cannabis use finds little evidence of its benefits",
            "summary": "A new comprehensive review on medical cannabis use has concluded that there is little evidence to support its purported benefits. This finding challenges widespread beliefs and calls for further research.",
            "key_points": [
                "New review questions benefits of medical cannabis.",
                "Finds little evidence to support claims.",
                "Challenges beliefs and calls for further research."
            ]
        }
    ]
}