{
    "World": [
        {
            "headline": "'Very productive meeting': Trump backs off on Greenland tariff threat; claims deal 'framework' in place",
            "summary": "Donald Trump announced a \"framework\" deal with European allies regarding Greenland, easing tariff tensions. He described the meeting as \"very productive,\" signaling a potential resolution to a dispute that had caused friction with NATO ally Denmark.",
            "key_points": [
                "Trump claims a \"framework\" deal is in place regarding Greenland tariffs.",
                "The meeting with European allies was described as \"very productive.\"",
                "This move de-escalates a tariff threat that had strained relations with Denmark."
            ]
        },
        {
            "headline": "Ukraine Peace Deal 90% Done: Witkoff",
            "summary": "According to US Envoy Scott Witkoff, a peace deal for Ukraine is \"90% done,\" signaling significant progress towards resolving the prolonged conflict. This optimistic assessment offers hope for a diplomatic resolution, though details and final hurdles remain.",
            "key_points": [
                "US Envoy Scott Witkoff stated Ukraine peace deal is \"90% done.\"",
                "Signals significant progress towards conflict resolution.",
                "Offers hope for a diplomatic end to the prolonged conflict."
            ]
        },
        {
            "headline": "ED to quiz I-PAC chief, keen to proceed against Mamata",
            "summary": "India's Enforcement Directorate (ED) is set to question the chief of I-PAC, a political consultancy, as part of an investigation. The agency is reportedly eager to move forward with proceedings involving West Bengal Chief Minister Mamata Banerjee, indicating a high-profile political probe.",
            "key_points": [
                "Enforcement Directorate (ED) to question I-PAC chief.",
                "ED is keen to proceed against West Bengal CM Mamata Banerjee.",
                "The investigation involves a political consultancy.",
                "This signals a significant political probe in India."
            ]
        },
        {
            "headline": "Unlike West, India Gives UAE a True Partnership Free of Conditions: Expert",
            "summary": "An expert stated that India offers the UAE a genuine partnership \"free of conditions,\" contrasting it with the West's approach. This highlights India's growing diplomatic influence and its strategy of fostering equitable alliances without imposing external mandates.",
            "key_points": [
                "Expert claims India offers UAE a true, unconditional partnership.",
                "Contrasts India's approach with that of Western nations.",
                "Highlights India's growing diplomatic influence."
            ]
        },
        {
            "headline": "Russia’s Trade With India and Other Friendly Nations Hits Record 86%: PM Mishustin",
            "summary": "Russian Prime Minister Mikhail Mishustin announced that Russia's trade with India and other \"friendly nations\" has reached a record high of 86%. This surge underscores Moscow's pivot towards non-Western partners amidst geopolitical shifts and sanctions.",
            "key_points": [
                "Russian PM Mishustin announced record trade with India and \"friendly nations.\"",
                "Trade volume with these countries reached 86%.",
                "Highlights Russia's pivot away from Western partners."
            ]
        },
        {
            "headline": "India Counters German Concerns Over Its Russian Defense Partnerships",
            "summary": "India has responded to concerns raised by Germany regarding its ongoing defense partnerships with Russia, reaffirming its sovereign right to choose its allies. This underscores India's independent foreign policy stance and its determination to maintain strategic autonomy despite external pressures.",
            "key_points": [
                "India addressed German concerns about its Russian defense ties.",
                "Reaffirmed its sovereign right to choose allies.",
                "Highlights India's independent foreign policy and strategic autonomy."
            ]
        },
        {
            "headline": "Protests outside UK Parliament urge Labour to act on Hindu persecution in Bangladesh",
            "summary": "Protesters gathered outside the UK Parliament, calling on the Labour Party to address the alleged persecution of Hindus in Bangladesh. The demonstrations highlight international concern over human rights issues and seek intervention from British policymakers.",
            "key_points": [
                "Protests held outside UK Parliament regarding Hindu persecution in Bangladesh.",
                "Activists urged the Labour Party to take action.",
                "The demonstrations highlight international human rights concerns."
            ]
        },
        {
            "headline": "Donald Trump flags China, Russia threat in Greenland — how real is the danger?",
            "summary": "Donald Trump has raised concerns about potential threats from China and Russia in Greenland, questioning the extent of the danger. This highlights renewed geopolitical interest in the Arctic region and its strategic importance for global powers.",
            "key_points": [
                "Donald Trump highlighted perceived threats from China and Russia in Greenland.",
                "The article questions the reality and severity of these dangers.",
                "It underscores Greenland's strategic importance in global geopolitics."
            ]
        },
        {
            "headline": "World must show zero tolerance for terror, EAM tells Spain counterpart",
            "summary": "India's External Affairs Minister emphasized the need for global zero tolerance towards terrorism during a meeting with their Spanish counterpart. This statement reiterates India's consistent stance on combating terrorism and calls for concerted international action.",
            "key_points": [
                "India's EAM called for global zero tolerance on terror.",
                "The statement was made during a meeting with Spain's counterpart.",
                "It reflects India's consistent anti-terrorism stance."
            ]
        },
        {
            "headline": "Origins of SMO: The History of Ukrainian Conflict",
            "summary": "This article delves into the historical origins of the Special Military Operation (SMO) in Ukraine, providing context on the complex factors and events that led to the current conflict. It aims to offer a comprehensive understanding of the geopolitical landscape and historical grievances contributing to the crisis.",
            "key_points": [
                "Explores the historical origins of the Ukrainian conflict (SMO).",
                "Provides context on factors leading to the current crisis.",
                "Aims for a comprehensive understanding of the geopolitical landscape."
            ]
        },
        {
            "headline": "Macron’s Proposal to Invite Russia to G7 Meeting Is Really About Trump: Expert",
            "summary": "An expert suggests that French President Macron's proposal to invite Russia to a G7 meeting is primarily a strategic move related to Donald Trump. This indicates complex underlying political motivations behind international diplomatic gestures and potential shifts in global alliances.",
            "key_points": [
                "Expert believes Macron's Russia-G7 invitation is about Trump.",
                "Suggests underlying political motivations for diplomatic gestures.",
                "Highlights potential shifts in global alliances."
            ]
        },
        {
            "headline": "Russian Air Defense Destroys 75 Ukrainian Drones: MoD",
            "summary": "The Russian Ministry of Defense announced that its air defense systems successfully destroyed 75 Ukrainian drones overnight. This report indicates ongoing aerial engagements in the conflict and the effectiveness of Russian defensive capabilities against drone attacks.",
            "key_points": [
                "Russian MoD reported destroying 75 Ukrainian drones overnight.",
                "Highlights ongoing aerial engagements in the conflict.",
                "Indicates effectiveness of Russian air defense systems."
            ]
        },
        {
            "headline": "CEC cites success of SIR in Bihar at global meet",
            "summary": "India's Chief Election Commissioner (CEC) presented the successful implementation of the Special Summary Revision (SIR) in Bihar at an international conference. This showcases India's electoral practices and successes on a global platform, potentially offering lessons to other nations.",
            "key_points": [
                "India's CEC highlighted Bihar's SIR success at a global meet.",
                "This demonstrates India's electoral achievements internationally.",
                "It could serve as a model for other countries."
            ]
        },
        {
            "headline": "J&K: Op Trashi-I enters Day 4; hunt for ultras intensified",
            "summary": "Operation Trashi-I in Jammu & Kashmir has entered its fourth day, with security forces intensifying their search for militants. The ongoing operation underscores the persistent security challenges in the region and the continuous efforts to maintain peace and stability.",
            "key_points": [
                "Operation Trashi-I continues for its fourth day in J&K.",
                "Security forces have intensified their search for militants.",
                "The operation highlights ongoing security challenges in the region."
            ]
        },
        {
            "headline": "Trump Allies Cut Greenland Cake With US Flag To Mark His 1st Year In Office, SHOCK NATO Ally Denmark",
            "summary": "Allies of Donald Trump marked his first year back in office by cutting a Greenland-themed cake adorned with the US flag, a gesture that reportedly shocked NATO ally Denmark. This act highlights the controversial nature of Trump's previous interest in acquiring Greenland and its impact on international relations.",
            "key_points": [
                "Trump's allies celebrated his first year with a Greenland-themed cake.",
                "The gesture reportedly surprised and concerned Denmark.",
                "It references Trump's controversial past interest in Greenland."
            ]
        },
        {
            "headline": "EU-Mercosur Deal Dominates Green Week As German Farmers Fear South American Competition",
            "summary": "Discussions around the EU-Mercosur trade deal were prominent during Green Week, with German farmers expressing significant concerns about increased competition from South American agricultural products. The agreement faces scrutiny over its potential impact on European farming sectors and environmental standards.",
            "key_points": [
                "EU-Mercosur trade deal was a major topic at Green Week.",
                "German farmers are worried about competition from South America.",
                "The deal's impact on European agriculture and environmental standards is under debate."
            ]
        },
        {
            "headline": "Greenland, Ukraine, Iran: US, EU & Allies Caught Between Cooperation & Conflict At WEF In Davos",
            "summary": "At the World Economic Forum in Davos, major global powers including the US and EU found themselves navigating a complex web of cooperation and conflict across multiple geopolitical hotspots such as Greenland, Ukraine, and Iran. The discussions revealed the intricate challenges in maintaining alliances while addressing diverse national interests and security concerns.",
            "key_points": [
                "WEF Davos saw US, EU, and allies grapple with cooperation and conflict.",
                "Key geopolitical issues included Greenland, Ukraine, and Iran.",
                "Highlights the complex nature of international diplomacy and alliances."
            ]
        },
        {
            "headline": "'Bibi, Stop Taking Credit': Trump Humiliates Israeli PM At Davos; Calls Out Israeli Iron Dome 'Lie'",
            "summary": "Donald Trump publicly criticized and \"humiliated\" Israeli Prime Minister Benjamin Netanyahu at the Davos forum, accusing him of taking undue credit and even calling a statement about Israel's Iron Dome a \"lie.\" This confrontational exchange underscores the volatile nature of Trump's diplomatic style and potential strains in US-Israel relations.",
            "key_points": [
                "Donald Trump publicly criticized Israeli PM Netanyahu at Davos.",
                "Trump accused Netanyahu of taking undue credit and making false claims.",
                "The incident highlights Trump's confrontational diplomatic approach."
            ]
        },
        {
            "headline": "Canada PM's fiery speech: Has WEF lit the fire of revolt against Trump?",
            "summary": "The Canadian Prime Minister delivered a fiery speech at the World Economic Forum, sparking speculation about whether the event is fostering a collective pushback against Donald Trump's policies and influence. This suggests a growing divide among global leaders on key international issues.",
            "key_points": [
                "Canadian PM gave a strong speech at WEF.",
                "Speculation arises about a \"revolt\" against Trump's influence.",
                "Highlights growing divisions among global leaders."
            ]
        },
        {
            "headline": "Why Davos matters again — when Trump is tearing up the rulebook",
            "summary": "The article explores the renewed significance of the World Economic Forum in Davos, particularly in an era where Donald Trump's actions are seen as challenging established international norms and \"tearing up the rulebook.\" It suggests that Davos serves as a crucial platform for discussing global governance amidst such disruptions.",
            "key_points": [
                "Davos gains renewed importance due to Trump challenging international norms.",
                "Trump's actions are seen as \"tearing up the rulebook\" of global relations.",
                "The forum is a key platform for discussing global governance in a disruptive era."
            ]
        },
        {
            "headline": "Texas AG candidate’s anti-Indian post backfires as community note flags Pakistani scammer among his top donors",
            "summary": "A Texas Attorney General candidate's anti-Indian social media post faced severe backlash and a community note revelation that a Pakistani scammer was among his top donors. This incident highlights issues of racial prejudice in US politics and the rapid accountability mechanisms of social media.",
            "key_points": [
                "Texas AG candidate made an anti-Indian post.",
                "A community note exposed a Pakistani scammer as a top donor.",
                "The incident sparked backlash and questions about political funding."
            ]
        },
        {
            "headline": "US appeals court blocks lower court order limiting immigration agents’ use of force in Minnesota",
            "summary": "A US appeals court has overturned a lower court's decision that aimed to restrict the use of force by immigration agents in Minnesota. This ruling has significant implications for immigration enforcement policies and the rights of individuals encountered by agents in the state.",
            "key_points": [
                "US appeals court reversed limits on immigration agents' force in Minnesota.",
                "The lower court order sought to restrict agent conduct.",
                "The ruling impacts immigration enforcement policies and individual rights."
            ]
        },
        {
            "headline": "'Let's bomb more countries!': Row over Nobel winner Machado saying Cuba and Nicaragua will be 'freed' like Venezuela",
            "summary": "A controversy erupted after Nobel winner María Corina Machado suggested that Cuba and Nicaragua should be \"freed\" in a manner similar to Venezuela, drawing criticism for its implied call for military intervention. The statement has sparked debate on international interventionism and the methods of achieving political change in Latin America.",
            "key_points": [
                "Nobel winner Machado's comments on freeing Cuba and Nicaragua sparked controversy.",
                "Her remarks implied military intervention similar to Venezuela.",
                "The incident fueled debate on international interventionism in Latin America."
            ]
        },
        {
            "headline": "‘I left Democratic Party because of their hostility towards God’: DNI Tulsi Gabbard blasts anti-ICE protest inside Minnesota church",
            "summary": "Tulsi Gabbard, citing the Democratic Party's \"hostility towards God,\" criticized an anti-ICE protest held inside a Minnesota church. Her statement highlights the intersection of faith, politics, and immigration debates in the US.",
            "key_points": [
                "Tulsi Gabbard criticized an anti-ICE protest in a Minnesota church.",
                "She cited the Democratic Party's \"hostility towards God\" for leaving.",
                "The incident links faith, politics, and immigration in the US."
            ]
        },
        {
            "headline": "'He was invited, he’s accepted’: Trump says Putin agreed to join ‘Board of Peace'",
            "summary": "Donald Trump announced that Russian President Vladimir Putin has accepted an invitation to join a proposed \"Board of Peace.\" This development suggests a potential new initiative for international dialogue and diplomacy, though details about the \"Board\" remain scarce.",
            "key_points": [
                "Trump claimed Putin agreed to join a \"Board of Peace.\"",
                "Putin was reportedly \"invited\" and \"accepted.\"",
                "The initiative hints at new international dialogue, details are awaited."
            ]
        },
        {
            "headline": "Aadhaar enters US SSN debate: Far-right political writer Curtis Yarvin sparks backlash with anti-India slur",
            "summary": "Far-right political writer Curtis Yarvin sparked controversy by bringing India's Aadhaar system into a US Social Security Number debate, accompanied by an anti-India slur. The incident highlights the misuse of international examples in domestic political arguments and the prevalence of xenophobia.",
            "key_points": [
                "Curtis Yarvin linked India's Aadhaar to the US SSN debate.",
                "He used an anti-India slur, causing backlash.",
                "The incident highlights xenophobia and misuse of international examples in US politics."
            ]
        },
        {
            "headline": "NRI doctor couple digital arrest case: Another 60 lakh frozen",
            "summary": "In the ongoing \"digital arrest\" fraud case involving an NRI doctor couple, an additional 60 lakh rupees have been frozen. This development underscores the severity and financial impact of sophisticated cyber scams targeting individuals, often with threats of legal action.",
            "key_points": [
                "An additional 60 lakh rupees frozen in NRI \"digital arrest\" case.",
                "The case involves a doctor couple targeted by fraud.",
                "Highlights the financial impact of sophisticated cyber scams."
            ]
        },
        {
            "headline": "'I have enough skill': Man who got laid off in Canada replies to 'go back to India' jibe on TikTok",
            "summary": "An Indian man who lost his job in Canada responded to a \"go back to India\" comment on TikTok, asserting his skills and challenging xenophobic remarks. His viral response highlights the struggles faced by immigrants and the growing online racism.",
            "key_points": [
                "Indian man laid off in Canada faced a xenophobic comment on TikTok.",
                "He responded assertively, highlighting his skills.",
                "The incident sheds light on immigrant struggles and online racism."
            ]
        },
        {
            "headline": "'There was blood everywhere': Indian-origin truck driver assaulted in Melbourne outside home, cops call it 'targeted attack'",
            "summary": "An Indian-origin truck driver was violently assaulted outside his home in Melbourne, with police describing it as a \"targeted attack.\" The incident has raised concerns within the Indian diaspora in Australia about safety and potential racially motivated violence.",
            "key_points": [
                "Indian-origin truck driver violently assaulted in Melbourne.",
                "Police termed it a \"targeted attack.\"",
                "Raises concerns for the Indian diaspora in Australia."
            ]
        },
        {
            "headline": "Who is Dr Nisha Verma? US senator asks Indian-origin doctor if men can get pregnant",
            "summary": "An Indian-origin doctor, Nisha Verma, gained attention after a US senator asked her during a hearing if men can get pregnant, sparking a debate on scientific literacy and gender-affirming care in political discourse. The exchange highlighted the challenges faced by medical professionals in explaining complex health issues in a polarized environment.",
            "key_points": [
                "Indian-origin Dr. Nisha Verma was asked by a US senator if men can get pregnant.",
                "The question sparked debate on scientific literacy and gender-affirming care.",
                "Highlights challenges for medical professionals in political discourse."
            ]
        },
        {
            "headline": "‘Did something to them’: Indian-origin woman charged with killing her 2 young sons in New Jersey",
            "summary": "An Indian-origin woman in New Jersey has been charged with the murder of her two young sons. The tragic incident has shocked the community and raised concerns, with investigations ongoing into the circumstances surrounding the deaths.",
            "key_points": [
                "Indian-origin woman charged with killing her two young sons in New Jersey.",
                "The tragic incident has deeply shocked the community.",
                "Investigations are currently underway to determine the circumstances."
            ]
        },
        {
            "headline": "Punjabi businessman shot dead in Canada: 3rd incident in 8 months; cops find burnt vehicle",
            "summary": "A Punjabi businessman was shot dead in Canada, marking the third such incident involving the community in eight months, with police later finding a burnt vehicle linked to the crime. This escalating violence raises serious concerns for the safety of the Punjabi diaspora and potential organized crime links.",
            "key_points": [
                "Punjabi businessman shot dead in Canada, third such incident in 8 months.",
                "Police discovered a burnt vehicle linked to the crime.",
                "The escalating violence raises concerns for the Punjabi diaspora and potential crime links."
            ]
        },
        {
            "headline": "Indian-origin Keshav Poddar to serve as Jersey City deputy mayor; takes oath on Bhagwat Gita",
            "summary": "Indian-origin Keshav Poddar has been appointed as the deputy mayor of Jersey City, taking his oath of office on the Bhagwat Gita. His appointment marks a significant milestone for the Indian diaspora in US politics and reflects growing diversity in leadership.",
            "key_points": [
                "Indian-origin Keshav Poddar appointed Jersey City deputy mayor.",
                "He took his oath of office on the Bhagwat Gita.",
                "A significant milestone for the Indian diaspora in US politics."
            ]
        },
        {
            "headline": "Shri Thanedar stands up to racist comment targeting Indian-origin 'Samosa Caucus'",
            "summary": "Indian-origin Congressman Shri Thanedar vocally condemned a racist comment directed at the \"Samosa Caucus,\" a term used for Indian-American politicians. His firm stance highlights the ongoing fight against racial discrimination in US politics and the importance of defending ethnic representation.",
            "key_points": [
                "Congressman Shri Thanedar condemned a racist comment against the \"Samosa Caucus.\"",
                "The term refers to Indian-American politicians.",
                "His stance highlights the fight against racial discrimination in US politics."
            ]
        }
    ],
    "Business": [
        {
            "headline": "India Rejects US Trade Deal Push at Davos: IT Minister",
            "summary": "India's IT Minister explicitly rejected the US push for a trade deal at the World Economic Forum in Davos, signaling India's cautious approach to bilateral agreements. This stance emphasizes India's priority for national interests and its selective engagement in international trade discussions.",
            "key_points": [
                "India's IT Minister rejected a US trade deal push at Davos.",
                "Signals India's cautious approach to bilateral agreements.",
                "Emphasizes India's priority for national interests."
            ]
        },
        {
            "headline": "Is the rupee’s fall becoming a household problem?",
            "summary": "The ongoing depreciation of the Indian rupee against the dollar is increasingly being felt at the household level, impacting daily expenses and financial stability. This raises concerns about inflation and the purchasing power of average Indian families.",
            "key_points": [
                "Indian rupee's fall is affecting household finances.",
                "It impacts daily expenses and financial stability.",
                "Raises concerns about inflation and purchasing power."
            ]
        },
        {
            "headline": "Russia Triples Meat Imports from India: Data",
            "summary": "Recent data indicates that Russia has tripled its meat imports from India, marking a significant increase in bilateral trade. This surge reflects Russia's strategic diversification of trade partners and India's growing capacity as an agricultural exporter.",
            "key_points": [
                "Russia tripled its meat imports from India.",
                "Marks a significant increase in bilateral trade.",
                "Reflects Russia's trade diversification and India's export growth."
            ]
        },
        {
            "headline": "L'Oreal to pump 3.5k cr in 1st AI-powered global tech hub",
            "summary": "L'Oreal announced a significant investment of 3,500 crore rupees into establishing its first AI-powered global technology hub. This move signals the company's commitment to leveraging artificial intelligence for innovation and underscores the growing integration of AI in various industries.",
            "key_points": [
                "L'Oreal is investing 3,500 crore in its first AI-powered global tech hub.",
                "This highlights the company's focus on AI innovation.",
                "It shows AI's increasing integration across industries."
            ]
        },
        {
            "headline": "Why Deepinder Goyal stepped down as CEO of Eternal and what's next",
            "summary": "Deepinder Goyal, the founder of Zomato, has stepped down from his role as CEO of Eternal, prompting questions about the reasons behind his departure and his future plans. This corporate development is significant for the Indian startup ecosystem and for Zomato's strategic direction.",
            "key_points": [
                "Deepinder Goyal (Zomato founder) resigned as Eternal CEO.",
                "The reasons for his departure and future plans are being speculated.",
                "This impacts the Indian startup ecosystem and Zomato's strategy."
            ]
        },
        {
            "headline": "Top stocks to buy or sell today: Stock recommendations for January 22, 2026 - check list",
            "summary": "Financial experts have released their recommendations for top stocks to buy or sell on January 22, 2026, providing guidance for investors. This daily advice is crucial for navigating market fluctuations and making informed investment decisions.",
            "key_points": [
                "Stock recommendations for buying/selling on January 22, 2026.",
                "Provides guidance for investors.",
                "Aids in navigating market fluctuations."
            ]
        },
        {
            "headline": "Russia Becomes Top Exporter of Aluminum to South Korea First Time Since 2012",
            "summary": "Russia has emerged as the top exporter of aluminum to South Korea, a position it hasn't held since 2012. This shift highlights changes in global supply chains and trade dynamics, potentially influenced by geopolitical factors and new market opportunities.",
            "key_points": [
                "Russia is now the top aluminum exporter to South Korea.",
                "First time since 2012.",
                "Indicates shifts in global supply chains and trade dynamics."
            ]
        },
        {
            "headline": "Gold trades near $4.9k/oz, silver at $95/oz",
            "summary": "Gold prices are hovering near $4,900 per ounce, while silver is trading at around $95 per ounce in the commodities market. These figures reflect current market dynamics and investor sentiment towards precious metals as safe-haven assets.",
            "key_points": [
                "Gold price is near $4,900/oz.",
                "Silver is trading around $95/oz.",
                "Reflects current market dynamics and investor sentiment."
            ]
        },
        {
            "headline": "How FM can simplify TCS to ease cash flow pressure",
            "summary": "The article discusses potential strategies for the Finance Minister to simplify Tax Collected at Source (TCS) regulations, aiming to alleviate cash flow pressures on businesses. Streamlining TCS could provide much-needed relief for companies and improve liquidity in the market.",
            "key_points": [
                "Explores ways for FM to simplify TCS.",
                "Aims to reduce cash flow pressure on businesses.",
                "Simplification could improve market liquidity."
            ]
        },
        {
            "headline": "Another day, another low for Re against $ amid turbulence",
            "summary": "The Indian Rupee continues its decline against the US Dollar, hitting another low amidst turbulent market conditions. This persistent depreciation signals ongoing economic pressures and creates challenges for importers and foreign investors.",
            "key_points": [
                "Indian Rupee reached another low against the US Dollar.",
                "Occurred amidst turbulent market conditions.",
                "Signals ongoing economic pressures and challenges for trade."
            ]
        },
        {
            "headline": "Atal Pension Yojana to continue up to 2030-31",
            "summary": "The Atal Pension Yojana (APY), a popular social security scheme, has been confirmed to continue until the financial year 2030-31. This extension provides long-term clarity and stability for subscribers, ensuring sustained retirement planning benefits.",
            "key_points": [
                "Atal Pension Yojana (APY) extended until 2030-31.",
                "Provides long-term clarity for subscribers.",
                "Ensures sustained retirement planning benefits."
            ]
        },
        {
            "headline": "High frequency indicators point to continued buoyancy: RBI report",
            "summary": "A report from the Reserve Bank of India (RBI) indicates that high-frequency economic indicators suggest sustained buoyancy in the economy. This positive outlook points to resilience and potential growth, despite global uncertainties.",
            "key_points": [
                "RBI report shows high-frequency indicators suggest economic buoyancy.",
                "Indicates sustained resilience and potential growth.",
                "A positive outlook despite global uncertainties."
            ]
        },
        {
            "headline": "Sensex swings 1.3k pts, ends below 82k",
            "summary": "The Sensex experienced a volatile day, swinging by 1,300 points before closing below the 82,000 mark. This significant fluctuation reflects market uncertainty and investor reactions to various economic and global cues.",
            "key_points": [
                "Sensex saw a 1,300-point swing.",
                "Closed below the 82,000 mark.",
                "Reflects market volatility and investor uncertainty."
            ]
        },
        {
            "headline": "Outward remittances fall to two-year low in Nov",
            "summary": "India's outward remittances recorded a two-year low in November, indicating a significant drop in money sent abroad by residents. This decline could be influenced by various factors, including economic conditions or changes in travel and investment patterns.",
            "key_points": [
                "Outward remittances hit a two-year low in November.",
                "Indicates a significant drop in money sent abroad.",
                "Could be influenced by economic conditions or investment patterns."
            ]
        },
        {
            "headline": "Cabinet approves Rs 5,000cr equity infusion for Sidbi",
            "summary": "The Union Cabinet has approved an equity infusion of Rs 5,000 crore for the Small Industries Development Bank of India (Sidbi). This substantial capital boost aims to strengthen Sidbi's capacity to support micro, small, and medium enterprises (MSMEs) across the country, fostering growth and employment.",
            "key_points": [
                "Cabinet approved Rs 5,000 crore equity infusion for Sidbi.",
                "Aims to strengthen Sidbi's support for MSMEs.",
                "Expected to foster growth and employment in small industries."
            ]
        },
        {
            "headline": "Local audit push: CAG flags capacity gaps, calls for stronger PAIs and tech-led audits",
            "summary": "The Comptroller and Auditor General (CAG) has highlighted capacity gaps in local audits and called for strengthening Public Audit Institutions (PAIs) and adopting technology-led audit methods. This push aims to improve accountability and efficiency in local governance and financial oversight.",
            "key_points": [
                "CAG identified capacity gaps in local audits.",
                "Called for stronger Public Audit Institutions (PAIs).",
                "Advocated for technology-led audit methods to improve accountability."
            ]
        },
        {
            "headline": "Trump tariff war: What is Europe’s ‘trade bazooka’? How it could hit US",
            "summary": "Amidst the threat of a new Trump tariff war, Europe is reportedly preparing a \"trade bazooka\" — a package of retaliatory measures designed to counteract US economic actions. The article examines the potential impact of these European measures on the US economy and global trade relations.",
            "key_points": [
                "Europe is preparing a \"trade bazooka\" against potential Trump tariffs.",
                "These are retaliatory measures designed to hit the US economy.",
                "Highlights the escalating tensions in global trade relations."
            ]
        },
        {
            "headline": "India cracks Smirnoff global top five: Diageo",
            "summary": "According to Diageo, the Indian market has broken into the global top five for Smirnoff sales, marking a significant milestone for the brand's presence in the country. This indicates growing consumption and market expansion for international spirit brands in India.",
            "key_points": [
                "India is now among the top five global markets for Smirnoff sales.",
                "This marks a significant milestone for Smirnoff in India.",
                "Reflects growing consumption of international spirits in the country."
            ]
        },
        {
            "headline": "Netherlands Resumes Imports of Russian Cobalt After Nearly 18-Month Pause: Eurostat",
            "summary": "According to Eurostat data, the Netherlands has resumed imports of Russian cobalt after a nearly 18-month hiatus. This resumption indicates a potential easing of some trade restrictions or a strategic necessity for critical minerals amidst ongoing geopolitical tensions.",
            "key_points": [
                "Netherlands resumed Russian cobalt imports after 18 months.",
                "Data from Eurostat confirms the resumption.",
                "Suggests easing trade restrictions or strategic necessity for minerals."
            ]
        },
        {
            "headline": "RBI’s Digital Currency Plan to Challenge Dollar-Centric Payment Systems: Expert",
            "summary": "An expert suggests that the Reserve Bank of India's (RBI) digital currency plan is poised to challenge existing dollar-centric payment systems globally. This initiative could significantly alter international financial transactions and reduce reliance on the US dollar.",
            "key_points": [
                "RBI's digital currency plan may challenge dollar-centric systems.",
                "Could alter international financial transactions.",
                "Aims to reduce reliance on the US dollar globally."
            ]
        }
    ],
    "Technology": [
        {
            "headline": "India and Russia Reach Preliminary Deal for Russian-Made SJ-100 Aircraft",
            "summary": "India and Russia have forged a preliminary agreement for the procurement of Russian-made SJ-100 aircraft, signaling deeper aerospace cooperation between the two nations. This deal could bolster India's aviation capabilities and strengthen its strategic partnership with Russia in the defense and technology sectors.",
            "key_points": [
                "India and Russia reached a preliminary deal for SJ-100 aircraft.",
                "Signals deeper aerospace cooperation.",
                "Could bolster India's aviation and defense capabilities."
            ]
        },
        {
            "headline": "Vaishnaw: India in 1st league of AI nations, not a follower",
            "summary": "Union IT Minister Ashwini Vaishnaw asserted that India is positioned in the \"first league\" of AI nations, emphasizing its role as an innovator rather than a mere follower. His statement highlights India's ambitious vision and growing capabilities in artificial intelligence development and deployment.",
            "key_points": [
                "IT Minister Vaishnaw states India is a \"first league\" AI nation.",
                "Emphasizes India's role as an innovator, not a follower.",
                "Highlights India's ambitious vision and capabilities in AI."
            ]
        },
        {
            "headline": "Russia to Showcase SuperJet-100 and Il-114-300 at Wings India 2026",
            "summary": "Russia is set to showcase its SuperJet-100 and Il-114-300 aircraft at the Wings India 2026 event, highlighting its advancements in aerospace technology. This exhibition aims to attract Indian buyers and collaborators, further strengthening aviation ties between the two countries.",
            "key_points": [
                "Russia to showcase SuperJet-100 and Il-114-300 at Wings India 2026.",
                "Highlights Russian aerospace technology advancements.",
                "Aims to attract Indian buyers and strengthen aviation ties."
            ]
        },
        {
            "headline": "Why Does Indo-Russian Tech Cooperation Matter More Than Ever Just Now?",
            "summary": "This article explores the heightened significance of Indo-Russian technological cooperation in the current geopolitical climate, arguing its importance has grown more than ever. It delves into the strategic advantages and mutual benefits that make this partnership crucial amidst evolving global dynamics.",
            "key_points": [
                "Examines heightened significance of Indo-Russian tech cooperation.",
                "Argues its importance is greater than ever due to geopolitics.",
                "Highlights strategic advantages and mutual benefits."
            ]
        }
    ],
    "Entertainment": [
        {
            "headline": "'Border 2' advance booking Day 1: Sunny Deol starrer to cross Rs 10 crore mark; eyes record of highest Republic Day grosser",
            "summary": "Sunny Deol's upcoming film 'Border 2' has shown strong performance in advance bookings, projected to cross the Rs 10 crore mark on its first day and potentially set a record for the highest Republic Day grosser. This indicates high anticipation and a positive reception for the patriotic sequel.",
            "key_points": [
                "'Border 2' has strong advance bookings.",
                "Projected to cross Rs 10 crore on Day 1.",
                "Aims for the highest Republic Day grosser record."
            ]
        },
        {
            "headline": "'Dhurandhar' slows down ahead of 'Border 2' release",
            "summary": "The film 'Dhurandhar' is experiencing a slowdown in its box office performance as the release of the highly anticipated 'Border 2' approaches. This indicates audience anticipation shifting towards the new big-budget release, impacting ongoing collections.",
            "key_points": [
                "'Dhurandhar' box office performance is slowing.",
                "Impacted by the upcoming release of 'Border 2'.",
                "Suggests audience anticipation has shifted."
            ]
        },
        {
            "headline": "'The Raja Saab' BO day 12: Horror film crosses Rs 141 crores",
            "summary": "The horror film 'The Raja Saab' has achieved a significant milestone, crossing Rs 141 crores at the box office by its 12th day of release. This strong collection indicates a successful run for the genre and positive audience reception, making it a commercial hit.",
            "key_points": [
                "'The Raja Saab' crossed Rs 141 crores at the box office.",
                "Achieved this milestone by its 12th day.",
                "Marks a successful run for the horror film."
            ]
        },
        {
            "headline": "Amitabh Bachchan, Dharmendra, Shah Rukh Khan: Rare unseen career pictures of Bollywood legends that tell stories beyond the screen",
            "summary": "A collection of rare, unseen career pictures featuring Bollywood legends like Amitabh Bachchan, Dharmendra, and Shah Rukh Khan has been released, offering fans a unique glimpse into their journeys. These images provide fascinating insights and tell stories that go beyond their on-screen personas.",
            "key_points": [
                "Rare, unseen career pictures of Bollywood legends released.",
                "Features Amitabh Bachchan, Dharmendra, and Shah Rukh Khan.",
                "Offers unique insights into their journeys beyond the screen."
            ]
        },
        {
            "headline": "'Don't force me to speak the language,' says Suniel Shetty as he gives his strong opinion on the Hindi-Marathi language row: 'I speak better than Maharashtrian kids'",
            "summary": "Actor Suniel Shetty weighed in on the Hindi-Marathi language dispute, stating his strong opinion that he should not be forced to speak a particular language, even claiming he speaks Marathi better than some local children. His comments have stirred debate on linguistic identity and cultural imposition.",
            "key_points": [
                "Suniel Shetty commented on the Hindi-Marathi language row.",
                "He stated he shouldn't be forced to speak a language.",
                "Claimed he speaks Marathi better than some local children.",
                "His comments sparked debate on linguistic identity."
            ]
        },
        {
            "headline": "Actor Awards 2026: Kristen Bell to return as host for Screen Actors Guild for third consecutive year",
            "summary": "Kristen Bell is set to host the Screen Actors Guild Awards for the third consecutive year in 2026, a testament to her popularity and success in the role. Her return ensures continuity and a familiar face for the prestigious industry event.",
            "key_points": [
                "Kristen Bell will host the SAG Awards for the third year in a row.",
                "Her return signifies her popularity and success as a host.",
                "Ensures continuity for the prestigious industry event."
            ]
        }
    ],
    "Sports": [
        {
            "headline": "T20 World Cup: 'We needed someone…': Rohit explains Iyer's omission",
            "summary": "Indian captain Rohit Sharma provided an explanation for the omission of Shreyas Iyer from the T20 World Cup squad, citing team requirements. His comments shed light on the selection strategy and the difficult decisions involved in finalizing a competitive team for the major tournament.",
            "key_points": [
                "Rohit Sharma explained Shreyas Iyer's T20 World Cup omission.",
                "Reason cited was specific team requirements.",
                "Highlights selection strategy for major tournaments."
            ]
        },
        {
            "headline": "'Would jeopardise sanctity' - Why ICC rejects Bangladesh's venue change request",
            "summary": "The International Cricket Council (ICC) rejected Bangladesh's request to change their venue, stating it \"would jeopardise the sanctity\" of the tournament. This decision highlights the ICC's commitment to maintaining established procedures and the integrity of its competitions.",
            "key_points": [
                "ICC rejected Bangladesh's venue change request.",
                "Reason cited: \"would jeopardise sanctity\" of the tournament.",
                "Emphasizes ICC's commitment to procedural integrity."
            ]
        },
        {
            "headline": "Stunning prediction! 'Shreyas Iyer can captain India to a World Cup win'",
            "summary": "A bold prediction has been made that Shreyas Iyer possesses the leadership qualities to captain India to a World Cup victory. This statement fuels debate among cricket enthusiasts about future leadership roles and India's potential for upcoming tournaments.",
            "key_points": [
                "Prediction states Shreyas Iyer could lead India to a World Cup win.",
                "Fuels debate on future leadership for Indian cricket.",
                "Highlights potential for upcoming tournaments."
            ]
        },
        {
            "headline": "Diamond League Final: Neeraj Chopra's event preview, time and live telecast in India",
            "summary": "An event preview for Neeraj Chopra's participation in the Diamond League Final has been released, including details on broadcast times and live telecast options in India. This highlights the growing national interest in track and field, especially for India's Olympic champion javelin thrower.",
            "key_points": [
                "Preview for Neeraj Chopra's Diamond League Final participation.",
                "Includes details on broadcast times and live telecast in India.",
                "Highlights national interest in India's Olympic champion."
            ]
        },
        {
            "headline": "FIDE WC in India: PM Modi says 'Chess is gaining popularity among our youth'",
            "summary": "Prime Minister Narendra Modi expressed his observation that chess is rapidly gaining popularity among Indian youth, as the FIDE World Championship is hosted in India. His remarks underscore the growing appeal of intellectual sports and India's potential as a global chess hub.",
            "key_points": [
                "PM Modi noted growing popularity of chess among Indian youth.",
                "Statement made during FIDE World Championship hosted in India.",
                "Highlights India's potential as a global chess hub."
            ]
        },
        {
            "headline": "Gully To Glory: Ramandeep Singh's journey from Chandigarh to Team India via KKR",
            "summary": "This article chronicles the inspiring journey of Ramandeep Singh, tracing his path from playing cricket in Chandigarh's gullies to making it into Team India after his stint with KKR. His story exemplifies dedication and perseverance in achieving national recognition.",
            "key_points": [
                "Ramandeep Singh's journey from Chandigarh to Team India.",
                "He made it to the national team after playing for KKR.",
                "His story is an inspiration of dedication and perseverance."
            ]
        },
        {
            "headline": "'We can't forget Pahalgam': Sehwag under fire for promoting IND vs PAK",
            "summary": "Former cricketer Virender Sehwag faced criticism for promoting an India vs. Pakistan match, with some netizens reminding him of the Pahalgam incident. The backlash highlights the sensitive intersection of sports and national sentiment, particularly regarding historical events.",
            "key_points": [
                "Virender Sehwag criticized for promoting India vs. Pakistan match.",
                "Netizens reminded him of the Pahalgam incident.",
                "Highlights tension between sports and national sentiment."
            ]
        },
        {
            "headline": "Sehwag junior arrives! Aaryavir Sehwag smashes boundaries for fun",
            "summary": "Aaryavir Sehwag, son of legendary cricketer Virender Sehwag, has reportedly started making waves by smashing boundaries, drawing comparisons to his famous father. His early performance suggests a promising cricketing career following in his father's footsteps.",
            "key_points": [
                "Aaryavir Sehwag, Virender Sehwag's son, is making an impact in cricket.",
                "He is noted for smashing boundaries, similar to his father.",
                "Suggests a promising cricketing career for the young player."
            ]
        },
        {
            "headline": "'Two reasons': Why was Dhoni promoted over Yuvraj? Sachin breaks silence",
            "summary": "Sachin Tendulkar has finally broken his silence on the decision to promote MS Dhoni ahead of Yuvraj Singh during a crucial match, revealing \"two reasons\" behind the strategic move. His explanation provides valuable insight into a much-debated moment in Indian cricket history.",
            "key_points": [
                "Sachin Tendulkar explained Dhoni's promotion over Yuvraj.",
                "He cited \"two reasons\" for the strategic decision.",
                "Provides insight into a debated moment in Indian cricket history."
            ]
        },
        {
            "headline": "Sarfaraz on fire! Back-to-back tons send strong message to selectors",
            "summary": "Sarfaraz Khan has delivered impressive back-to-back centuries, sending a powerful message to national selectors with his exceptional form. His consistent performance puts him firmly in contention for higher honors in Indian cricket.",
            "key_points": [
                "Sarfaraz Khan scored back-to-back centuries.",
                "His performance sends a strong message to selectors.",
                "Puts him in contention for higher honors in Indian cricket."
            ]
        },
        {
            "headline": "KCL thriller: Samson smashes century, but Muhammad steals show – Watch",
            "summary": "In a thrilling KCL match, Sanju Samson's century was overshadowed by Muhammad's exceptional performance, who ultimately \"stole the show\" with his game-changing contributions. This highlights individual brilliance in a high-stakes cricket encounter.",
            "key_points": [
                "Sanju Samson scored a century in a KCL thriller.",
                "Muhammad's performance overshadowed Samson's century.",
                "Highlights individual game-changing brilliance in cricket."
            ]
        },
        {
            "headline": "MLB trade rumors: Philadelphia Phillies eye $7.7 million Boston Red Sox outfielder as answer to looming 2026 outfield shakeup",
            "summary": "MLB trade rumors suggest the Philadelphia Phillies are interested in a $7.7 million Boston Red Sox outfielder to address a potential outfield shakeup in 2026. This potential acquisition indicates strategic planning for the team's future roster.",
            "key_points": [
                "Philadelphia Phillies are rumored to be eyeing a Red Sox outfielder.",
                "The player is valued at $7.7 million.",
                "Aims to address a potential 2026 outfield shakeup."
            ]
        },
        {
            "headline": "Jeanie Buss vs LeBron James net worth: Comparing the financial empires of the Lakers boss and the NBA superstar",
            "summary": "This article compares the net worth and financial empires of Jeanie Buss, the controlling owner of the Los Angeles Lakers, and NBA superstar LeBron James. It offers insights into the vast wealth accumulated by key figures in professional basketball, both on and off the court.",
            "key_points": [
                "Compares net worth of Jeanie Buss (Lakers owner) and LeBron James (NBA superstar).",
                "Highlights the financial empires of key figures in basketball.",
                "Offers insight into wealth accumulation in professional sports."
            ]
        }
    ],
    "Science": [
        {
            "headline": "Scientists discovered mysterious cave handprint that could be the oldest rock art ever found",
            "summary": "Scientists have unearthed a mysterious cave handprint that potentially represents the oldest rock art ever discovered, pushing back the known timeline of human artistic expression. This significant archaeological find could reshape our understanding of early human culture and creativity.",
            "key_points": [
                "A mysterious cave handprint discovered.",
                "Could be the oldest rock art ever found.",
                "Potentially redefines the timeline of human artistic expression."
            ]
        },
        {
            "headline": "Suni Williams retires: NASA astronaut's record-breaking space career",
            "summary": "NASA astronaut Suni Williams, known for her record-breaking achievements in space, has officially retired from her illustrious career. Her contributions to space exploration and extended stays on the International Space Station have left a significant mark on human spaceflight history.",
            "key_points": [
                "NASA astronaut Suni Williams has retired.",
                "She is known for her record-breaking space career.",
                "Her contributions to space exploration are significant."
            ]
        }
    ],
    "Health": [
        {
            "headline": "65 student suicides at IITs in 5 yrs, alumni group calls for accountability",
            "summary": "A shocking report reveals 65 student suicides at various IITs over the past five years, prompting an alumni group to demand accountability and mental health reforms. This alarming statistic highlights a severe mental health crisis within India's premier educational institutions.",
            "key_points": [
                "65 student suicides reported at IITs in 5 years.",
                "Alumni group demands accountability and mental health reforms.",
                "Highlights a severe mental health crisis in premier Indian institutions."
            ]
        },
        {
            "headline": "Not baby fat: Extra weight can harm a child’s liver, warns doctor",
            "summary": "A doctor has issued a warning that what is often dismissed as \"baby fat\" in children can actually be extra weight that poses serious risks, including harm to a child's liver. This highlights the importance of addressing childhood obesity and promoting healthy lifestyles from a young age.",
            "key_points": [
                "Doctor warns that \"baby fat\" can be harmful extra weight.",
                "Extra weight poses risks, including to a child's liver.",
                "Highlights importance of addressing childhood obesity."
            ]
        },
        {
            "headline": "UK study shows ctDNA blood test can predict how advanced breast cancer patients will respond to therapy: Doctor explains what it is",
            "summary": "A UK study has demonstrated that a ctDNA blood test can effectively predict how patients with advanced breast cancer will respond to specific therapies, offering a significant advancement in personalized medicine. A doctor explains the implications, highlighting its potential to guide more effective treatment strategies.",
            "key_points": [
                "UK study reveals ctDNA blood test predicts breast cancer therapy response.",
                "The test is for advanced breast cancer patients.",
                "Offers a significant advancement in personalized medicine."
            ]
        },
        {
            "headline": "Man pronounced dead shocked family after waking up in a body bag while waiting to be embalmed",
            "summary": "In a truly shocking incident, a man who had been pronounced dead regained consciousness inside a body bag while awaiting embalming, terrifying his family. This rare and bewildering event raises serious questions about medical protocols and confirmation of death procedures.",
            "key_points": [
                "Man pronounced dead woke up in a body bag.",
                "The incident shocked his family.",
                "Raises questions about medical protocols and confirmation of death."
            ]
        }
    ]
}