{
    "World": [
        {
            "headline": "Shooting near White House: One National Guard member dead, another critically injured, Trump says",
            "summary": "A shooting occurred near the White House, resulting in the death of one National Guard member and critical injury to another. Former President Trump confirmed the incident.",
            "key_points": [
                "One National Guard member killed, another critically injured.",
                "Incident took place near the White House.",
                "Trump confirmed the casualties."
            ]
        },
        {
            "headline": "DC shooting: Trump admin to re-examine green card holders from 19 ‘countries of concern’ — full list",
            "summary": "Following the White House shooting, the Trump administration plans to re-examine green card holders from 19 identified 'countries of concern.' This move suggests a stricter immigration policy in response to security incidents.",
            "key_points": [
                "Trump administration to re-examine green cards.",
                "Focus on holders from 19 'countries of concern'.",
                "Action taken after the White House shooting."
            ]
        },
        {
            "headline": "Russia-Ukraine war: Putin says US plan ‘could form basis’ of ceasefire deal",
            "summary": "Russian President Putin has indicated that a US peace plan could serve as a foundation for a ceasefire agreement in the ongoing Russia-Ukraine conflict. This statement suggests a potential diplomatic opening, though details of the plan and conditions for acceptance remain unclear.",
            "key_points": [
                "Putin considers US peace plan as a basis for ceasefire.",
                "Relates to the Russia-Ukraine war.",
                "Hints at a potential diplomatic path."
            ]
        },
        {
            "headline": "Hong Kong high-rise blaze: Death toll climbs to 94 - latest developments",
            "summary": "A devastating high-rise fire in Hong Kong has seen its death toll rise significantly to 94. Authorities are continuing to investigate the cause and manage the aftermath of the tragic incident.",
            "key_points": [
                "High-rise fire in Hong Kong.",
                "Death toll reached 94.",
                "Investigation and aftermath management ongoing."
            ]
        },
        {
            "headline": "Did this airstrike take Afghanistan and Pakistan a step closer to war?",
            "summary": "An airstrike has raised tensions significantly between Afghanistan and Pakistan, leading to speculation that the two nations are on the brink of war. The incident's specifics and location would be crucial for understanding the full implications.",
            "key_points": [
                "Airstrike heightened tensions between Afghanistan and Pakistan.",
                "Raises concerns about a potential war.",
                "Details of the strike are key to its impact."
            ]
        },
        {
            "headline": "G20 Leaders Adopt Joint Declaration at South Africa Summit",
            "summary": "G20 leaders have adopted a joint declaration at the South Africa Summit, addressing various global challenges and outlining commitments. This marks a consensus on critical international issues among major economies.",
            "key_points": [
                "G20 leaders adopted a joint declaration.",
                "At the South Africa Summit.",
                "Addresses global challenges and outlines commitments."
            ]
        },
        {
            "headline": "President Putin Advances Russia’s Nuclear Power in Key Meetings - Rosatom CEO",
            "summary": "Rosatom CEO reported that President Putin is actively advancing Russia's nuclear power capabilities through key meetings. This indicates a strategic focus on strengthening Russia's position in nuclear technology and energy.",
            "key_points": [
                "Putin is advancing Russia's nuclear power.",
                "Confirmed by Rosatom CEO.",
                "Highlights strategic focus on nuclear technology."
            ]
        },
        {
            "headline": "Nicaragua Seals Cooperation Deals With Donetsk and Crimea's Sevastopol",
            "summary": "Nicaragua has formalized cooperation deals with Donetsk and Sevastopol in Crimea. This move signifies political recognition and strengthened ties with these disputed territories.",
            "key_points": [
                "Nicaragua seals cooperation deals with Donetsk and Sevastopol.",
                "Indicates political recognition of these regions.",
                "Strengthens ties with disputed territories."
            ]
        }
    ],
    "Business": [
        {
            "headline": "Sensex hits 86k, new high in over a year",
            "summary": "The Sensex has reached a new high of 86,000, marking its highest point in over a year. This indicates a strong bullish trend and positive investor sentiment in the Indian stock market.",
            "key_points": [
                "Sensex reached 86,000 points.",
                "New high in over a year.",
                "Reflects strong market performance and investor confidence."
            ]
        },
        {
            "headline": "Indian Economy to Cross $4 Trillion Mark in Current Fiscal: Chief Economic Advisor",
            "summary": "India's Chief Economic Advisor predicts that the Indian economy will surpass the $4 trillion mark in the current fiscal year. This projection signals robust economic growth and development.",
            "key_points": [
                "Indian economy projected to cross $4 trillion.",
                "Expected in current fiscal year.",
                "Signals robust economic growth."
            ]
        },
        {
            "headline": "India To Keep Buying Russian Oil in Long-Term, Despite US Pressure: Kpler",
            "summary": "According to Kpler, India intends to continue purchasing Russian oil long-term, despite pressure from the US. This highlights India's energy security priorities and its independent foreign policy.",
            "key_points": [
                "India to continue long-term Russian oil purchases.",
                "Despite US pressure.",
                "Highlights India's energy security and independent policy."
            ]
        },
        {
            "headline": "India's Crude Imports From Russia Surge 17% in November 2025",
            "summary": "India's crude oil imports from Russia saw a 17% surge in November 2025. This increase underscores India's continued reliance on Russian oil, despite global geopolitical shifts.",
            "key_points": [
                "India's crude imports from Russia surged 17%.",
                "Occurred in November 2025.",
                "Highlights continued reliance on Russian oil."
            ]
        },
        {
            "headline": "Byju's Raveendran to file for $2.5bn damages, will appeal order",
            "summary": "Byju's founder, Byju Raveendran, plans to seek $2.5 billion in damages and appeal a recent order. This indicates ongoing legal and financial troubles for the ed-tech giant.",
            "key_points": [
                "Byju Raveendran to seek $2.5 billion in damages.",
                "Will appeal a recent order.",
                "Signifies ongoing legal and financial issues for Byju's."
            ]
        },
        {
            "headline": "Fresh I-T push: 25k flagged for foreign assets, income; advised to review returns by Dec 31",
            "summary": "The Income Tax department has identified 25,000 individuals with undeclared foreign assets and income, urging them to review their tax returns by December 31. This initiative aims to crack down on overseas tax evasion.",
            "key_points": [
                "25,000 individuals flagged for foreign assets/income.",
                "I-T department advises review of returns by Dec 31.",
                "Aimed at curbing overseas tax evasion."
            ]
        },
        {
            "headline": "India Greenlights $815M Push to Supercharge Rare Earth Magnet Production",
            "summary": "India has approved an $815 million initiative to significantly boost its production of rare earth magnets. This strategic investment aims to reduce reliance on imports and strengthen domestic manufacturing in critical technologies.",
            "key_points": [
                "India greenlights $815M for rare earth magnet production.",
                "Aims to boost domestic manufacturing.",
                "Reduces import reliance in critical technologies."
            ]
        },
        {
            "headline": "Expansion spree: Ikea plans to add 4-5 stores every year",
            "summary": "Ikea announced an aggressive expansion plan in India, intending to open 4-5 new stores annually. This strategic move aims to deepen its presence and capture a larger share of the rapidly growing Indian retail market.",
            "key_points": [
                "Ikea plans to open 4-5 new stores yearly in India.",
                "Part of an aggressive expansion strategy.",
                "Aims to grow market share in Indian retail."
            ]
        }
    ],
    "Technology": [
        {
            "headline": "‘India’s space leap’: PM inaugurates Skyroot Infinity campus; Vikram-I commercial rocket unveiled",
            "summary": "The Prime Minister inaugurated Skyroot Infinity campus, marking 'India’s space leap' and unveiling the Vikram-I commercial rocket. This signifies a major advancement in India's private space sector capabilities and aspirations.",
            "key_points": [
                "PM inaugurated Skyroot Infinity campus.",
                "Vikram-I commercial rocket unveiled.",
                "Marks a significant \"space leap\" for India."
            ]
        },
        {
            "headline": "SC to govt: Need to pre-screen social media content; warns of viral ‘damage’ risk",
            "summary": "The Supreme Court has advised the government on the necessity of pre-screening social media content, citing the risk of viral 'damage.' This highlights growing judicial concern over misinformation and its societal impact.",
            "key_points": [
                "SC advises government to pre-screen social media content.",
                "Warns of \"viral damage\" risk.",
                "Addresses concerns about misinformation."
            ]
        },
        {
            "headline": "‘Indrajaal’: Hyderabad-based defence tech company develops anti-drone vehicle; capable of hijacking hostile UAVs",
            "summary": "A Hyderabad-based defense tech company has developed an anti-drone vehicle named 'Indrajaal', capable of hijacking hostile UAVs. This advanced technology provides a significant boost to India's aerial defense capabilities against drone threats.",
            "key_points": [
                "Hyderabad firm develops 'Indrajaal' anti-drone vehicle.",
                "Capable of hijacking hostile UAVs.",
                "Enhances India's aerial defense technology."
            ]
        },
        {
            "headline": "India’s Shipbuilding Ecosystem Makes It a Maritime Powerhouse: MoD",
            "summary": "The Ministry of Defence states that India's robust shipbuilding ecosystem positions it as a maritime powerhouse. This highlights indigenous defense manufacturing capabilities and strategic naval strength.",
            "key_points": [
                "India's shipbuilding ecosystem makes it a maritime powerhouse.",
                "According to the Ministry of Defence.",
                "Highlights indigenous defense manufacturing and naval strength."
            ]
        },
        {
            "headline": "22-year-old Indian-origin engineer rewrites wind energy maths",
            "summary": "A 22-year-old Indian-origin engineer has made groundbreaking contributions by rewriting the mathematics of wind energy, potentially leading to more efficient and advanced wind power solutions. This innovation could have a global impact on renewable energy.",
            "key_points": [
                "Indian-origin engineer rewrites wind energy mathematics.",
                "Could lead to more efficient wind power.",
                "Significant innovation in renewable energy."
            ]
        }
    ],
    "Entertainment": [
        {
            "headline": "‘Drishyam 3’ release: Jeethu Joseph clarifies timeline; No simultaneous release for Mohanlal and Ajay Devgn versions - Reports",
            "summary": "Director Jeethu Joseph has clarified the timeline for 'Drishyam 3', stating there will be no simultaneous release for the Mohanlal and Ajay Devgn versions, contrary to earlier reports. This provides definitive information for fans eagerly awaiting the film.",
            "key_points": [
                "Jeethu Joseph clarifies 'Drishyam 3' release timeline.",
                "No simultaneous release for Mohanlal and Ajay Devgn versions.",
                "Corrects previous rumors about the film."
            ]
        },
        {
            "headline": "'Tere Ishk Mein' Movie Review and Release Live Updates: Dhanush and Kriti Sanon's romantic drama expected to open at Rs 9 - 11 crores",
            "summary": "The romantic drama 'Tere Ishk Mein', starring Dhanush and Kriti Sanon, is projected to earn between Rs 9-11 crores on its opening day. This article provides a live review and updates on its box office performance.",
            "key_points": [
                "'Tere Ishk Mein' starring Dhanush and Kriti Sanon.",
                "Expected to open at Rs 9-11 crores.",
                "Includes live review and box office updates."
            ]
        },
        {
            "headline": "Bigg Boss 19: Gaurav Khanna wins Ticket To Finale",
            "summary": "Gaurav Khanna has secured the 'Ticket To Finale' in Bigg Boss 19, marking a significant milestone in the reality show. This win guarantees his spot in the grand finale, intensifying competition for other contestants.",
            "key_points": [
                "Gaurav Khanna wins 'Ticket To Finale' in Bigg Boss 19.",
                "Secures his spot in the grand finale.",
                "Intensifies competition among contestants."
            ]
        },
        {
            "headline": "‘I am public personality, not public property': Actress takes on body-shaming",
            "summary": "A prominent actress has spoken out against body-shaming, asserting her right as a 'public personality, not public property.' Her statement highlights the ongoing issue of scrutiny faced by celebrities and advocates for personal respect.",
            "key_points": [
                "Actress speaks out against body-shaming.",
                "States she is a 'public personality, not public property.'",
                "Addresses scrutiny faced by celebrities."
            ]
        },
        {
            "headline": "Harshvardhan Rane buys 2 lavish apartments in Mumbai's green locality following consecutive superhits in 2025",
            "summary": "Following a string of superhit films in 2025, Harshvardhan Rane has purchased two lavish apartments in a green locality in Mumbai. This acquisition reflects his recent professional success and growing wealth.",
            "key_points": [
                "Harshvardhan Rane bought two lavish apartments in Mumbai.",
                "Follows consecutive superhits in 2025.",
                "Reflects his recent professional success."
            ]
        }
    ],
    "Sports": [
        {
            "headline": "IND vs SA: 'The biggest fault' - Harbhajan Singh lashes out at Team India",
            "summary": "Harbhajan Singh has strongly criticized Team India's performance in the IND vs SA match, identifying 'the biggest fault' in their play. His remarks highlight areas of concern for the national cricket team.",
            "key_points": [
                "Harbhajan Singh criticizes Team India.",
                "Points out 'biggest fault' in IND vs SA match.",
                "Highlights concerns for national cricket team."
            ]
        },
        {
            "headline": "Stunning prediction! 'Shreyas Iyer can captain India to a World Cup win'",
            "summary": "A 'stunning prediction' suggests Shreyas Iyer has the potential to captain India to a World Cup victory. This highlights the growing leadership capabilities perceived in the cricketer and his future prospects.",
            "key_points": [
                "Prediction states Shreyas Iyer can captain India to World Cup win.",
                "Highlights his leadership potential.",
                "Focuses on his future prospects in cricket."
            ]
        },
        {
            "headline": "Diamond League Final: Neeraj Chopra's event preview, time and live telecast in India",
            "summary": "This article provides a preview of Neeraj Chopra's event at the Diamond League Final, including broadcast times and live telecast details for Indian viewers. It highlights the importance of his performance for India in athletics.",
            "key_points": [
                "Preview of Neeraj Chopra at Diamond League Final.",
                "Includes telecast details for India.",
                "Highlights his importance in Indian athletics."
            ]
        },
        {
            "headline": "FIDE WC in India: PM Modi says 'Chess is gaining popularity among our youth'",
            "summary": "During the FIDE World Cup in India, Prime Minister Modi remarked that chess is increasingly popular among Indian youth. This statement underscores the growing interest in the sport nationally.",
            "key_points": [
                "PM Modi comments on FIDE World Cup in India.",
                "States chess is popular among Indian youth.",
                "Highlights growing interest in the sport."
            ]
        },
        {
            "headline": "Sarfaraz on fire! Back-to-back tons send strong message to selectors",
            "summary": "Sarfaraz Khan is in exceptional form, hitting 'back-to-back tons' that send a strong message to national selectors. His consistent high performance is making a compelling case for higher honors.",
            "key_points": [
                "Sarfaraz Khan scores back-to-back centuries.",
                "Sends strong message to selectors.",
                "Making a case for higher cricket honors."
            ]
        }
    ],
    "Science": [
        {
            "headline": "How new research proves prevention of cervical cancer by HPV vaccination",
            "summary": "New research has definitively proven the effectiveness of HPV vaccination in preventing cervical cancer. This breakthrough reinforces the importance of widespread vaccination programs for public health.",
            "key_points": [
                "New research proves HPV vaccination prevents cervical cancer.",
                "Reinforces importance of vaccination programs.",
                "Significant finding for public health."
            ]
        },
        {
            "headline": "A rare brain disorder where you don’t feel fear and why it’s more dangerous than you think",
            "summary": "This article discusses a rare brain disorder that prevents individuals from experiencing fear, explaining why this condition is far more dangerous than it seems. It delves into the critical role of fear for survival.",
            "key_points": [
                "Discusses rare brain disorder causing absence of fear.",
                "Explains why lack of fear is dangerous.",
                "Highlights fear's role in survival."
            ]
        }
    ],
    "Health": [
        {
            "headline": "Superbugs now resistant to key everyday antibiotics: ICMR",
            "summary": "The ICMR reports that superbugs are increasingly resistant to key everyday antibiotics, posing a significant public health threat. This alarming development underscores the urgent need for new antimicrobial strategies.",
            "key_points": [
                "ICMR reports superbug resistance to everyday antibiotics.",
                "Presents a significant public health threat.",
                "Highlights urgent need for new antimicrobial strategies."
            ]
        },
        {
            "headline": "“Zero sugar doesn’t mean zero harm!”: Expert reveals hidden dangers of sugar-free snacks on gut health, insulin, and weight gain",
            "summary": "An expert warns that 'zero sugar' snacks are not necessarily harmless, revealing their hidden dangers to gut health, insulin regulation, and potential for weight gain. This challenges popular perceptions about healthy eating.",
            "key_points": [
                "\"Zero sugar\" snacks can have hidden dangers.",
                "Impacts gut health, insulin, and weight gain.",
                "Challenges healthy eating perceptions."
            ]
        },
        {
            "headline": "Vascular surgeon recommends 3 natural ways to keep your arteries clear and protect heart health",
            "summary": "A vascular surgeon recommends three natural methods to maintain clear arteries and safeguard heart health. These practical tips offer accessible ways to improve cardiovascular well-being without invasive procedures.",
            "key_points": [
                "Vascular surgeon recommends 3 natural ways for clear arteries.",
                "Aims to protect heart health.",
                "Offers practical cardiovascular health tips."
            ]
        },
        {
            "headline": "Heart health: 5 ways to check for arterial plaque at home",
            "summary": "This article outlines five simple methods to check for arterial plaque at home, empowering individuals to monitor their heart health proactively. These non-invasive checks can be early indicators of cardiovascular risk.",
            "key_points": [
                "Lists 5 ways to check for arterial plaque at home.",
                "Enables proactive heart health monitoring.",
                "Provides early indicators of cardiovascular risk."
            ]
        },
        {
            "headline": "Why your body wants extra sleep: 7 Hidden causes of oversleeping revealed",
            "summary": "This article reveals seven hidden causes behind the body's desire for extra sleep, ranging from underlying health issues to lifestyle factors. Understanding these reasons can help individuals address chronic oversleeping.",
            "key_points": [
                "Reveals 7 hidden causes of oversleeping.",
                "Ranges from health issues to lifestyle factors.",
                "Helps understand and address chronic oversleeping."
            ]
        },
        {
            "headline": "Gastroenterologist doctor reveals the power of eating 3 eggs everyday",
            "summary": "A gastroenterologist highlights the health benefits of eating three eggs daily, revealing their nutritional power. This article counters common misconceptions about egg consumption and its impact on health.",
            "key_points": [
                "Gastroenterologist reveals benefits of eating 3 eggs daily.",
                "Highlights nutritional power of eggs.",
                "Counters misconceptions about egg consumption."
            ]
        }
    ]
}