{
    "World": [
        {
            "headline": "'I'm Indian': Tripura student's last words before he was killed in a racial attack",
            "summary": "A Tripura student was killed in a racial attack, with his final words being \"I'm Indian,\" sparking protests and calls for justice. An FIR has been filed, and investigations are underway to uncover the full extent of the hate crime.",
            "key_points": [
                "Tripura student killed in a racial attack, uttering \"I'm Indian\" as last words.",
                "The incident has led to widespread protests seeking justice.",
                "An FIR has been filed, and investigations are ongoing."
            ]
        },
        {
            "headline": "Aravali row: SC takes suo motu cognisance; CJI-led bench to hear case on Monday",
            "summary": "The Supreme Court has taken suo motu cognizance of the Aravali row, with a CJI-led bench scheduled to hear the case on Monday. This move highlights the judiciary's proactive role in addressing environmental concerns, particularly illegal mining in the Aravali range.",
            "key_points": [
                "Supreme Court takes suo motu cognizance of the Aravali row.",
                "A CJI-led bench will hear the environmental case on Monday.",
                "The issue concerns illegal mining and environmental damage."
            ]
        },
        {
            "headline": "Unnao rape case: CBI cites Advani judgment to seek Sengar bail nixing",
            "summary": "The CBI has referenced the Advani judgment in its efforts to oppose the bail plea of former MLA Kuldeep Singh Sengar in the Unnao rape case. This legal strategy aims to ensure justice for the victim and prevent the accused from being released.",
            "key_points": [
                "CBI seeks to block bail for Kuldeep Singh Sengar in Unnao rape case.",
                "The agency cites the Advani judgment to support its argument.",
                "This is part of ongoing legal efforts in a high-profile case."
            ]
        },
        {
            "headline": "Noida: Cloth found in woman’s abdomen 15 months after C-section; FIR against 6 doctors",
            "summary": "A shocking case of medical negligence has emerged in Noida, where a surgical cloth was discovered in a woman's abdomen 15 months after her C-section. An FIR has been filed against six doctors involved, leading to an investigation into this serious lapse.",
            "key_points": [
                "Surgical cloth found in a woman's abdomen 15 months post C-section.",
                "An FIR has been lodged against six doctors for negligence.",
                "The incident highlights a grave case of medical malpractice."
            ]
        },
        {
            "headline": "Sikh woman gives land for mosque, Hindus pitch in with donations",
            "summary": "In a heartening display of communal harmony, a Sikh woman has donated land for the construction of a mosque, with members of the Hindu community also contributing donations. This act exemplifies interfaith cooperation and solidarity in India.",
            "key_points": [
                "Sikh woman donates land for a mosque in a gesture of harmony.",
                "Hindu community members are contributing donations to the project.",
                "The act symbolizes strong interfaith cooperation in India."
            ]
        },
        {
            "headline": "Congress: Like demonetisation, decimation of MGNREGA decision of PM Modi",
            "summary": "The Congress party has criticized PM Modi's alleged \"decimation\" of the MGNREGA scheme, drawing parallels to the demonetisation policy. They assert that both decisions were unilaterally made by the Prime Minister, impacting rural employment and the economy.",
            "key_points": [
                "Congress criticizes PM Modi's alleged 'decimation' of MGNREGA.",
                "Compares the decision to the demonetisation policy.",
                "Alleges both were unilateral decisions impacting the rural economy."
            ]
        },
        {
            "headline": "Empty childcare centres and millions paid: YouTuber Nick Shirley's investigation sparks outrage over alleged Minnesota welfare fraud",
            "summary": "A YouTuber's investigation into alleged welfare fraud in Minnesota has uncovered empty childcare centers receiving millions in payments, sparking widespread outrage. Nick Shirley's findings suggest a significant misuse of public funds, prompting calls for accountability and further scrutiny.",
            "key_points": [
                "YouTuber Nick Shirley exposed alleged welfare fraud in Minnesota.",
                "Empty childcare centers reportedly received millions in payments.",
                "The investigation sparked outrage and calls for accountability."
            ]
        },
        {
            "headline": "Yamuna sand mining: Mid-river digs to illegal ramps, NGT panel finds major violations",
            "summary": "An NGT panel has uncovered significant violations in Yamuna sand mining, ranging from mid-river excavations to illegal ramps. These findings highlight widespread illicit practices that are causing severe environmental damage and warrant urgent intervention.",
            "key_points": [
                "NGT panel found major violations in Yamuna sand mining.",
                "Violations include mid-river excavations and illegal ramps.",
                "Illicit practices are causing severe environmental damage."
            ]
        },
        {
            "headline": "'If Ukraine did not want to resolve ...': Putin sends warning ahead of Trump-Zelenskyy meeting",
            "summary": "Russian President Putin has issued a stern warning ahead of a planned meeting between Donald Trump and Volodymyr Zelenskyy, implying consequences if Ukraine is unwilling to resolve the ongoing conflict. This statement underscores the high stakes and geopolitical tensions surrounding potential peace talks.",
            "key_points": [
                "Putin warns Ukraine ahead of Trump-Zelenskyy meeting.",
                "Implies consequences if Ukraine avoids conflict resolution.",
                "Highlights geopolitical tensions surrounding potential peace talks."
            ]
        },
        {
            "headline": "Twist in court: 2nd husband testifies for 1st; woman loses 17-year old DV case",
            "summary": "A domestic violence case, ongoing for 17 years, took an unexpected turn when the woman's second husband testified in favor of her first husband, leading to her losing the case. This unusual development highlights the complexities and personal dynamics often involved in prolonged legal battles.",
            "key_points": [
                "Woman loses 17-year-old domestic violence case due to court twist.",
                "Her second husband testified in favor of her first husband.",
                "The case highlights complexities of prolonged legal battles."
            ]
        },
        {
            "headline": "Assam: CM Sarma claims possible annexation attempt if Bangladeshi population exceeds 50%",
            "summary": "Assam CM Himanta Biswa Sarma has controversially claimed that a possible annexation attempt could occur if the Bangladeshi population in the state exceeds 50%. This statement has stirred political debate and raises concerns about demographic changes and regional security.",
            "key_points": [
                "Assam CM Sarma claims possible annexation if Bangladeshi population exceeds 50%.",
                "The statement is controversial, stirring political debate.",
                "Raises concerns about demographic changes and regional security."
            ]
        },
        {
            "headline": "UP boy who saved dad from crocodile wants to protect nation",
            "summary": "A brave boy from Uttar Pradesh, who courageously saved his father from a crocodile attack, has now expressed his aspiration to protect the nation. His remarkable act of bravery and patriotic ambition has garnered widespread admiration.",
            "key_points": [
                "UP boy saved his father from a crocodile attack.",
                "He now aspires to protect the nation.",
                "His bravery and patriotic ambition gained admiration."
            ]
        },
        {
            "headline": "Zelensky's Legitimacy On The Line As Aide Floats Online Voting For Wartime Election | No Choice?",
            "summary": "President Zelenskyy's legitimacy is being questioned as an aide suggests online voting for a wartime election, sparking debate about democratic processes during conflict. The proposal highlights the challenges of holding elections amidst ongoing hostilities and raising concerns about fairness and participation.",
            "key_points": [
                "Zelenskyy's legitimacy is questioned as online voting for wartime election is floated.",
                "Proposal sparks debate on democratic processes during conflict.",
                "Highlights challenges of elections amidst ongoing hostilities."
            ]
        },
        {
            "headline": "Taiwan Earthquake: Buildings Sway, People ‘RUN FOR LIFE’ As Restaurant Shakes | Chilling Footage",
            "summary": "A powerful earthquake has struck Taiwan, causing buildings to sway violently and prompting people to flee for their lives. Chilling footage shows a restaurant shaking intensely, capturing the terror experienced by residents during the seismic event.",
            "key_points": [
                "A powerful earthquake hit Taiwan, causing buildings to sway.",
                "People were seen running for their lives amidst shaking structures.",
                "Chilling footage captures a restaurant shaking intensely."
            ]
        },
        {
            "headline": "Putin Dons Military Uniform, Celebrates Capture Of Hulyaipole & Myrnohrad | ‘Elite Kyiv Forces Lost’",
            "summary": "Russian President Putin was seen in military uniform, celebrating the reported capture of Hulyaipole and Myrnohrad, claiming that elite Kyiv forces suffered significant losses. This display underscores Russia's asserted gains in the ongoing conflict and its strategic messaging.",
            "key_points": [
                "Putin celebrated reported capture of Hulyaipole and Myrnohrad in military uniform.",
                "Claims elite Kyiv forces suffered significant losses.",
                "Underscores Russia's asserted gains and strategic messaging in the conflict."
            ]
        },
        {
            "headline": "'Recognise Palestine 1st': Angry Hamas, Qatar, China, Somalia SCHOOL Israel Over Somaliland Shocker",
            "summary": "Hamas, Qatar, China, and Somalia have strongly condemned Israel's reported engagement with Somaliland, demanding that Israel first recognize Palestine. This collective outcry highlights widespread international disapproval and reignites calls for Palestinian statehood amidst new diplomatic moves.",
            "key_points": [
                "Hamas, Qatar, China, Somalia condemn Israel over Somaliland engagement.",
                "Demand Israel recognize Palestine first, intensifying calls for statehood.",
                "Highlights international disapproval of new diplomatic moves."
            ]
        },
        {
            "headline": "French Farmers DEFY Macron; Dump Waste At Govt Offices, Straws On Streets As Anger Boils Over",
            "summary": "French farmers have escalated their protests against President Macron's government, dumping agricultural waste at government offices and straws on streets, signifying boiling anger. Their actions highlight deep dissatisfaction with agricultural policies and demands for better support.",
            "key_points": [
                "French farmers protest against Macron's government, dumping waste.",
                "Actions signify boiling anger over agricultural policies.",
                "Demands for better support are central to their protests."
            ]
        },
        {
            "headline": "Zohran Mamdani once slammed police as ‘wicked’—now his inauguration needs hundreds",
            "summary": "Zohran Mamdani, who previously criticized the police as \"wicked,\" now requires hundreds for security at his inauguration, revealing an ironic shift in circumstances. This situation highlights the complexities and inherent contradictions faced by public figures balancing past statements with current security needs.",
            "key_points": [
                "Zohran Mamdani, a past police critic, now requires extensive security for inauguration.",
                "Hundreds of security personnel are needed for his event.",
                "Highlights irony and complexities for public figures regarding past statements."
            ]
        },
        {
            "headline": "Despite Trump, 2025 wasn't too bad. But 2026 could be much worse",
            "summary": "The article reflects on 2025, suggesting it wasn't severely negative despite the presence of Trump, but warns that 2026 could bring considerably worse conditions. This assessment likely touches upon political stability, economic trends, and global events influencing the future outlook.",
            "key_points": [
                "2025 was relatively stable despite Trump's political presence.",
                "Warning issued that 2026 could bring considerably worse conditions.",
                "Outlook considers political stability, economic trends, and global events."
            ]
        },
        {
            "headline": "Explosive comments from Bangladeshi populists -- how India should react",
            "summary": "The article discusses inflammatory remarks made by Bangladeshi populists and analyzes potential responses for India. It explores the geopolitical implications of such comments and advises on diplomatic strategies to manage regional relations effectively.",
            "key_points": [
                "Bangladeshi populists made explosive comments, prompting India to react.",
                "Article analyzes potential responses for India.",
                "Explores geopolitical implications and diplomatic strategies for regional relations."
            ]
        },
        {
            "headline": "Baby wants blush? Toddler makeup poses a new dilemma for parents",
            "summary": "The emerging trend of toddler makeup is presenting parents with a new dilemma, raising questions about childhood innocence, self-image, and exposure to beauty standards at a very young age. This trend sparks debate on its psychological and developmental impact on children.",
            "key_points": [
                "Toddler makeup trend creates a new dilemma for parents.",
                "Raises questions about childhood innocence and early exposure to beauty standards.",
                "Sparks debate on psychological and developmental impact on children."
            ]
        },
        {
            "headline": "Rahul permanent spokesperson of anti-India global forces: BJP",
            "summary": "The BJP has strongly criticized Rahul Gandhi, labeling him a \"permanent spokesperson of anti-India global forces.\" This accusation escalates political rhetoric, alleging that Gandhi's statements align with elements detrimental to India's national interests on an international platform.",
            "key_points": [
                "BJP labels Rahul Gandhi a 'permanent spokesperson of anti-India global forces'.",
                "Accusation escalates political rhetoric.",
                "Alleges Gandhi's statements align with elements detrimental to national interests."
            ]
        },
        {
            "headline": "Family of junior engineer killed by Maharashtra roadways bus awarded 2.2 crore",
            "summary": "The family of a junior engineer who was tragically killed by a Maharashtra roadways bus has been awarded a compensation of 2.2 crore. This significant payout highlights the legal system's efforts to provide justice and financial relief to victims of accidents.",
            "key_points": [
                "Family of junior engineer killed by Maharashtra roadways bus awarded 2.2 crore.",
                "Compensation highlights legal system's efforts for justice and financial relief.",
                "The payout is significant for victims of accidents."
            ]
        },
        {
            "headline": "‘Pressured to marry him’: Faridabad woman accuses ex-colleague of stalking, sexual assault, arson; FIR filed",
            "summary": "A woman in Faridabad has filed an FIR against her former colleague, accusing him of stalking, sexual assault, arson, and pressuring her into marriage. This serious complaint highlights issues of harassment and violence against women, prompting a police investigation.",
            "key_points": [
                "Faridabad woman accuses ex-colleague of stalking, sexual assault, arson, and coercion.",
                "She claims he pressured her into marriage.",
                "An FIR has been filed, initiating a police investigation."
            ]
        },
        {
            "headline": "Madhya Pradesh: 22-year-old woman raped by clerk on university campus in Jabalpur; victim lured with fake job offer",
            "summary": "A 22-year-old woman in Jabalpur, Madhya Pradesh, was allegedly raped by a clerk on a university campus after being lured with a fake job offer. This disturbing incident underscores vulnerabilities faced by job seekers and the need for stricter campus security.",
            "key_points": [
                "22-year-old woman raped on Jabalpur university campus by a clerk.",
                "Victim was lured with a fake job offer.",
                "Incident highlights vulnerability of job seekers and campus security needs."
            ]
        },
        {
            "headline": "Aligarh double murder: Hotel owner, neighbour found dead in rented car",
            "summary": "In Aligarh, a hotel owner and his neighbor were discovered dead in a rented car in a suspected double murder case. Authorities are investigating the circumstances surrounding their deaths, which have sent shockwaves through the local community.",
            "key_points": [
                "Hotel owner and neighbor found dead in a rented car in Aligarh.",
                "Incident is being investigated as a suspected double murder.",
                "The deaths have shocked the local community."
            ]
        },
        {
            "headline": "The bottlenecks still plaguing Mumbai-Goa national highway",
            "summary": "The Mumbai-Goa national highway continues to be hampered by persistent bottlenecks, leading to traffic congestion and delays for commuters. This ongoing issue highlights challenges in infrastructure development and maintenance, impacting travel and regional connectivity.",
            "key_points": [
                "Mumbai-Goa national highway suffers from persistent bottlenecks.",
                "Causes significant traffic congestion and delays for commuters.",
                "Highlights ongoing challenges in infrastructure development and maintenance."
            ]
        },
        {
            "headline": "Fear grips Hyderabad-Warangal highway: Burning car rolls towards petrol bunk; major disaster averted - watch video",
            "summary": "Panic spread on the Hyderabad-Warangal highway as a burning car rolled precariously towards a petrol bunk, narrowly averting a major disaster. Quick thinking and intervention prevented a potentially catastrophic explosion, highlighting the dangers of road incidents.",
            "key_points": [
                "Burning car rolled towards a petrol bunk on Hyderabad-Warangal highway.",
                "A major disaster was narrowly averted by quick intervention.",
                "The incident caused widespread fear and highlighted road dangers."
            ]
        },
        {
            "headline": "Madhya Pradesh: Seventh-graders stripped, made to stand outside over incomplete homework in Sehore",
            "summary": "In a shocking incident in Sehore, Madhya Pradesh, seventh-grade students were reportedly stripped and made to stand outside as punishment for incomplete homework. This act of humiliation and corporal punishment has sparked outrage and raises serious concerns about child rights in schools.",
            "key_points": [
                "Seventh-graders in Sehore stripped and made to stand outside for incomplete homework.",
                "Act of humiliation and corporal punishment sparked outrage.",
                "Raises serious concerns about child rights in schools."
            ]
        },
        {
            "headline": "'We are Canadian citizens, paid taxes': Fundraiser for Indian-origin man who died in Canada waiting at ER seeks justice",
            "summary": "A fundraiser is seeking justice for an Indian-origin man who tragically died in Canada while waiting at an ER, despite being a Canadian citizen and taxpayer. The incident highlights critical issues within the Canadian healthcare system and raises concerns about equitable access to emergency care.",
            "key_points": [
                "Indian-origin man died in Canada after waiting at ER despite being a citizen.",
                "Fundraiser seeks justice, highlighting critical healthcare system issues.",
                "Raises concerns about equitable access to emergency care."
            ]
        },
        {
            "headline": "Indian-origin student Manojh Lella arrested in Dallas for threatening family",
            "summary": "Indian-origin student Manojh Lella has been arrested in Dallas on charges of threatening his family. The incident brings to light domestic issues within the community and necessitates a legal investigation into the threats made.",
            "key_points": [
                "Indian-origin student Manojh Lella arrested in Dallas.",
                "Charged with threatening his family.",
                "Highlights domestic issues and prompts legal investigation."
            ]
        },
        {
            "headline": "Don't break our family: Indian-origin man in NZ shocked to learn his child could be deported",
            "summary": "An Indian-origin man in New Zealand is distressed after learning his child faces potential deportation, pleading with authorities not to \"break our family.\" The situation highlights the emotional and legal complexities of immigration policies affecting families.",
            "key_points": [
                "Indian-origin man in NZ shocked by potential deportation of his child.",
                "Pleads with authorities not to 'break our family'.",
                "Highlights emotional and legal complexities of immigration policies."
            ]
        },
        {
            "headline": "Husband charged with murder of Indian-origin wife in Adelaide; CPR could not save woman",
            "summary": "A husband has been charged with the murder of his Indian-origin wife in Adelaide, who could not be saved despite CPR efforts. The tragic incident is under police investigation, raising serious concerns about domestic violence and community safety.",
            "key_points": [
                "Husband charged with murder of Indian-origin wife in Adelaide.",
                "Victim could not be saved despite CPR efforts.",
                "Incident raises serious concerns about domestic violence."
            ]
        },
        {
            "headline": "Indian-origin woman found dead in Toronto; Camada-wide warrant issued for 32-year-old man",
            "summary": "An Indian-origin woman has been found dead in Toronto, leading to a Canada-wide warrant being issued for a 32-year-old man in connection with her death. The police are investigating the circumstances, treating it as a serious criminal matter.",
            "key_points": [
                "Indian-origin woman found dead in Toronto.",
                "Canada-wide warrant issued for a 32-year-old man.",
                "Police are investigating the death as a serious criminal matter."
            ]
        },
        {
            "headline": "Church scare in Singapore: Indian-origin man charged over threat; to sit for psychiatric test",
            "summary": "An Indian-origin man has been charged in Singapore for making threats that caused a church scare, and he is slated to undergo a psychiatric test. The incident prompted security concerns and is being addressed through legal and mental health channels.",
            "key_points": [
                "Indian-origin man charged in Singapore for making church threats.",
                "He is scheduled for a psychiatric test.",
                "Incident caused security concerns and is legally investigated."
            ]
        },
        {
            "headline": "'Fighting forest fires with garden hose': Canada physician says duty doctors should not be blamed for death of Indian-origin man",
            "summary": "A Canadian physician has stated that duty doctors should not be blamed for the death of an Indian-origin man, likening their resources to \"fighting forest fires with a garden hose.\" This commentary highlights systemic issues in the healthcare system, rather than individual culpability.",
            "key_points": [
                "Canadian physician defends duty doctors in Indian-origin man's death.",
                "Compares their resources to 'fighting forest fires with a garden hose'.",
                "Highlights systemic issues in the healthcare system over individual blame."
            ]
        },
        {
            "headline": "'Jail for maybe up to 3 years': Canadian journalist on murders of two Indians in Toronto within a week",
            "summary": "A Canadian journalist has commented on the recent murders of two Indians in Toronto within a week, suggesting potential jail terms of \"maybe up to 3 years\" for perpetrators. This reflects a critical view on justice outcomes and raises concerns within the Indian diaspora.",
            "key_points": [
                "Canadian journalist comments on murders of two Indians in Toronto.",
                "Suggests potential jail terms of 'maybe up to 3 years' for perpetrators.",
                "Raises concerns about justice outcomes for the Indian diaspora."
            ]
        },
        {
            "headline": "NRI visits home after 8 years; viralpost praises India’s growth and affordability",
            "summary": "An NRI returning to India after eight years shared a viral post praising the nation's significant growth and increased affordability. The post reflects a positive perception of India's development and improving living standards from an expatriate perspective.",
            "key_points": [
                "NRI's viral post praises India's growth and affordability after 8 years.",
                "Reflects positive perception of national development.",
                "Highlights improving living standards from an expatriate view."
            ]
        },
        {
            "headline": "He has a 3-year-old daughter: Indian-origin IT worker who sexually assaulted 17 women in Melbourne saved from deportation",
            "summary": "An Indian-origin IT worker, who sexually assaulted 17 women in Melbourne, has been spared deportation partly due to having a three-year-old daughter. The decision sparked debate on legal complexities, family ties, and justice in immigration matters.",
            "key_points": [
                "Indian-origin IT worker, who sexually assaulted 17 women, spared deportation.",
                "Decision partly due to him having a 3-year-old daughter.",
                "Sparked debate on legal complexities and immigration matters."
            ]
        },
        {
            "headline": "Bangladesh: Dhaka madrasa blast injures four",
            "summary": "A blast at a madrasa in Dhaka, Bangladesh, has resulted in injuries to four individuals. Authorities are investigating the incident to determine its cause and ascertain the extent of damage and casualties.",
            "key_points": [
                "Blast at a madrasa in Dhaka, Bangladesh, injures four people.",
                "Authorities are investigating the cause of the incident.",
                "The extent of damage and casualties is being ascertained."
            ]
        },
        {
            "headline": "BNP acting chairman Tarique Rahman enlists as Bangladesh voter",
            "summary": "Tarique Rahman, the acting chairman of BNP, has reportedly enlisted as a voter in Bangladesh, a move that could have significant political implications. His registration signals potential shifts in the country's political landscape.",
            "key_points": [
                "BNP acting chairman Tarique Rahman enlists as a Bangladesh voter.",
                "Move could have significant political implications.",
                "Signals potential shifts in the country's political landscape."
            ]
        },
        {
            "headline": "Russian Army Strikes Ukrainian Military-Linked Energy Facilities: MoD",
            "summary": "The Russian Ministry of Defense has reported that its army struck energy facilities in Ukraine linked to the military. These strikes are part of ongoing military operations, targeting critical infrastructure.",
            "key_points": [
                "Russian army struck Ukrainian military-linked energy facilities.",
                "Reported by the Russian Ministry of Defense.",
                "Strikes are part of ongoing military operations targeting critical infrastructure."
            ]
        },
        {
            "headline": "G20 Believes Organisation Incomplete Without South Africa - Russian Sherpa",
            "summary": "A Russian Sherpa has stated that the G20 considers the organization incomplete without South Africa's participation. This highlights the recognition of South Africa's importance and influence within global economic governance.",
            "key_points": [
                "Russian Sherpa states G20 is incomplete without South Africa.",
                "Highlights South Africa's importance to global economic governance.",
                "Emphasizes its influence within the organization."
            ]
        },
        {
            "headline": "Russian Air Defenses Shot Down Seven Ukrainian Drones:MoD",
            "summary": "Russia's Ministry of Defense announced that its air defenses successfully shot down seven Ukrainian drones. This report underscores the ongoing aerial engagements and defensive measures in the conflict zone.",
            "key_points": [
                "Russian air defenses shot down seven Ukrainian drones.",
                "Announced by Russia's Ministry of Defense.",
                "Underscores ongoing aerial engagements and defensive measures."
            ]
        },
        {
            "headline": "Thailand, Cambodia Agree to Resume Ceasefire",
            "summary": "Thailand and Cambodia have reached an agreement to resume a ceasefire, marking a positive step towards de-escalation of tensions between the two nations. This diplomatic breakthrough aims to restore stability and peace in their border region.",
            "key_points": [
                "Thailand and Cambodia agree to resume ceasefire.",
                "Marks a positive step towards de-escalation of tensions.",
                "Aims to restore stability and peace in the border region."
            ]
        },
        {
            "headline": "Russia’s High-Demand Arms Production Has Soared Since 2022: Putin",
            "summary": "Russian President Putin has announced a significant surge in Russia's high-demand arms production since 2022. This increase indicates a heightened focus on military manufacturing, likely driven by ongoing conflicts and strategic defense priorities.",
            "key_points": [
                "Russia's high-demand arms production soared since 2022, per Putin.",
                "Indicates heightened focus on military manufacturing.",
                "Driven by ongoing conflicts and strategic defense priorities."
            ]
        },
        {
            "headline": "Russia, US Commit to Ongoing Talks on Ukraine Settlement: Kremlin",
            "summary": "The Kremlin has confirmed that Russia and the United States are committed to ongoing talks regarding a settlement in Ukraine. This commitment suggests continued diplomatic efforts to address the conflict, despite persistent disagreements.",
            "key_points": [
                "Russia and US commit to ongoing talks on Ukraine settlement.",
                "Kremlin confirmed the commitment.",
                "Suggests continued diplomatic efforts despite disagreements."
            ]
        },
        {
            "headline": "Russia Asserts Contribution to Building a Just, Multipolar World in 2025",
            "summary": "Russia has asserted its commitment to contributing to the establishment of a just, multipolar world order in 2025. This statement reflects its diplomatic agenda and vision for global governance, emphasizing a shift away from unipolar dominance.",
            "key_points": [
                "Russia asserts commitment to building a just, multipolar world in 2025.",
                "Reflects its diplomatic agenda and global governance vision.",
                "Emphasizes a shift away from unipolar dominance."
            ]
        },
        {
            "headline": "Russian Army Takes Down 77 Ukrainian Drones Overnight: MoD",
            "summary": "Russia's Ministry of Defense announced that its army successfully intercepted and destroyed 77 Ukrainian drones overnight. This significant number highlights intensified drone warfare and ongoing defensive operations in the conflict.",
            "key_points": [
                "Russian army destroyed 77 Ukrainian drones overnight.",
                "Reported by the Ministry of Defense.",
                "Highlights intensified drone warfare and ongoing defensive operations."
            ]
        },
        {
            "headline": "US Carries Out Strikes on ISIS Targets in Northwest Nigeria: Trump",
            "summary": "Former President Trump announced that the US has conducted strikes against ISIS targets in Northwest Nigeria. This operation underscores ongoing global counter-terrorism efforts and the reach of US military action.",
            "key_points": [
                "US carried out strikes on ISIS targets in Northwest Nigeria.",
                "Announced by former President Trump.",
                "Underscores ongoing global counter-terrorism efforts."
            ]
        },
        {
            "headline": "US Investing Icon Hails Russia-Alaska Tunnel Plan as a ‘Wonderful’ Vision for the Future",
            "summary": "A prominent US investing icon has praised the Russia-Alaska tunnel plan, calling it a \"wonderful\" vision for future global connectivity and trade. This endorsement highlights the massive potential of cross-continental infrastructure projects to foster economic and geopolitical links.",
            "key_points": [
                "US investing icon praises Russia-Alaska tunnel plan.",
                "Calls it a 'wonderful' vision for future global connectivity.",
                "Highlights potential for economic and geopolitical links."
            ]
        },
        {
            "headline": "UN failing, BRICS outpacing G7: South Africa’s High Commissioner to India",
            "summary": "South Africa's High Commissioner to India has remarked on the UN's perceived failures and the BRICS bloc's growing influence, asserting it is outpacing the G7. This statement highlights a shift in global power dynamics and the rise of multilateral organizations from the Global South.",
            "key_points": [
                "South Africa's High Commissioner comments on UN failures.",
                "Asserts BRICS is outpacing the G7.",
                "Highlights a shift in global power dynamics."
            ]
        },
        {
            "headline": "‘Conflict Benefits No Side’: Taliban Seek Peace Amid Tensions With Pakistan",
            "summary": "The Taliban have expressed a desire for peace, stating that \"conflict benefits no side,\" amidst escalating tensions with Pakistan. This indicates a potential diplomatic overture to de-escalate hostilities and seek resolution through negotiation.",
            "key_points": [
                "Taliban seek peace, stating 'conflict benefits no side'.",
                "Comes amidst escalating tensions with Pakistan.",
                "Indicates potential diplomatic overture to de-escalate hostilities."
            ]
        },
        {
            "headline": "Russian Army Destroys 141 Ukrainian Drones Overnight: MoD",
            "summary": "The Russian Ministry of Defense reported its army destroyed 141 Ukrainian drones overnight, showcasing continued intense aerial combat in the conflict. This marks a significant number of interceptions, indicating heightened defensive operations.",
            "key_points": [
                "Russian army destroyed 141 Ukrainian drones overnight.",
                "Reported by the Ministry of Defense.",
                "Indicates intense aerial combat and heightened defensive operations."
            ]
        },
        {
            "headline": "Russian Army Takes Control of Andreyevka Settlement in Dnepropetrovsk Region",
            "summary": "The Russian army has reportedly taken control of the Andreyevka settlement in the Dnepropetrovsk region of Ukraine. This development signifies a strategic territorial gain in the ongoing conflict.",
            "key_points": [
                "Russian army takes control of Andreyevka settlement.",
                "Settlement is in Ukraine's Dnepropetrovsk region.",
                "Signifies a strategic territorial gain in the ongoing conflict."
            ]
        },
        {
            "headline": "France Dials Back Ukrainian Migrant Handouts: Reports",
            "summary": "Reports indicate that France is scaling back financial assistance and handouts to Ukrainian migrants, signaling a potential shift in its refugee policy. This move could have significant implications for displaced individuals seeking refuge in the country.",
            "key_points": [
                "France reportedly scaling back Ukrainian migrant handouts.",
                "Signals a potential shift in its refugee policy.",
                "Could have significant implications for displaced individuals."
            ]
        },
        {
            "headline": "Russian Air Defences Shoot Down 29 Ukrainian Drones: MoD",
            "summary": "Russia's Ministry of Defense announced that its air defenses successfully shot down 29 Ukrainian drones. This latest report highlights continuous aerial engagements and defensive actions in the conflict zone.",
            "key_points": [
                "Russian air defenses shot down 29 Ukrainian drones.",
                "Announced by the Ministry of Defense.",
                "Highlights continuous aerial engagements in the conflict zone."
            ]
        },
        {
            "headline": "US VP Announces 'Breakthrough' in Ukraine Talks After Russia-US Consultations",
            "summary": "The US Vice President has announced a \"breakthrough\" in Ukraine talks following consultations between Russia and the United States. This development signals progress in diplomatic efforts to address the conflict, potentially paving the way for further negotiations.",
            "key_points": [
                "US VP announces 'breakthrough' in Ukraine talks.",
                "Follows consultations between Russia and the United States.",
                "Signals progress in diplomatic efforts to address the conflict."
            ]
        },
        {
            "headline": "Criminal Case Opened in Moscow Over Murder of Senior Military Official: Russian Investigators",
            "summary": "Russian investigators have opened a criminal case in Moscow concerning the murder of a senior military official. The investigation is underway to determine the circumstances and perpetrators of this high-profile assassination.",
            "key_points": [
                "Criminal case opened in Moscow over murder of senior military official.",
                "Russian investigators are probing the assassination.",
                "Investigation seeks to determine circumstances and perpetrators."
            ]
        },
        {
            "headline": "Russia's Presidential Envoy Dmitriev Leaves Miami After Series of Ukrainian Settlement Talks With US",
            "summary": "Russia's Presidential Envoy Dmitriev has departed Miami following a series of talks with the US aimed at a Ukrainian settlement. His departure signals the conclusion of a diplomatic round, with outcomes and future steps yet to be fully revealed.",
            "key_points": [
                "Russia's Presidential Envoy Dmitriev leaves Miami after Ukraine settlement talks.",
                "Followed a series of talks with the US.",
                "Signals conclusion of a diplomatic round."
            ]
        },
        {
            "headline": "Russia Raised Issue of Frozen Assets at G20 Meeting in US: Sherpa",
            "summary": "Russia's Sherpa confirmed that Russia brought up the issue of its frozen assets during a G20 meeting held in the US. This highlights ongoing international financial disputes and Russia's persistent efforts to reclaim its seized funds.",
            "key_points": [
                "Russia raised issue of frozen assets at G20 meeting in US.",
                "Confirmed by Russia's Sherpa.",
                "Highlights ongoing international financial disputes and efforts to reclaim funds."
            ]
        },
        {
            "headline": "Ukrainian Attacks on Zaporozhye NPP Could Lead to Accident - Director",
            "summary": "The director of the Zaporozhye Nuclear Power Plant has warned that Ukrainian attacks on the facility could lead to a severe accident. This grave warning underscores the critical dangers of military actions near nuclear installations and the potential for a catastrophic disaster.",
            "key_points": [
                "Zaporozhye NPP director warns of potential accident due to Ukrainian attacks.",
                "Underscores critical dangers of military actions near nuclear installations.",
                "Highlights potential for a catastrophic disaster."
            ]
        },
        {
            "headline": "Russian Defense Ministry Says 27 Ukrainian Drones Shot Down",
            "summary": "The Russian Defense Ministry reported that 27 Ukrainian drones were successfully shot down, continuing the pattern of aerial interceptions in the conflict. This regular update reflects ongoing defensive efforts against drone incursions.",
            "key_points": [
                "Russian Defense Ministry reports 27 Ukrainian drones shot down.",
                "Continues the pattern of aerial interceptions in the conflict.",
                "Reflects ongoing defensive efforts against drone incursions."
            ]
        },
        {
            "headline": "Seizure of Russian Assets in EU Will Accelerate ‘De-Euroisation’: BJP Politician",
            "summary": "A BJP politician has commented that the seizure of Russian assets by the EU will accelerate a process of \"de-Euroisation.\" This perspective suggests that such actions will push countries away from using the Euro, impacting global financial systems.",
            "key_points": [
                "BJP politician states EU's seizure of Russian assets will accelerate 'de-Euroisation'.",
                "Suggests countries will move away from using the Euro.",
                "Impacts global financial systems."
            ]
        },
        {
            "headline": "Putin: Ukraine Essentially Refusing to End Conflict by Peaceful Means",
            "summary": "Russian President Putin has accused Ukraine of effectively refusing to end the ongoing conflict through peaceful means. This statement places the blame for continued hostilities on Ukraine's stance, signaling a hardened position from Moscow.",
            "key_points": [
                "Putin accuses Ukraine of refusing peaceful conflict resolution.",
                "Statement places blame for continued hostilities on Ukraine's stance.",
                "Signals a hardened position from Moscow."
            ]
        },
        {
            "headline": "Russian Air Defences Shoot Down 94 Ukrainian Drones: MoD",
            "summary": "The Russian Ministry of Defense reported that its air defenses successfully shot down 94 Ukrainian drones. This high number indicates a sustained level of drone activity and effective interception capabilities by Russian forces.",
            "key_points": [
                "Russian air defenses shot down 94 Ukrainian drones.",
                "Reported by the Ministry of Defense.",
                "Indicates sustained drone activity and effective interception capabilities."
            ]
        }
    ],
    "Business": [
        {
            "headline": "Bigger payouts ahead: The Trump tax reforms you need to know for 2026 refunds",
            "summary": "Upcoming Trump tax reforms are anticipated to lead to bigger payouts for 2026 refunds, prompting individuals and businesses to understand the changes. The article explains key aspects of these reforms that could impact financial planning and tax returns.",
            "key_points": [
                "Trump tax reforms are expected to lead to bigger 2026 refunds.",
                "Individuals and businesses need to understand the changes.",
                "Explains key aspects impacting financial planning and tax returns."
            ]
        },
        {
            "headline": "‘Hire an American’: MAGA mocks as H-1B visa holders stranded by stamping delays",
            "summary": "H-1B visa holders are facing distress due to stamping delays, a situation that has prompted \"MAGA\" supporters to mock with \"Hire an American\" chants. This highlights ongoing debates on immigration policies and their impact on foreign workers in the US.",
            "key_points": [
                "H-1B visa holders face distress due to stamping delays.",
                "'MAGA' supporters mock the situation with 'Hire an American' chants.",
                "Highlights debates on immigration policies and impact on foreign workers."
            ]
        },
        {
            "headline": "Chilean firms partner to form giant company to exploit lithium",
            "summary": "Chilean companies have partnered to establish a massive new enterprise focused on lithium exploitation, aiming to capitalize on the soaring demand for the critical battery metal. This collaboration is set to significantly impact the global lithium supply chain and Chile's economic landscape.",
            "key_points": [
                "Chilean firms partner to form a giant lithium exploitation company.",
                "Aims to capitalize on soaring demand for the critical battery metal.",
                "Set to impact global lithium supply and Chile's economy."
            ]
        },
        {
            "headline": "China industries' profits stumble: Profits in November fall 13.1%; biggest decline in over a year",
            "summary": "Chinese industrial profits experienced a significant stumble in November, falling by 13.1%, marking the biggest decline in over a year. This downturn signals potential economic headwinds for China's industrial sector and broader economic stability.",
            "key_points": [
                "Chinese industrial profits fell by 13.1% in November.",
                "Marks the biggest decline in over a year.",
                "Signals potential economic headwinds for China."
            ]
        },
        {
            "headline": "Silver at record highs! Futures price hits Rs 2.42 lakh per kg; driven by possible global supply chain hit and Fed rate-cut expectations",
            "summary": "Silver futures prices have surged to record highs, reaching Rs 2.42 lakh per kilogram, propelled by expectations of global supply chain disruptions and anticipated Fed rate cuts. This bullish trend reflects strong investor confidence in the precious metal as a hedge against economic uncertainties.",
            "key_points": [
                "Silver futures price hits record highs, Rs 2.42 lakh per kg.",
                "Driven by global supply chain hit expectations and Fed rate cuts.",
                "Reflects strong investor confidence in the precious metal."
            ]
        },
        {
            "headline": "Zepto kicks off IPO process: E-commerce startup files draft papers with Sebi: Rs 11,000 crore issue planned for next year",
            "summary": "E-commerce startup Zepto has initiated its IPO process, filing draft papers with SEBI for a planned Rs 11,000 crore issue next year. This marks a significant step for the quick commerce firm, aiming to raise substantial capital and go public.",
            "key_points": [
                "E-commerce startup Zepto kicks off IPO process.",
                "Files draft papers with SEBI for Rs 11,000 crore issue.",
                "IPO is planned for next year, marking a significant step."
            ]
        },
        {
            "headline": "Wall Street outlook for year-end: US stocks eye strong close amid 2025's record highs; focus shifts beyond big tech",
            "summary": "Wall Street is anticipating a strong year-end close for US stocks, building on 2025's record highs, with investor focus now broadening beyond just big tech companies. This shift indicates a more diversified market interest and potential for broader growth sectors.",
            "key_points": [
                "Wall Street anticipates a strong year-end close for US stocks.",
                "Building on 2025's record highs.",
                "Investor focus is shifting beyond big tech companies."
            ]
        },
        {
            "headline": "India must allow insolvency and bankruptcy to build dynamic, risk-taking economy: PM's Economic Advisory Council member Sanjeev Sanyal",
            "summary": "Sanjeev Sanyal, a member of the PM's Economic Advisory Council, asserts that India must embrace robust insolvency and bankruptcy mechanisms to foster a dynamic, risk-taking economy. This approach is crucial for promoting efficient capital allocation and encouraging entrepreneurial ventures.",
            "key_points": [
                "Sanjeev Sanyal advocates for India to embrace insolvency and bankruptcy.",
                "Believes it will build a dynamic, risk-taking economy.",
                "Crucial for efficient capital allocation and entrepreneurial ventures."
            ]
        },
        {
            "headline": "Meet Jayshree Ullal: Indian-origin billionaire at the top of Hurun's rich list",
            "summary": "Jayshree Ullal, an Indian-origin billionaire, has topped Hurun's rich list, highlighting her significant achievements in the business world. Her success story serves as an inspiration and underscores the growing influence of Indian diaspora in global commerce.",
            "key_points": [
                "Jayshree Ullal, Indian-origin billionaire, tops Hurun's rich list.",
                "Highlights her significant achievements in the business world.",
                "Underscores the growing influence of the Indian diaspora in global commerce."
            ]
        },
        {
            "headline": "Air India Express fleet expansion: First line-fit Boeing 737-8 MAX arrives in Capital Monday; marks Tata-era milestone",
            "summary": "Air India Express is expanding its fleet, with the first line-fit Boeing 737-8 MAX aircraft arriving in the Capital on Monday, marking a significant milestone in the Tata-era. This addition boosts the airline's capacity and modernization efforts.",
            "key_points": [
                "Air India Express is expanding its fleet with a Boeing 737-8 MAX.",
                "First line-fit aircraft arrives Monday, marking a Tata-era milestone.",
                "Boosts the airline's capacity and modernization efforts."
            ]
        },
        {
            "headline": "How India's economy defied odds in 2025 — but external shocks left a mark",
            "summary": "India's economy demonstrated remarkable resilience in 2025, defying various challenges, yet it was not immune to the impact of external shocks. The article explores the strategies adopted and the lingering effects of global economic uncertainties on India's growth trajectory.",
            "key_points": [
                "India's economy showed remarkable resilience in 2025.",
                "Despite defying odds, it was impacted by external shocks.",
                "Article explores growth strategies and effects of global uncertainties."
            ]
        },
        {
            "headline": "Record FII Withdrawal: FIIs pull out Rs 1.58 lakh cr; rupee hit, outlook brighter for 2026",
            "summary": "Foreign Institutional Investors (FIIs) have recorded a massive withdrawal of Rs 1.58 lakh crore, impacting the Indian rupee, though the outlook for 2026 appears brighter. This significant outflow highlights investor sentiment and its immediate effects on the currency market.",
            "key_points": [
                "FIIs recorded a massive withdrawal of Rs 1.58 lakh crore.",
                "The withdrawal impacted the Indian rupee.",
                "Outlook for 2026 is predicted to be brighter despite the outflow."
            ]
        },
        {
            "headline": "Star Air announces new year sale with fares from Rs 1,799",
            "summary": "Star Air has announced a New Year sale, offering flight fares starting from an attractive Rs 1,799. This promotional offer aims to stimulate travel demand and provide affordable options for passengers during the festive season.",
            "key_points": [
                "Star Air announces New Year sale with fares from Rs 1,799.",
                "Promotional offer aims to stimulate travel demand.",
                "Provides affordable travel options during the festive season."
            ]
        },
        {
            "headline": "China Begins Rare-Earth Magnet Exports to India: Report",
            "summary": "A report indicates that China has commenced exporting rare-earth magnets to India, marking a significant development in trade relations and critical mineral supply chains. This move could impact India's manufacturing and technological sectors, reducing dependence on other sources.",
            "key_points": [
                "China begins rare-earth magnet exports to India.",
                "Significant development in trade relations and critical mineral supply.",
                "Could impact India's manufacturing and technology sectors."
            ]
        },
        {
            "headline": "Ruble Roars Past the ‘Weaponized’ Dollar as Russia’s Stewardship Wins Global Confidence",
            "summary": "The Russian Ruble has reportedly gained strength against the US Dollar, characterized as \"weaponized,\" signaling Russia's growing economic stewardship and increasing global confidence. This narrative suggests a shift in financial power dynamics amidst geopolitical tensions.",
            "key_points": [
                "Russian Ruble gains strength against the 'weaponized' US Dollar.",
                "Signifies Russia's growing economic stewardship.",
                "Suggests increasing global confidence in Russia's economy."
            ]
        },
        {
            "headline": "Asia-Pacific Drives Almost 60% of Russia’s International Trade: Kremlin",
            "summary": "The Kremlin has reported that the Asia-Pacific region accounts for nearly 60% of Russia's international trade, indicating a significant strategic reorientation of its economic partnerships. This highlights the growing importance of Asian markets for Russia's economy.",
            "key_points": [
                "Asia-Pacific drives almost 60% of Russia’s international trade.",
                "Indicates a significant strategic reorientation of economic partnerships.",
                "Highlights the growing importance of Asian markets for Russia."
            ]
        },
        {
            "headline": "Russian Economic Growth Outpaces Eurozone by Three Times: Kremlin Aide",
            "summary": "A Kremlin aide has claimed that Russian economic growth is outpacing that of the Eurozone by three times, signaling a strong performance amidst international sanctions. This assertion, if verified, suggests resilience in the Russian economy despite external pressures.",
            "key_points": [
                "Kremlin aide claims Russian economic growth triple that of Eurozone.",
                "Signals strong performance amidst international sanctions.",
                "Suggests resilience in the Russian economy despite external pressures."
            ]
        }
    ],
    "Technology": [
        {
            "headline": "Why India’s betting on new tactic against digital arrest",
            "summary": "India is reportedly developing and deploying new tactics to counter the growing threat of \"digital arrest,\" a sophisticated form of cybercrime. This strategic shift aims to protect citizens from online scams and enhance national cybersecurity measures.",
            "key_points": [
                "India is adopting new tactics against 'digital arrest' cybercrime.",
                "Aims to protect citizens from online scams.",
                "Enhances national cybersecurity measures."
            ]
        },
        {
            "headline": "Big Tech already dominates our digital lives. This will only intensify with AI",
            "summary": "The pervasive influence of Big Tech in our digital lives is set to grow even stronger with the advancement of Artificial Intelligence. This article examines how AI will further consolidate the power of major tech companies, shaping future interactions and societal structures.",
            "key_points": [
                "Big Tech's dominance in digital lives is intensifying with AI.",
                "AI will further consolidate the power of major tech companies.",
                "Examines how AI will shape future interactions and societal structures."
            ]
        },
        {
            "headline": "700 kmph in 2 seconds: China sets world record with high-speed maglev train - watch video",
            "summary": "China has set a new world record by achieving 700 kmph in just 2 seconds with its high-speed maglev train, showcasing a significant leap in rail technology. This innovation promises to revolutionize transportation, offering ultra-fast and efficient travel solutions.",
            "key_points": [
                "China sets world record with high-speed maglev train, reaching 700 kmph in 2 seconds.",
                "Showcases a significant leap in rail technology.",
                "Innovation promises ultra-fast and efficient travel solutions."
            ]
        },
        {
            "headline": "India Gears Up for Chip Independence and Global Push: Amit Shah",
            "summary": "Union Minister Amit Shah stated that India is actively preparing for chip independence and aiming for a significant global push in semiconductor manufacturing. This strategic initiative is crucial for bolstering national technology sovereignty and economic growth.",
            "key_points": [
                "India gears up for chip independence and global push, says Amit Shah.",
                "Focuses on semiconductor manufacturing.",
                "Crucial for national technology sovereignty and economic growth."
            ]
        },
        {
            "headline": "China wants human-like AI systems to have socialist values",
            "summary": "China has articulated a policy wherein it expects human-like AI systems to be imbued with socialist values, aiming to align technological development with state ideology. This directive underscores Beijing's efforts to control AI's ethical and societal implications.",
            "key_points": [
                "China mandates human-like AI systems to have socialist values.",
                "Aims to align technological development with state ideology.",
                "Underscores Beijing's efforts to control AI's ethical and societal implications."
            ]
        }
    ],
    "Entertainment": [
        {
            "headline": "‘Dhurandhar’ collection day 23: Ranveer Singh starrer crosses Rs 1025cr mark worldwide",
            "summary": "Ranveer Singh's film ‘Dhurandhar’ has achieved a massive box office milestone, crossing the Rs 1025 crore mark worldwide on its 23rd day. This success solidifies its position as a global blockbuster, indicating strong audience reception and widespread appeal.",
            "key_points": [
                "Ranveer Singh's 'Dhurandhar' crosses Rs 1025 crore worldwide.",
                "Achieved the milestone on its 23rd day.",
                "Solidifies its position as a global blockbuster."
            ]
        },
        {
            "headline": "Priyanka Chopra's daughter Malti Marie's pure joy on seeing her footprints in the snow spreads holiday cheer like no other - Watch",
            "summary": "Priyanka Chopra's daughter, Malti Marie, brought immense holiday cheer with her pure joy upon seeing her footprints in the snow. A heartwarming video captured her delightful reaction, quickly spreading positive vibes and capturing the essence of innocent festive happiness.",
            "key_points": [
                "Malti Marie, Priyanka Chopra's daughter, shows pure joy in the snow.",
                "Her reaction to seeing footprints spreads holiday cheer.",
                "The heartwarming moment captured in a viral video."
            ]
        },
        {
            "headline": "Stranger Things Season 5 Volume 2: The ultimate finale or a disappointing end?",
            "summary": "Anticipation is high for \"Stranger Things Season 5 Volume 2,\" with fans debating whether it will deliver an ultimate finale or a disappointing conclusion. The final installment is expected to resolve ongoing storylines and character arcs that have captivated audiences for years.",
            "key_points": [
                "High anticipation for 'Stranger Things Season 5 Volume 2'.",
                "Fans debate if it will be an ultimate finale or disappointing.",
                "Expected to resolve long-standing storylines and character arcs."
            ]
        },
        {
            "headline": "K Shekhar passes away: Created anti gravity room in THIS 3D film",
            "summary": "Veteran art director K Shekhar, known for creating the iconic anti-gravity room in a pioneering 3D film, has passed away. His contributions to visual effects significantly impacted the entertainment industry, leaving a lasting legacy.",
            "key_points": [
                "Veteran art director K Shekhar has passed away.",
                "Known for creating the anti-gravity room in a 3D film.",
                "His work significantly impacted the entertainment industry."
            ]
        },
        {
            "headline": "KBC 17: Big B recites his late father's iconic Madhushala; Ranveer gets emotional",
            "summary": "On KBC 17, Amitabh Bachchan emotionally recited his late father's iconic \"Madhushala,\" moving Ranveer Singh to tears. The poignant moment highlighted the deep cultural impact of Harivansh Rai Bachchan's work and the emotional connection it evokes.",
            "key_points": [
                "Amitabh Bachchan recited his father's 'Madhushala' on KBC 17.",
                "Ranveer Singh became emotional during the recitation.",
                "Moment highlighted cultural impact and emotional connection of the work."
            ]
        },
        {
            "headline": "Jamie Lever issues new statement after backlash; announces break",
            "summary": "Jamie Lever has released a new statement following recent backlash, during which she also announced a break from her work. The statement likely addresses the reasons behind the criticism and her decision to step away temporarily.",
            "key_points": [
                "Jamie Lever issues new statement after facing backlash.",
                "Announces she will be taking a break from work.",
                "Statement likely addresses reasons for criticism and her decision."
            ]
        },
        {
            "headline": "Docuseries Release: Swift reads Kelce’s emotional letter; fans celebrate viral moment",
            "summary": "A new docuseries features Taylor Swift reading an emotional letter from Travis Kelce, creating a viral moment that fans are celebrating. The personal revelation offers a glimpse into their relationship, delighting supporters worldwide.",
            "key_points": [
                "Docuseries shows Taylor Swift reading emotional letter from Travis Kelce.",
                "Moment becomes viral, celebrated by fans.",
                "Offers a personal glimpse into their relationship."
            ]
        },
        {
            "headline": "Pushpa 2 stampede case: Allu Arjun charged with abetment; actor among 23 named in chargesheet",
            "summary": "Actor Allu Arjun has been charged with abetment in the \"Pushpa 2\" stampede case, with his name included among 23 individuals in the chargesheet. This development adds a legal dimension to the tragic incident, placing the actor under scrutiny.",
            "key_points": [
                "Allu Arjun charged with abetment in 'Pushpa 2' stampede case.",
                "Actor among 23 named in the chargesheet.",
                "Adds a legal dimension to the tragic incident."
            ]
        },
        {
            "headline": "‘I got a banana!’ Toddler’s Christmas joy breaks the internet",
            "summary": "A toddler's unadulterated joy over receiving a banana for Christmas has gone viral, captivating the internet with its heartwarming simplicity. The video highlights innocent happiness and the unexpected delights of childhood.",
            "key_points": [
                "Toddler's joy over a Christmas banana goes viral.",
                "Captivates the internet with its heartwarming simplicity.",
                "Highlights innocent happiness and unexpected childhood delights."
            ]
        },
        {
            "headline": "Battling adult acne? Jacqueline Fernandez says THIS diet change changed her skin",
            "summary": "Actress Jacqueline Fernandez has shared a specific diet change that she credits with transforming her skin and helping her battle adult acne. Her personal endorsement provides a celebrity perspective on managing a common skin concern.",
            "key_points": [
                "Jacqueline Fernandez shares a diet change that transformed her skin.",
                "Credits it with helping battle adult acne.",
                "Provides a celebrity perspective on managing a common skin concern."
            ]
        },
        {
            "headline": "Sonu Nigam pays soulful tribute to Mohammed Rafi; Legendary songs fill the night; Singer calls Rafi his peer",
            "summary": "Sonu Nigam paid a soulful and heartfelt tribute to the legendary Mohammed Rafi, performing his iconic songs that captivated the audience. Nigam also humbly referred to Rafi as his \"peer,\" highlighting the profound influence Rafi had on him and the music industry.",
            "key_points": [
                "Sonu Nigam pays soulful tribute to legendary Mohammed Rafi.",
                "Performed iconic songs, captivating the audience.",
                "Nigam humbly referred to Rafi as his 'peer'."
            ]
        }
    ],
    "Sports": [
        {
            "headline": "'If God granted me a wish': Ex-cricketer makes emotional plea for Kohli's Test return",
            "summary": "An unnamed former cricketer has expressed an emotional wish for Virat Kohli's return to Test cricket, hoping for divine intervention to make it happen. This highlights the enduring desire among fans and experts to see the star player back in the long format.",
            "key_points": [
                "Ex-cricketer makes emotional plea for Virat Kohli's Test return.",
                "Highlights enduring desire among fans and experts.",
                "Wishes for divine intervention to make it happen."
            ]
        },
        {
            "headline": "Emotional night at Arrowhead as Travis Kelce plays potential final home game in Chiefs’ loss to Broncos",
            "summary": "It was an emotional night at Arrowhead Stadium as Travis Kelce potentially played his final home game for the Chiefs, which ended in a loss to the Broncos. The atmosphere was charged with reflection on his career and the team's performance.",
            "key_points": [
                "Travis Kelce plays potential final home game for Chiefs.",
                "Game ends in Chiefs' loss to Broncos.",
                "Emotional night at Arrowhead Stadium reflecting on his career."
            ]
        },
        {
            "headline": "Kyle Whittingham Emerges as Top Candidate as Michigan HC Search Nears Decision",
            "summary": "Kyle Whittingham has reportedly emerged as a leading candidate in Michigan's head coach search as the decision-making process nears its conclusion. His strong track record makes him a prominent contender for the prestigious position.",
            "key_points": [
                "Kyle Whittingham emerges as top candidate for Michigan HC.",
                "Head coach search is nearing a decision.",
                "His strong track record makes him a prominent contender."
            ]
        },
        {
            "headline": "Nikola Jokic’s record night powers Nuggets to overtime win over Timberwolves",
            "summary": "Nikola Jokic delivered a record-breaking performance, leading the Nuggets to an overtime victory against the Timberwolves. His exceptional play was instrumental in securing the crucial win for his team.",
            "key_points": [
                "Nikola Jokic had a record-breaking night for the Nuggets.",
                "Powered his team to an overtime win over the Timberwolves.",
                "His exceptional play was instrumental in securing the victory."
            ]
        },
        {
            "headline": "Stunning prediction! 'Shreyas Iyer can captain India to a World Cup win'",
            "summary": "A bold prediction suggests that Shreyas Iyer has the potential to captain India to a World Cup victory, highlighting his leadership qualities and cricketing prowess. This statement sparks debate among fans about future captaincy roles and team prospects.",
            "key_points": [
                "Stunning prediction claims Shreyas Iyer can captain India to World Cup win.",
                "Highlights his leadership qualities and cricketing prowess.",
                "Sparks debate about future captaincy roles and team prospects."
            ]
        },
        {
            "headline": "From Clarke to Yuvraj: Cricketers who battled cancer with courage",
            "summary": "The article highlights inspirational stories of cricketers, including Michael Clarke and Yuvraj Singh, who bravely fought and overcame cancer. Their journeys showcase remarkable courage and resilience, serving as a powerful testament to their spirit beyond the cricket field.",
            "key_points": [
                "Highlights cricketers like Michael Clarke and Yuvraj Singh battling cancer.",
                "Showcases their remarkable courage and resilience.",
                "Serves as a testament to their spirit beyond cricket."
            ]
        },
        {
            "headline": "201 wickets, one favourite: Tendulkar's pick will surprise you",
            "summary": "Sachin Tendulkar has revealed his favorite among the 201 wickets he has taken, a choice that promises to surprise many cricket enthusiasts. This personal insight offers a unique glimpse into the legendary batsman's memorable moments on the field.",
            "key_points": [
                "Sachin Tendulkar reveals his favorite among 201 wickets.",
                "His choice is expected to surprise many cricket enthusiasts.",
                "Offers a unique glimpse into the legendary batsman's memorable moments."
            ]
        },
        {
            "headline": "Asia Cup 2025: Indian-origin Jatinder Singh to led Oman",
            "summary": "Indian-origin cricketer Jatinder Singh has been appointed to lead Oman in the Asia Cup 2025, a significant achievement for both him and the team. His leadership is expected to bring a new dynamic to Oman's performance in the tournament.",
            "key_points": [
                "Indian-origin Jatinder Singh to lead Oman in Asia Cup 2025.",
                "Significant achievement for him and the team.",
                "His leadership is expected to bring a new dynamic to Oman's performance."
            ]
        },
        {
            "headline": "Diamond League Final: Neeraj Chopra's event preview, time and live telecast in India",
            "summary": "This article provides a comprehensive preview of Neeraj Chopra's event at the Diamond League Final, including event timings and live telecast details for Indian viewers. Fans can find all necessary information to follow the star javelin thrower's performance.",
            "key_points": [
                "Preview of Neeraj Chopra's event at Diamond League Final.",
                "Includes event timings and live telecast details for India.",
                "Provides all necessary information for fans to follow his performance."
            ]
        },
        {
            "headline": "FIDE WC in India: PM Modi says 'Chess is gaining popularity among our youth'",
            "summary": "Ahead of the FIDE World Cup in India, PM Modi highlighted that chess is experiencing a surge in popularity among Indian youth. His statement underscores the growing interest in the sport and its potential for fostering intellectual development nationwide.",
            "key_points": [
                "PM Modi states chess gaining popularity among Indian youth.",
                "Statement made ahead of FIDE World Cup in India.",
                "Underscores growing interest and intellectual development potential."
            ]
        },
        {
            "headline": "Gully To Glory: Ramandeep Singh's journey from Chandigarh to Team India via KKR",
            "summary": "The article traces Ramandeep Singh's inspiring journey from local cricket in Chandigarh through Kolkata Knight Riders (KKR) to finally reaching Team India. His path from \"Gully to Glory\" exemplifies dedication and perseverance in achieving cricketing dreams.",
            "key_points": [
                "Ramandeep Singh's journey from Chandigarh to Team India highlighted.",
                "His path involved playing for Kolkata Knight Riders (KKR).",
                "Exemplifies dedication and perseverance in achieving cricketing dreams."
            ]
        },
        {
            "headline": "Jos Buttler Exclusive Interview: I owe Jayawardene for letting me open in T20",
            "summary": "In an exclusive interview, Jos Buttler credits Mahela Jayawardene for his success as a T20 opener, acknowledging the pivotal role Jayawardene played in his career. This insight reveals the influence of mentorship in professional sports.",
            "key_points": [
                "Jos Buttler credits Mahela Jayawardene for his T20 opening success.",
                "Highlights Jayawardene's pivotal role in his career.",
                "Reveals the significant influence of mentorship in professional sports."
            ]
        },
        {
            "headline": "'We can't forget Pahalgam': Sehwag under fire for promoting IND vs PAK",
            "summary": "Virender Sehwag is facing criticism for promoting an India vs Pakistan cricket match, with detractors invoking \"Pahalgam\" to highlight unresolved issues. The controversy underscores the sensitive intersection of sports and national sentiment.",
            "key_points": [
                "Virender Sehwag criticized for promoting India vs Pakistan match.",
                "Detractors invoke 'Pahalgam' to highlight unresolved issues.",
                "Controversy highlights sensitive intersection of sports and national sentiment."
            ]
        },
        {
            "headline": "Sehwag junior arrives! Aaryavir Sehwag smashes boundaries for fun",
            "summary": "Aaryavir Sehwag, son of legendary cricketer Virender Sehwag, is making headlines for his boundary-hitting prowess, suggesting he's following in his father's footsteps. His early performance is generating excitement among cricket fans.",
            "key_points": [
                "Aaryavir Sehwag, Virender Sehwag's son, makes headlines.",
                "Noted for his boundary-hitting prowess.",
                "Generating excitement among cricket fans, following his father's footsteps."
            ]
        },
        {
            "headline": "'Two reasons': Why was Dhoni promoted over Yuvraj? Sachin breaks silence",
            "summary": "Sachin Tendulkar has finally revealed the \"two reasons\" behind MS Dhoni's promotion over Yuvraj Singh in a crucial match, breaking his long silence on the matter. His explanation provides key insights into a historic cricketing decision.",
            "key_points": [
                "Sachin Tendulkar reveals 'two reasons' for Dhoni's promotion over Yuvraj.",
                "Breaks long silence on the crucial cricketing decision.",
                "Provides key insights into a historic moment."
            ]
        },
        {
            "headline": "Hanuma Vihari joins Tripura after leaving Andhra Pradesh",
            "summary": "Cricketer Hanuma Vihari has made a significant move, joining the Tripura team after departing from Andhra Pradesh. This transfer marks a new chapter in his domestic career, with expectations for his performance in his new team.",
            "key_points": [
                "Cricketer Hanuma Vihari joins Tripura team.",
                "Moved after leaving Andhra Pradesh.",
                "Marks a new chapter in his domestic career."
            ]
        },
        {
            "headline": "'I have to go back again ... ': Rohit Sharma opens up",
            "summary": "Rohit Sharma has opened up about a personal struggle, stating \"I have to go back again...\", hinting at a challenge he needs to address. His candid admission provides a rare glimpse into the mental fortitude required at the elite level of sport.",
            "key_points": [
                "Rohit Sharma opens up about a personal struggle.",
                "Hints at a challenge he needs to address with 'I have to go back again...'.",
                "Provides a rare glimpse into the mental fortitude of elite athletes."
            ]
        },
        {
            "headline": "'GSL not in competition with other T20 leagues but a partnership': Guyana President",
            "summary": "The President of Guyana stated that the Guyana Super League (GSL) views itself as a \"partnership\" rather than a competitor to other T20 leagues. This position highlights a collaborative approach in the global cricket landscape, aiming for mutual growth.",
            "key_points": [
                "Guyana President states GSL is a 'partnership', not competitor.",
                "Refers to its relationship with other T20 leagues.",
                "Highlights a collaborative approach in global cricket."
            ]
        },
        {
            "headline": "Sarfaraz on fire! Back-to-back tons send strong message to selectors",
            "summary": "Sarfaraz Khan has delivered stellar performances with back-to-back centuries, sending a powerful message to national selectors. His consistent form is building a strong case for inclusion in higher-level teams, sparking renewed calls from fans and experts alike.",
            "key_points": [
                "Sarfaraz Khan scores back-to-back centuries.",
                "Sends a strong message to national selectors.",
                "Building a strong case for inclusion in higher-level teams."
            ]
        },
        {
            "headline": "KCL thriller: Samson smashes century, but Muhammad steals show – Watch",
            "summary": "In a thrilling KCL match, Sanju Samson's century was overshadowed by Muhammad's show-stealing performance, creating an unforgettable contest. Despite Samson's brilliance, Muhammad's impact turned the tide and captivated the audience.",
            "key_points": [
                "Sanju Samson smashes a century in KCL thriller.",
                "Muhammad's performance steals the show despite Samson's century.",
                "The match was an unforgettable contest."
            ]
        }
    ],
    "Science": [
        {
            "headline": "New study discovers ‘fat switch’ in body that can turn off weight gain, cholesterol, liver issues",
            "summary": "A groundbreaking new study has identified a \"fat switch\" within the human body that could potentially control weight gain, cholesterol levels, and liver issues. This discovery offers promising avenues for developing novel treatments for obesity and metabolic disorders.",
            "key_points": [
                "New study discovers a 'fat switch' in the body.",
                "Potentially controls weight gain, cholesterol, and liver issues.",
                "Offers promising avenues for treating obesity and metabolic disorders."
            ]
        },
        {
            "headline": "7 strange but real things your body does in near-death experiences",
            "summary": "The article delves into seven strange yet real physiological phenomena that occur during near-death experiences, offering insights into the body's extraordinary responses to extreme situations. These fascinating observations shed light on the complex interplay between mind and body.",
            "key_points": [
                "Explores seven strange physiological phenomena in near-death experiences.",
                "Offers insights into the body's extraordinary responses to extreme situations.",
                "Sheds light on the complex interplay between mind and body."
            ]
        },
        {
            "headline": "Broken tail bones may hold the clearest evidence of dinosaur mating",
            "summary": "Scientists suggest that broken tail bones in dinosaur fossils could provide the most definitive evidence yet of dinosaur mating behavior. This unique interpretation of fossilized remains offers new insights into the reproductive lives of these prehistoric creatures.",
            "key_points": [
                "Broken tail bones in dinosaur fossils may show mating evidence.",
                "Could be the clearest evidence yet of dinosaur mating behavior.",
                "Offers new insights into prehistoric reproductive lives."
            ]
        },
        {
            "headline": "How a fossil find in Gujarat could redefine the largest snake ever",
            "summary": "A recent fossil discovery in Gujarat has the potential to redefine our understanding of the largest snake ever to have lived. This significant paleontological find could necessitate a revision of existing records and provide new insights into ancient reptilian life.",
            "key_points": [
                "Fossil find in Gujarat could redefine the largest snake ever.",
                "Significant paleontological discovery.",
                "May lead to new insights into ancient reptilian life."
            ]
        },
        {
            "headline": "Russian Soyuz-2.1a Launches from Plesetsk: MoD",
            "summary": "The Russian Ministry of Defense announced the successful launch of a Soyuz-2.1a rocket from the Plesetsk Cosmodrome. This launch, likely for military or scientific purposes, showcases Russia's continued space capabilities.",
            "key_points": [
                "Russian Soyuz-2.1a rocket successfully launched from Plesetsk.",
                "Announced by the Ministry of Defense.",
                "Showcases Russia's continued space capabilities."
            ]
        }
    ],
    "Health": [
        {
            "headline": "Explained: Everyday drinking hides a deadly danger for Indian men",
            "summary": "A new explanation highlights that seemingly innocuous daily drinking habits among Indian men conceal significant health risks. This article delves into how regular alcohol consumption can lead to severe long-term health complications beyond common understanding.",
            "key_points": [
                "Everyday drinking poses deadly dangers for Indian men.",
                "Daily alcohol consumption can lead to severe long-term health complications.",
                "Article aims to explain risks beyond common understanding."
            ]
        },
        {
            "headline": "What really happens if you drink sauf water every day: Benefits, preparation and intake guidelines",
            "summary": "The article explores the purported health benefits of drinking sauf (fennel seed) water daily, providing guidance on its preparation and optimal intake. It aims to inform readers about the potential positive effects of incorporating this traditional practice into their routine.",
            "key_points": [
                "Explores health benefits of daily sauf (fennel seed) water consumption.",
                "Provides guidance on preparation and optimal intake.",
                "Aims to inform readers about traditional wellness practices."
            ]
        },
        {
            "headline": "Dry eyes after LASIK can blur vision and comfort: 3 things that can be done before surgery to prevent it",
            "summary": "Dry eyes are a common concern after LASIK surgery, often leading to blurred vision and discomfort. The article outlines three proactive measures individuals can take before the procedure to help prevent or mitigate this post-operative complication, ensuring better outcomes.",
            "key_points": [
                "Dry eyes are a common complication after LASIK surgery, causing blurred vision.",
                "Three proactive measures can be taken before surgery.",
                "Aims to prevent or mitigate post-operative discomfort."
            ]
        },
        {
            "headline": "Maharashtra: SIT probe finds China link to kidney racket",
            "summary": "A Special Investigation Team (SIT) in Maharashtra has uncovered a potential China link to a major kidney racket, indicating an international dimension to the illicit organ trade. This discovery suggests a complex network involved in illegal human organ trafficking, prompting further investigation.",
            "key_points": [
                "Maharashtra SIT finds China link to a major kidney racket.",
                "Indicates an international dimension to illicit organ trade.",
                "Suggests a complex network in illegal human organ trafficking."
            ]
        },
        {
            "headline": "Shimla hospital assault case: Doctors’ indefinite strike cripples OPDs, surgeries across Himachal Pradesh; patients urge quick resolution",
            "summary": "Following a hospital assault case, government doctors in Himachal Pradesh have launched an indefinite strike, severely crippling OPDs and surgeries statewide. Patients are urgently appealing for a swift resolution to restore essential healthcare services.",
            "key_points": [
                "Doctors in Himachal Pradesh on indefinite strike after hospital assault case.",
                "OPDs and surgeries severely crippled across the state.",
                "Patients urge quick resolution to restore healthcare services."
            ]
        },
        {
            "headline": "Watch: Woman dies at Andhra health center; family forced to carry body in rickshaw as hospital denies ambulance",
            "summary": "In a distressing incident from Andhra Pradesh, a woman died at a health center, and her family was tragically forced to transport her body in a rickshaw after being denied an ambulance. This highlights severe deficiencies in healthcare infrastructure and emergency services.",
            "key_points": [
                "Woman dies at Andhra health center, family denied ambulance.",
                "Family forced to carry body in a rickshaw.",
                "Highlights severe deficiencies in healthcare infrastructure and services."
            ]
        },
        {
            "headline": "Tea or coffee for stronger bones? New study offers surprising insights for older women",
            "summary": "A new study provides surprising insights into the effects of tea and coffee consumption on bone strength, specifically for older women. The research challenges conventional wisdom and offers new perspectives on dietary choices for maintaining skeletal health in later life.",
            "key_points": [
                "New study offers surprising insights on tea and coffee for bone strength.",
                "Specifically for older women.",
                "Challenges conventional wisdom on dietary choices for skeletal health."
            ]
        },
        {
            "headline": "Could chewing moringa leaves really boost your health?",
            "summary": "The article investigates the potential health benefits of regularly chewing moringa leaves, a practice gaining attention for its purported nutritional value. It explores whether this simple habit can genuinely contribute to improved overall health and well-being.",
            "key_points": [
                "Investigates potential health benefits of chewing moringa leaves.",
                "Practice gaining attention for its purported nutritional value.",
                "Explores contribution to improved overall health and well-being."
            ]
        },
        {
            "headline": "Drinking coffee the right way could help you live longer, strengthen your heart, protect and your brain; study reveals",
            "summary": "A new study suggests that consuming coffee in a specific \"right way\" could significantly extend lifespan, bolster heart health, and offer brain protection. The research provides updated guidelines on coffee consumption for optimal health benefits.",
            "key_points": [
                "Study suggests 'right way' coffee consumption can extend lifespan.",
                "Can strengthen heart health and protect the brain.",
                "Provides updated guidelines for optimal health benefits."
            ]
        },
        {
            "headline": "Carrot juice benefits in winter: From better digestion to stronger immunity and healthier eyes",
            "summary": "The article highlights the various health benefits of drinking carrot juice during winter, citing improvements in digestion, enhanced immunity, and healthier eyes. It promotes carrot juice as a beneficial seasonal beverage for overall well-being.",
            "key_points": [
                "Highlights winter health benefits of carrot juice.",
                "Includes better digestion, stronger immunity, and healthier eyes.",
                "Promotes it as a beneficial seasonal beverage for overall well-being."
            ]
        },
        {
            "headline": "How your social circle shapes your body weight",
            "summary": "Research indicates that an individual's social circle can significantly influence their body weight, suggesting that lifestyle habits are often shared among close contacts. This reveals the subtle yet powerful impact of social networks on personal health outcomes.",
            "key_points": [
                "Social circle can significantly influence body weight.",
                "Lifestyle habits are often shared among close contacts.",
                "Reveals subtle impact of social networks on personal health."
            ]
        },
        {
            "headline": "Are gel nails bad for you? NHS doc explains",
            "summary": "An NHS doctor provides insights into the potential harms of gel nails, addressing common concerns about their safety and impact on nail health. The explanation aims to inform consumers about risks and proper care practices.",
            "key_points": [
                "NHS doctor explains potential harms of gel nails.",
                "Addresses concerns about safety and impact on nail health.",
                "Aims to inform consumers about risks and proper care practices."
            ]
        },
        {
            "headline": "Experts reveal 7 traits of a sociopath: Do you recognise any in your life?",
            "summary": "Mental health experts have outlined seven key traits associated with sociopathy, prompting readers to consider if they recognize any in their personal interactions. This guide helps in understanding the behavioral patterns linked to the condition.",
            "key_points": [
                "Experts reveal seven key traits of a sociopath.",
                "Prompts readers to recognize these traits in interactions.",
                "Aids understanding of behavioral patterns linked to sociopathy."
            ]
        },
        {
            "headline": "5 skin supplements you should not take without asking the doctor",
            "summary": "The article advises caution regarding five specific skin supplements, emphasizing the importance of consulting a doctor before consumption. It highlights potential risks and the necessity of professional medical guidance for safe and effective use.",
            "key_points": [
                "Advises caution on five specific skin supplements.",
                "Emphasizes consulting a doctor before consumption.",
                "Highlights potential risks and need for professional medical guidance."
            ]
        }
    ]
}