{
    "World": [
        {
            "headline": "9 killed, dozens injured after school shooting in Canada's Tumbler Ridge",
            "summary": "A devastating school shooting in Tumbler Ridge, Canada, resulted in the deaths of 9 individuals and left dozens more injured. Authorities are investigating the incident.",
            "key_points": [
                "School shooting in Canada",
                "9 fatalities",
                "Dozens injured",
                "Tumbler Ridge location"
            ]
        },
        {
            "headline": "BRICS 2026 Kicks Off with First Sherpa Meet, Strong Backing for India’s Chairmanship",
            "summary": "The BRICS 2026 summit has commenced with its initial Sherpa meeting, drawing significant international support for India's leadership. This event marks a crucial step in setting the agenda for the influential economic bloc.",
            "key_points": [
                "BRICS 2026 summit begins",
                "First Sherpa meet",
                "Strong international backing",
                "India's chairmanship"
            ]
        },
        {
            "headline": "China Backs India’s BRICS Chair, Calls for Deeper Ties & Fair Global Rules",
            "summary": "China has formally expressed its support for India assuming the BRICS chairmanship, simultaneously calling for deeper collaboration among member states and the establishment of fair global rules. This signals a united front on key geopolitical and economic issues.",
            "key_points": [
                "China supports India's BRICS chair",
                "Calls for deeper member ties",
                "Advocates fair global rules",
                "United front in BRICS"
            ]
        },
        {
            "headline": "Taliban Takes the Helm at Afghan Embassy in Delhi: What India Stands to Gain?",
            "summary": "The Taliban has formally assumed control of the Afghan Embassy in Delhi, prompting questions about India's diplomatic strategy and potential gains from engaging with the new administration in Afghanistan.",
            "key_points": [
                "Taliban controls Afghan Embassy Delhi",
                "India's diplomatic strategy",
                "Potential gains for India",
                "Engagement with new Afghan administration"
            ]
        },
        {
            "headline": "Potential US Intervention in Iran: Implications for India",
            "summary": "An analysis explores the potential ramifications for India should the United States intervene in Iran, considering the regional stability, oil markets, and India's strategic interests.",
            "key_points": [
                "Potential US intervention in Iran",
                "Implications for India",
                "Regional stability",
                "Oil market impact"
            ]
        },
        {
            "headline": "Is Syria’s instability giving Islamic State another opening?",
            "summary": "A Kurdish-Syrian politician warns that the Syrian interim government's recent assault on Kurdish towns is contributing to instability, which could inadvertently aid extremist groups like the Islamic State in their resurgence. Syrians of all ethnicities have suffered greatly from religious violence.",
            "key_points": [
                "Syrian instability",
                "Risk of Islamic State resurgence",
                "Government actions on Kurdish towns",
                "Suffering from religious violence"
            ]
        },
        {
            "headline": "US hits lowest rank ever on global corruption index, Transparency Group says",
            "summary": "According to the Transparency Group, the United States has reached its lowest ranking ever on the global corruption index. This significant drop indicates growing concerns about corruption within the country.",
            "key_points": [
                "US lowest rank",
                "Global corruption index",
                "Transparency Group report",
                "Growing corruption concerns"
            ]
        },
        {
            "headline": "Russian strikes claim three lives in Ukraine as Zelenskyy urges a boost in air defence",
            "summary": "Three lives were lost in Ukraine due to recent Russian strikes, prompting President Zelenskyy to call for an urgent increase in the country's air defense capabilities to protect its citizens.",
            "key_points": [
                "Russian strikes in Ukraine",
                "Three fatalities",
                "Zelenskyy urges air defense boost",
                "Protection of citizens"
            ]
        },
        {
            "headline": "Venezuelan opposition figure held once more, shortly after leaving prison",
            "summary": "A prominent Venezuelan opposition figure has been re-arrested almost immediately after being released from prison. This marks another instance of intensifying political pressure within the country.",
            "key_points": [
                "Venezuelan opposition figure",
                "Re-arrested",
                "Shortly after prison release",
                "Intensifying political pressure"
            ]
        },
        {
            "headline": "Jon Stewart unleashes his fury: 'When did conservatism turn soft?'",
            "summary": "Political commentator Jon Stewart expressed strong sentiments, publicly questioning the evolution of modern conservatism. His remarks challenge when and why conservative ideology seemingly became less rigid or principled.",
            "key_points": [
                "Jon Stewart's criticism",
                "Questioning conservatism",
                "'Turned soft' remark",
                "Evolution of ideology"
            ]
        },
        {
            "headline": "Bus falls into river in Nepal; 12 killed",
            "summary": "A tragic accident in Nepal saw a bus plunge into a river, resulting in the deaths of 12 people. Rescue operations are underway, and the cause of the incident is under investigation.",
            "key_points": [
                "Bus accident in Nepal",
                "Plunged into river",
                "12 fatalities",
                "Ongoing investigation"
            ]
        },
        {
            "headline": "'Go back to India', 'Die Nazi': Melbourne dad finds racist notes while cleaning car",
            "summary": "An Indian-origin father in Melbourne discovered deeply offensive racist notes on his car, featuring hateful messages like 'Go back to India.' The incident highlights ongoing issues of racism and xenophobia.",
            "key_points": [
                "Racist notes in Melbourne",
                "Indian-origin father targeted",
                "'Go back to India' message",
                "Issues of racism and xenophobia"
            ]
        },
        {
            "headline": "Indian-origin driver who caused 2018 crash killing 16 loses final bid to stay in Canada",
            "summary": "An Indian-origin driver responsible for a fatal 2018 crash that killed 16 people has exhausted his legal options and lost his final appeal to remain in Canada. His lawyer cited stress and ongoing counseling as mitigating factors.",
            "key_points": [
                "Indian-origin driver",
                "Fatal 2018 crash",
                "16 fatalities",
                "Lost final bid to stay in Canada"
            ]
        },
        {
            "headline": "Cuba Faces Growing Pressure as US Escalates Blockade and Oil Seizures",
            "summary": "Cuba is enduring increased pressure as the United States intensifies its long-standing economic blockade and undertakes actions such as seizing oil shipments. These measures are severely impacting the island nation's economy and its citizens.",
            "key_points": [
                "Cuba under US pressure",
                "Intensified economic blockade",
                "Oil seizures",
                "Severe economic impact"
            ]
        },
        {
            "headline": "Origins of Special Military Operation: The History of Ukrainian Conflict",
            "summary": "This article provides a comprehensive overview of the historical roots and progression of the Ukrainian conflict, which Russia refers to as its 'special military operation,' offering context to the current geopolitical situation.",
            "key_points": [
                "Historical roots of Ukrainian conflict",
                "Russian 'special military operation'",
                "Geopolitical context",
                "Conflict progression"
            ]
        },
        {
            "headline": "The New START Treaty: The US-Russia Path to Nuclear Limits",
            "summary": "The New START Treaty stands as a pivotal agreement guiding the United States and Russia in limiting their strategic offensive nuclear weapons. It represents a critical effort in arms control and global stability.",
            "key_points": [
                "New START Treaty",
                "US-Russia nuclear limits",
                "Strategic arms control",
                "Global stability efforts"
            ]
        },
        {
            "headline": "Russian Forces Liberate Zaliznichnoye Settlement in Zaporozhye Region",
            "summary": "Russian military forces have reportedly achieved the liberation of the Zaliznichnoye settlement, located within Ukraine's Zaporozhye Region. This action is part of the ongoing conflict in the area.",
            "key_points": [
                "Russian forces",
                "Zaliznichnoye settlement liberated",
                "Zaporozhye Region",
                "Ongoing conflict"
            ]
        },
        {
            "headline": "Putin Holds Phone Conversation With South Africa's Ramaphosa: Kremlin",
            "summary": "The Kremlin announced that Russian President Vladimir Putin engaged in a telephone conversation with South African President Cyril Ramaphosa. The leaders discussed various matters of mutual interest and international cooperation.",
            "key_points": [
                "Putin-Ramaphosa phone call",
                "Kremlin announcement",
                "Bilateral discussions",
                "International cooperation"
            ]
        },
        {
            "headline": "Negotiations on Ukraine Continue, Still Long Way to Go: Lavrov",
            "summary": "Russian Foreign Minister Lavrov confirmed that negotiations concerning Ukraine are ongoing but emphasized that a significant journey remains before a comprehensive resolution can be achieved. This indicates the complexity of the peace process.",
            "key_points": [
                "Ukraine negotiations ongoing",
                "Lavrov's statement",
                "Long path to resolution",
                "Complex peace process"
            ]
        },
        {
            "headline": "Settlement Must Take Into Account Ukraine's Interests, But Russia's Security Key",
            "summary": "A sustainable settlement for the Ukrainian conflict necessitates acknowledging Ukraine's legitimate interests, but Russia's security concerns are underscored as a paramount factor for any lasting peace agreement.",
            "key_points": [
                "Ukraine settlement considerations",
                "Ukraine's interests",
                "Russia's security paramount",
                "Lasting peace agreement"
            ]
        },
        {
            "headline": "Rostec Delivers Updated Su-57 Fighters with Advanced Weapon Systems to Russian Army",
            "summary": "Rostec, a Russian state corporation, has successfully delivered updated Su-57 fighter jets, equipped with advanced weapon systems, to the Russian Army. This delivery aims to significantly enhance Russia's air combat capabilities.",
            "key_points": [
                "Rostec delivers Su-57 fighters",
                "Updated with advanced weapons",
                "Russian Army enhancement",
                "Air combat capabilities"
            ]
        },
        {
            "headline": "Russian Air Defense Systems Shot Down 69 Ukrainian Drones Overnight: MoD",
            "summary": "The Russian Ministry of Defense reported that its air defense systems successfully intercepted and shot down 69 Ukrainian drones over the course of the night. This highlights continued aerial engagements in the region.",
            "key_points": [
                "Russian air defense",
                "69 Ukrainian drones shot down",
                "Overnight operation",
                "Continued aerial engagements"
            ]
        },
        {
            "headline": "Kim Jong-un Hails Military’s 'Unheard-of Dramatic Events'",
            "summary": "North Korean leader Kim Jong-un has lauded his military for what he described as 'unheard-of dramatic events.' This commendation likely refers to recent advancements, drills, or demonstrations of military power.",
            "key_points": [
                "Kim Jong-un praises military",
                "'Unheard-of dramatic events'",
                "North Korean military advancements",
                "Leadership commendation"
            ]
        },
        {
            "headline": "Zaporozhye Power Plant Faces Critical Challenges Due to Ukrainian Attacks",
            "summary": "The Zaporozhye Nuclear Power Plant is reportedly facing critical operational and safety challenges as a result of ongoing Ukrainian attacks in its vicinity. International monitors have expressed concern.",
            "key_points": [
                "Zaporozhye Power Plant challenges",
                "Ukrainian attacks",
                "Operational and safety concerns",
                "International monitoring"
            ]
        },
        {
            "headline": "Attack on Russian General is Ukrainian Attempt to Sabotage Negotiations: Expert",
            "summary": "An expert analysis suggests that a recent attack on a Russian General was a deliberate effort by Ukrainian forces to disrupt ongoing peace negotiations. This indicates a potential move to stall diplomatic progress.",
            "key_points": [
                "Attack on Russian General",
                "Ukrainian sabotage attempt",
                "Disrupt negotiations",
                "Expert analysis"
            ]
        },
        {
            "headline": "Executor of Assassination Attempt on Alexeyev Arrived in Russia Under Ukrainian Intelligence Orders",
            "summary": "Reports indicate that the individual responsible for the assassination attempt on Russian General Alexeyev entered Russia acting under direct orders from Ukrainian intelligence. This suggests a foreign state-sponsored operation.",
            "key_points": [
                "Alexeyev assassination attempt",
                "Executor under Ukrainian orders",
                "Foreign intelligence involvement",
                "State-sponsored operation"
            ]
        },
        {
            "headline": "Is the Future of NATO in Jeopardy?",
            "summary": "This article explores the current challenges and debates surrounding the North Atlantic Treaty Organization (NATO), questioning its future relevance and cohesion amidst changing global dynamics.",
            "key_points": [
                "Challenges for NATO",
                "Future relevance debated",
                "Cohesion questioned",
                "Changing global dynamics"
            ]
        },
        {
            "headline": "Macron Has Lost His Influence Over France: Expert",
            "summary": "An expert analysis suggests that French President Emmanuel Macron's political influence within France has waned. This assessment points to potential challenges for his remaining term and policy implementation.",
            "key_points": [
                "Macron's influence diminished",
                "Expert analysis",
                "Challenges for French President",
                "Policy implementation concerns"
            ]
        },
        {
            "headline": "‘Collapse of NATO' is 'Only Good Outcome’ of US-Europe Dispute Over Greenland: Ex-Pentagon Analyst",
            "summary": "A former Pentagon analyst controversially stated that the 'collapse of NATO' would be the only positive outcome of the ongoing dispute between the US and Europe regarding Greenland. This highlights deep rifts within the alliance.",
            "key_points": [
                "Ex-Pentagon analyst's view",
                "NATO collapse as 'good outcome'",
                "US-Europe Greenland dispute",
                "Deep alliance rifts"
            ]
        },
        {
            "headline": "Imperialism or National Interest? Why Greenland Matters",
            "summary": "This article delves into the geopolitical significance of Greenland, examining whether international interest in the region stems from imperialistic ambitions or legitimate national security and economic interests.",
            "key_points": [
                "Geopolitical significance of Greenland",
                "Imperialism vs. national interest",
                "International interest",
                "Strategic importance"
            ]
        }
    ],
    "Business": [
        {
            "headline": "Pulses dropped, $500bn purchase clause revised: What’s new in updated India-US trade deal factsheet",
            "summary": "The US has issued a revised factsheet for its trade deal with India, notably removing pulses from the list of agricultural exports. Additionally, the language concerning India's commitment to purchasing American goods has shifted from a firm clause to an intention, impacting previously described procurements.",
            "key_points": [
                "US revised trade factsheet",
                "Pulses removed from exports",
                "$500bn purchase clause revised",
                "Commitment softened to intention"
            ]
        },
        {
            "headline": "Trump's tariffs are coming down. But what's India giving up?",
            "summary": "An analysis suggests that assessing the trade pact with the US requires looking beyond the apparent tariff cuts. The interim agreement may present India with complex policy choices, particularly in emerging areas like the digital economy.",
            "key_points": [
                "Beyond tariff cuts",
                "Interim agreement issues",
                "India's policy choices",
                "Digital economy implications"
            ]
        },
        {
            "headline": "Top stocks to buy today: Stock recommendations for February 11, 2026 - check list",
            "summary": "Mehul Kothari, DVP - Technical Research at Anand Rathi Shares and Stock Brokers, has identified IFCI, Swiggy, and Fortis as the top stock recommendations for investors today, February 11, 2026, offering a detailed outlook for each.",
            "key_points": [
                "Top stock recommendations",
                "IFCI, Swiggy, Fortis",
                "Expert Mehul Kothari",
                "Detailed outlook for Feb 11, 2026"
            ]
        },
        {
            "headline": "Joblessness among those aged 15 and above falls in rural, urban areas in Oct-Dec: PLFS",
            "summary": "India witnessed a decline in joblessness rates for individuals aged 15 and above across both rural and urban sectors during the October-December quarter, according to the Periodic Labour Force Survey (PLFS). This indicates a positive trend in employment figures.",
            "key_points": [
                "Joblessness falls in India",
                "Oct-Dec quarter",
                "Rural and urban areas",
                "PLFS report"
            ]
        },
        {
            "headline": "Niti Aayog seeks diesel vehicle phase-out, focus on cleaner tech",
            "summary": "Niti Aayog is advocating for a systematic phase-out of diesel vehicles in India, urging a strong pivot towards cleaner technologies. This initiative aims to address environmental concerns and promote sustainable transportation solutions nationwide.",
            "key_points": [
                "Niti Aayog proposes diesel phase-out",
                "Focus on cleaner tech",
                "Address environmental concerns",
                "Sustainable transportation"
            ]
        },
        {
            "headline": "US lawmaker introduces bill to eliminate H-1B visa programme by 2027 — What is the EXILE Act?",
            "summary": "A US lawmaker has introduced the 'EXILE Act' bill, which aims to phase out and eliminate the H-1B visa program by 2027. This proposed legislation could have profound implications for Indian professionals and the global technology sector.",
            "key_points": [
                "EXILE Act introduced",
                "H-1B visa elimination by 2027",
                "Profound implications for Indian professionals",
                "Global tech sector impact"
            ]
        },
        {
            "headline": "Govt to sell 5.3% in Bhel, eyes Rs 4,650cr",
            "summary": "The Indian government has announced its intention to divest a 5.3% stake in BHEL (Bharat Heavy Electricals Limited), projecting to raise Rs 4,650 crore from the sale. This move is part of the government's disinvestment strategy.",
            "key_points": [
                "Govt to sell BHEL stake",
                "5.3% divestment",
                "Target Rs 4,650 crore",
                "Disinvestment strategy"
            ]
        },
        {
            "headline": "TaMo, long-time partner Stellantis ink fresh MoU",
            "summary": "Tata Motors (TaMo) and its longstanding automotive partner Stellantis have signed a new Memorandum of Understanding, signaling potential fresh collaborations and joint ventures in the future. This move could strengthen their market positions.",
            "key_points": [
                "Tata Motors, Stellantis MoU",
                "Fresh agreement signed",
                "Potential collaborations",
                "Strengthens market positions"
            ]
        },
        {
            "headline": "India can be alternative to China for US cos: Greer",
            "summary": "Expert Greer suggests that India presents a compelling alternative to China for US companies seeking diversified manufacturing bases and supply chain partners. This highlights India's growing economic appeal and strategic importance.",
            "key_points": [
                "India as China alternative",
                "US companies",
                "Manufacturing base",
                "Supply chain partners"
            ]
        },
        {
            "headline": "Tobacco Board urges Sitharaman to revisit tax hike in interest of farmers, workers",
            "summary": "The Tobacco Board has appealed to Finance Minister Sitharaman to reconsider a proposed tax hike, arguing that such a measure would negatively impact the livelihoods of farmers and workers dependent on the tobacco industry.",
            "key_points": [
                "Tobacco Board appeals Sitharaman",
                "Revisit tax hike",
                "Negative impact on farmers",
                "Worker livelihoods concern"
            ]
        },
        {
            "headline": "Over Rs 72,000 crore in unclaimed bank deposits transferred to RBI fund: Government",
            "summary": "The Indian government announced that a staggering sum of over Rs 72,000 crore in unclaimed bank deposits has been transferred to the Reserve Bank of India's Depositor Education and Awareness (DEA) fund. This move aims to centralize these funds for public benefit.",
            "key_points": [
                "Rs 72,000 crore unclaimed deposits",
                "Transferred to RBI fund",
                "DEA fund",
                "Centralize funds"
            ]
        },
        {
            "headline": "India to keep buying cheapest, best-quality crude, govt tells parliamentary panel",
            "summary": "The Indian government has assured a parliamentary panel of its unwavering commitment to procure the cheapest and best-quality crude oil available globally. This strategy prioritizes national economic interests amidst fluctuating energy markets.",
            "key_points": [
                "India to buy cheapest crude",
                "Best-quality crude",
                "Government assurance",
                "Parliamentary panel"
            ]
        },
        {
            "headline": "National Interest Will Be Guiding Factor: India on Question About Russian Oil",
            "summary": "India has firmly stated that its national interest will solely dictate its decisions regarding the purchase of Russian oil, reaffirming its sovereign right to energy security amidst international pressure and sanctions.",
            "key_points": [
                "India's national interest",
                "Russian oil purchases",
                "Guiding factor",
                "Energy security"
            ]
        },
        {
            "headline": "India's Defence Budget Rises by 15%: What Does it Mean for Indian Military?",
            "summary": "India's defence budget has seen a substantial 15% increase, prompting analysis into its implications for the Indian military. This rise is expected to boost modernization, indigenous production, and overall strategic capabilities.",
            "key_points": [
                "India's defence budget rises 15%",
                "Implications for Indian military",
                "Boost to modernization",
                "Indigenous production"
            ]
        },
        {
            "headline": "Russia Stays Vital to India’s Oil Supply: Oil Analyst Rejects US Claim",
            "summary": "An oil analyst has refuted US claims, asserting that Russia remains a crucial and vital source for India's oil supply. This highlights India's energy diversification strategy and its continued reliance on Russian crude.",
            "key_points": [
                "Russia vital for India's oil",
                "Oil analyst refutes US claim",
                "India's energy diversification",
                "Reliance on Russian crude"
            ]
        },
        {
            "headline": "Unlike West, India Gives UAE a True Partnership Free of Conditions: Expert",
            "summary": "An expert argues that India provides the UAE with a genuine partnership, unlike Western nations, characterized by a lack of conditionalities. This fosters stronger, more equitable bilateral relations.",
            "key_points": [
                "India-UAE partnership",
                "Unlike Western nations",
                "Free of conditions",
                "Stronger bilateral relations"
            ]
        },
        {
            "headline": "RBI’s Digital Currency Plan to Challenge Dollar-Centric Payment Systems: Expert",
            "summary": "An expert suggests that the Reserve Bank of India's (RBI) plan for a digital currency could potentially challenge the prevailing dollar-centric global payment systems. This move aims to enhance financial sovereignty and efficiency.",
            "key_points": [
                "RBI digital currency plan",
                "Challenge dollar-centric systems",
                "Financial sovereignty",
                "Payment system efficiency"
            ]
        },
        {
            "headline": "Carlyle to take control of Nido Home Finance",
            "summary": "Carlyle Group is reportedly set to acquire a controlling stake in Nido Home Finance, marking a significant strategic investment in the financial services sector. This acquisition could reshape the home finance landscape.",
            "key_points": [
                "Carlyle to control Nido Home Finance",
                "Strategic acquisition",
                "Financial services sector",
                "Reshaping home finance"
            ]
        },
        {
            "headline": "Health insurers get back in shape post Covid low",
            "summary": "Health insurance companies are showing signs of strong recovery and improved financial performance after facing significant challenges and a downturn during the Covid-19 pandemic. The sector appears to be regaining its stability.",
            "key_points": [
                "Health insurers recover",
                "Post-Covid low",
                "Improved financial performance",
                "Regaining stability"
            ]
        },
        {
            "headline": "Metal over scrip: Gold, silver ETFs outshine equity funds",
            "summary": "In a notable market trend, Gold and silver ETFs have demonstrated superior performance, outshining traditional equity funds. This indicates a shift in investor preference towards safe-haven assets amidst economic uncertainties.",
            "key_points": [
                "Gold, silver ETFs outperform",
                "Equity funds",
                "Shift in investor preference",
                "Safe-haven assets"
            ]
        },
        {
            "headline": "Compliance takes centrestage in boardrooms",
            "summary": "Corporate compliance and regulatory adherence are increasingly becoming a central focus in boardrooms across industries. This heightened emphasis reflects a growing recognition of risk management and ethical governance.",
            "key_points": [
                "Compliance central in boardrooms",
                "Heightened focus",
                "Risk management",
                "Ethical governance"
            ]
        },
        {
            "headline": "Exporters not sweating over US-Bangladesh trade deal",
            "summary": "Indian exporters reportedly remain unconcerned by the recently concluded US-Bangladesh trade deal. They anticipate minimal impact on their existing market shares and competitive standing.",
            "key_points": [
                "Indian exporters unconcerned",
                "US-Bangladesh trade deal",
                "Minimal market impact",
                "Competitive standing"
            ]
        },
        {
            "headline": "Pharma manufacturer Dadachanji forays into building med devices",
            "summary": "Dadachanji, a prominent pharmaceutical manufacturer, is diversifying its business by venturing into the production of medical devices. This strategic move expands its footprint within the broader healthcare industry.",
            "key_points": [
                "Dadachanji enters med devices",
                "Pharma diversification",
                "Expands healthcare footprint",
                "Strategic business move"
            ]
        },
        {
            "headline": "BRICS Overtakes G7 in Purchasing Power Parity Growth: Lavrov",
            "summary": "Russian Foreign Minister Lavrov announced that the BRICS nations have collectively surpassed the G7 in terms of purchasing power parity (PPP) growth. This signifies the growing economic clout and shift in global economic balance.",
            "key_points": [
                "BRICS overtakes G7",
                "Purchasing power parity growth",
                "Lavrov's statement",
                "Global economic balance shift"
            ]
        }
    ],
    "Technology": [
        {
            "headline": "The universe is not black in colour! Scientists reveal its true shade: “Cosmic Latte”",
            "summary": "Scientists have unveiled that the universe is not actually black, but rather a beige-white shade they've termed 'Cosmic Latte.' This discovery stems from analyzing light from countless galaxies.",
            "key_points": [
                "Universe's true color revealed",
                "'Cosmic Latte'",
                "Not black",
                "Analysis of galaxy light"
            ]
        },
        {
            "headline": "Meet Shyam Sankar: Indian-origin Palantir CTO who is driving America’s defence future",
            "summary": "Shyam Sankar, an Indian-origin Chief Technology Officer at Palantir, is being recognized for his pivotal role in shaping America's defense capabilities. His work focuses on leveraging advanced data analytics and AI for national security.",
            "key_points": [
                "Shyam Sankar, Palantir CTO",
                "Indian-origin",
                "Shaping America's defense future",
                "Advanced data analytics and AI"
            ]
        },
        {
            "headline": "Russia Prepares Key Agenda for India AI Impact Summit 2026: Lavrov",
            "summary": "Russian Foreign Minister Lavrov announced that Russia is actively preparing a significant agenda for the upcoming India AI Impact Summit in 2026. This initiative signals a growing bilateral cooperation in artificial intelligence development and policy.",
            "key_points": [
                "Russia prepares AI Summit agenda",
                "India AI Impact Summit 2026",
                "Lavrov's announcement",
                "Bilateral AI cooperation"
            ]
        },
        {
            "headline": "More Than a Plane: SJ-100 is India's Fast Track to Aviation Self-Reliance",
            "summary": "The SJ-100 project is highlighted as more than just a new aircraft, but rather a crucial step for India to achieve self-reliance in the aviation sector. This indigenous effort aims to boost domestic manufacturing and technological independence.",
            "key_points": [
                "SJ-100 project",
                "India's aviation self-reliance",
                "Indigenous manufacturing",
                "Technological independence"
            ]
        }
    ],
    "Entertainment": [
        {
            "headline": "From Rohit Shetty to Ranveer Singh: Extortion wave hits Bollywood; 1990s underworld fears resurface",
            "summary": "A new wave of extortion is unsettling Bollywood, with prominent figures like Rohit Shetty and Ranveer Singh reportedly targeted. This alarming trend has led to a resurgence of fears reminiscent of the underworld's influence in the 1990s.",
            "key_points": [
                "Extortion wave in Bollywood",
                "Targets Rohit Shetty, Ranveer Singh",
                "1990s underworld fears",
                "Unsettling industry trend"
            ]
        },
        {
            "headline": "Rajpal Yadav's net worth: From movie fees to brand endorsement income, all you need to know",
            "summary": "Bollywood actor Rajpal Yadav has surrendered at Tihar Jail due to a bounced check linked to a film investment, despite his significant net worth estimated between Rs 50-85 crore. His income primarily stems from movie roles and brand endorsements.",
            "key_points": [
                "Rajpal Yadav jailed",
                "Bounced check case",
                "Net worth Rs 50-85 crore",
                "Income from films and endorsements"
            ]
        },
        {
            "headline": "Kurt Cobain's death was 'homicide' and not suicide? Forensic scientist claims 'forced overdose' before being 'shot in the head'",
            "summary": "A forensic scientist has put forth a controversial theory, claiming that Kurt Cobain's death was a homicide, not a suicide. The scientist suggests a 'forced overdose' occurred before he was allegedly 'shot in the head.'",
            "key_points": [
                "Kurt Cobain death theory",
                "Forensic scientist's claim",
                "'Homicide, not suicide'",
                "'Forced overdose, then shot'"
            ]
        },
        {
            "headline": "Cardi B treats herself to a USD 500,000 watch amid Stefon Diggs split rumors",
            "summary": "Cardi B indulged in a lavish purchase, acquiring a USD 500,000 watch, amidst swirling rumors of a split with Stefon Diggs. Her extravagant spending has drawn attention as speculation about her relationship status continues.",
            "key_points": [
                "Cardi B buys $500,000 watch",
                "Lavish purchase",
                "Stefon Diggs split rumors",
                "Relationship speculation"
            ]
        },
        {
            "headline": "Trump calls out Bad Bunny’s Super Bowl performance, igniting cultural backlash",
            "summary": "Donald Trump publicly criticized Bad Bunny's Super Bowl performance, a move that quickly ignited a significant cultural backlash. His comments sparked debate and drew reactions from various segments of society.",
            "key_points": [
                "Trump criticizes Bad Bunny",
                "Super Bowl performance",
                "Ignites cultural backlash",
                "Sparks public debate"
            ]
        },
        {
            "headline": "Chappell Roan leaves Wasserman agency over moral values amid Epstein files controversy",
            "summary": "Singer Chappell Roan has announced her departure from the Wasserman agency, citing a conflict of moral values. This decision comes amidst the highly publicized controversy surrounding the Epstein files, indicating ethical considerations.",
            "key_points": [
                "Chappell Roan leaves Wasserman agency",
                "Moral values conflict",
                "Epstein files controversy",
                "Ethical considerations"
            ]
        }
    ],
    "Sports": [
        {
            "headline": "T20 World Cup: Abhishek Sharma hospitalised ahead of clash vs Namibia",
            "summary": "Indian cricketer Abhishek Sharma has been hospitalized due to an infection, casting significant doubt on his availability for India's upcoming T20 World Cup match against Namibia. He had been unwell prior to the previous game.",
            "key_points": [
                "Abhishek Sharma hospitalized",
                "Infection",
                "Doubt for Namibia match",
                "Unwell before previous game"
            ]
        },
        {
            "headline": "After 'India players have superior bats' remark, Rajapaksa makes new post",
            "summary": "Sri Lanka’s Bhanuka Rajapaksa issued a clarification regarding his controversial comments about Indian players having 'superior bats.' He stated his remarks were misunderstood praise for India's advanced cricket system, not an accusation.",
            "key_points": [
                "Rajapaksa clarifies bat comments",
                "Misunderstood praise for India",
                "Lauded India's cricket system",
                "Not an accusation"
            ]
        },
        {
            "headline": "FIDE WC in India: PM Modi says 'Chess is gaining popularity among our youth'",
            "summary": "Prime Minister Modi highlighted the increasing popularity of chess among Indian youth, especially with the FIDE World Championship taking place in India. He emphasized the game's cognitive benefits and growing engagement.",
            "key_points": [
                "PM Modi on chess popularity",
                "FIDE World Championship in India",
                "Youth engagement",
                "Cognitive benefits"
            ]
        },
        {
            "headline": "'We can't forget Pahalgam': Sehwag under fire for promoting IND vs PAK",
            "summary": "Former cricketer Virender Sehwag faced backlash for promoting an India vs. Pakistan match, with many critics invoking the 'Pahalgam' incident. This sparked a debate balancing national sentiment with sporting events.",
            "key_points": [
                "Sehwag promotes IND vs PAK",
                "Faces criticism",
                "'Pahalgam' reference",
                "National sentiment vs. sports"
            ]
        },
        {
            "headline": "'Two reasons': Why was Dhoni promoted over Yuvraj? Sachin breaks silence",
            "summary": "Sachin Tendulkar has finally broken his silence, revealing the 'two reasons' behind MS Dhoni's strategic promotion ahead of Yuvraj Singh in a crucial match. This disclosure sheds light on a long-debated decision in Indian cricket history.",
            "key_points": [
                "Sachin reveals Dhoni's promotion",
                "Ahead of Yuvraj Singh",
                "Two specific reasons",
                "Long-debated decision"
            ]
        },
        {
            "headline": "NBA trade rumors: Los Angeles Lakers could acquire $6 million Brooklyn Nets star to play Alongside Luka Doncic and improve championship odds",
            "summary": "Rumors are circulating that the Los Angeles Lakers are eying a $6 million Brooklyn Nets star to potentially team up with Luka Doncic. This strategic acquisition aims to significantly boost their championship prospects.",
            "key_points": [
                "Lakers trade rumors",
                "Brooklyn Nets star target",
                "Luka Doncic pairing",
                "Boost championship odds"
            ]
        },
        {
            "headline": "NBA trade rumors: Golden State Warriors predicted to land $3.63 million Memphis Grizzlies guard; reunion with Stephen Curry could influence 2026 playoff push",
            "summary": "Predictions suggest the Golden State Warriors are poised to acquire a $3.63 million Memphis Grizzlies guard. A potential reunion with Stephen Curry could be a key factor in their push for the 2026 playoffs.",
            "key_points": [
                "Warriors trade prediction",
                "Memphis Grizzlies guard",
                "Stephen Curry reunion",
                "2026 playoff push"
            ]
        }
    ],
    "Science": [
        {
            "headline": "Meet Meha Jain: Indian-origin scientist wins Arizona State University’s top Science Prize",
            "summary": "Meha Jain, an accomplished Indian-origin scientist, has been honored with Arizona State University’s prestigious top Science Prize. Her recognition underscores significant contributions to scientific research and innovation.",
            "key_points": [
                "Meha Jain wins Science Prize",
                "Indian-origin scientist",
                "Arizona State University",
                "Significant contributions"
            ]
        },
        {
            "headline": "The universe is not black in colour! Scientists reveal its true shade: “Cosmic Latte”",
            "summary": "Scientists have unveiled that the universe is not actually black, but rather a beige-white shade they've termed 'Cosmic Latte.' This discovery stems from analyzing light from countless galaxies.",
            "key_points": [
                "Universe's true color revealed",
                "'Cosmic Latte'",
                "Not black",
                "Analysis of galaxy light"
            ]
        }
    ],
    "Health": [
        {
            "headline": "SC: Make front-of-pack warning labels a must on packaged food",
            "summary": "India's Supreme Court has mandated the compulsory inclusion of front-of-pack warning labels on all packaged food items. This ruling aims to empower consumers with clear information about unhealthy ingredients and promote healthier choices.",
            "key_points": [
                "SC mandates warning labels",
                "Packaged food",
                "Empower consumers",
                "Promote healthier choices"
            ]
        },
        {
            "headline": "Why straight lines start looking wavy after 50: Doctor explains what Age-Related Macular Degeneration (AMD) really feels like",
            "summary": "A doctor provides a clear explanation of Age-Related Macular Degeneration (AMD), detailing why individuals over 50 might experience straight lines appearing wavy. The article elucidates the symptoms and impact of this common eye condition.",
            "key_points": [
                "AMD explanation",
                "Wavy lines after 50",
                "Common eye condition",
                "Symptoms and impact"
            ]
        },
        {
            "headline": "Pharma manufacturer Dadachanji forays into building med devices",
            "summary": "Pharma manufacturer Dadachanji is diversifying its business operations by entering the medical device sector. This strategic expansion signals its commitment to a broader role in healthcare innovation and product development.",
            "key_points": [
                "Dadachanji enters med devices",
                "Pharma diversification",
                "Healthcare innovation",
                "Product development"
            ]
        },
        {
            "headline": "Health insurers get back in shape post Covid low",
            "summary": "The health insurance sector is demonstrating a robust recovery and improved stability following the significant downturn experienced during the Covid-19 pandemic. This indicates a positive rebound in the industry's financial health.",
            "key_points": [
                "Health insurers recover",
                "Post-Covid low",
                "Improved stability",
                "Industry rebound"
            ]
        },
        {
            "headline": "Tobacco Board urges Sitharaman to revisit tax hike in interest of farmers, workers",
            "summary": "The Tobacco Board has issued an appeal to Finance Minister Sitharaman, requesting a reconsideration of a proposed tax hike. The board argues that such a hike would adversely affect thousands of farmers and workers reliant on the tobacco industry.",
            "key_points": [
                "Tobacco Board appeals Sitharaman",
                "Revisit tax hike",
                "Adverse effect on farmers",
                "Worker livelihoods"
            ]
        }
    ]
}