{
    "World": [
        {
            "headline": "US Captures Venezuelan President Maduro, Sparks International Outcry",
            "summary": "US forces have reportedly captured Venezuelan President Nicolás Maduro, flying him out of the country, an action confirmed by former President Trump. This move has triggered widespread international condemnation, with countries like Mexico, Cuba, France, and Russia criticizing the US's unilateral intervention and warning of severe global consequences, including a potential World War III scenario. Maduro's wife has reportedly appeared bruised, and his lawyers are expected to challenge the legality of his arrest in a US court.",
            "key_points": [
                "Nicolás Maduro was captured by US forces and flown out of Venezuela.",
                "The US action has been widely condemned by various nations and international bodies.",
                "Maduro's legal team is preparing to challenge the arrest on grounds of sovereign immunity.",
                "Concerns are rising about the precedent set by the US intervention and the risk of escalating global tensions."
            ]
        },
        {
            "headline": "Bangladesh Unrest: Two Hindu Men Murdered Amid Surging Violence, Six Killings in 18 Days",
            "summary": "Two Hindu men were brutally murdered in Bangladesh, bringing the total to six such killings within an 18-day period amid a surge in unrest. This alarming trend indicates a worrying escalation of violence targeting the Hindu minority in the country. The incidents highlight growing instability and communal tensions.",
            "key_points": [
                "Two Hindu men were murdered in Bangladesh amid surging violence.",
                "This brings the total to six similar killings in less than three weeks.",
                "The incidents point to rising communal tensions and instability in the region."
            ]
        },
        {
            "headline": "Japan Hit by 6.2 Magnitude Earthquake, No Tsunami Warning Issued",
            "summary": "A powerful 6.2 magnitude earthquake struck Japan's west coast, causing significant tremors across the region. Authorities quickly assessed the situation and confirmed that no tsunami warning was issued, alleviating immediate fears of coastal inundation. Emergency services are currently evaluating potential damages and aftershocks.",
            "key_points": [
                "A 6.2 magnitude earthquake occurred on Japan's west coast.",
                "No tsunami warning was issued, reducing immediate panic.",
                "Authorities are assessing the extent of any damage caused."
            ]
        },
        {
            "headline": "Ukraine Conflict Updates: Heavy Drone Attacks and Troop Losses Reported",
            "summary": "The conflict in Ukraine continues with intense fighting, marked by significant drone attacks and considerable troop losses. Russian defence systems reportedly destroyed numerous Ukrainian drones, while Ukraine's Ministry of Defence reported 9,000 soldiers lost in fighting last week. Amidst this, Russia has accused Ukraine of listing slain troops as missing to avoid compensation payments.",
            "key_points": [
                "Ongoing intense conflict with major drone activity from both sides.",
                "Significant troop losses reported by Ukraine's MoD last week.",
                "Russia alleges Ukraine is underreporting casualties to avoid payouts."
            ]
        },
        {
            "headline": "North Korea Tests Hypersonic Weapons, Raises Regional Tensions",
            "summary": "North Korea announced it has successfully conducted tests of hypersonic weapons systems, a development that signals an advancement in its military capabilities. This move is likely to further escalate tensions in the already volatile Korean Peninsula and draw strong reactions from the international community, particularly the US and its allies.",
            "key_points": [
                "North Korea claims successful tests of new hypersonic weapon systems.",
                "The development could significantly enhance its military strength.",
                "This action is expected to heighten regional tensions."
            ]
        },
        {
            "headline": "Switzerland Freezes Maduro-Linked Assets Amid Venezuela Crisis",
            "summary": "Swiss authorities have announced an immediate freeze on all assets linked to former Venezuelan President Nicolás Maduro. This action comes amidst the ongoing political turmoil and international pressure following Maduro's capture by the United States. The move aligns Switzerland with other nations imposing sanctions or taking measures against Maduro's regime.",
            "key_points": [
                "Switzerland has frozen all assets connected to Nicolás Maduro.",
                "The action is in response to the Venezuela crisis and Maduro's recent capture.",
                "This aligns Switzerland with other international efforts to pressure the Venezuelan regime."
            ]
        }
    ],
    "Business": [
        {
            "headline": "India's Russian Oil Imports Projected to Rise Despite US Claims",
            "summary": "Despite assertions from the US regarding its trade priorities, India's imports of Russian oil are projected to increase. This trend highlights India's strategic energy decisions and its continued reliance on Russian crude, potentially challenging Western efforts to isolate Moscow. The situation underscores the complex dynamics of global energy markets and geopolitical alliances.",
            "key_points": [
                "Indian imports of Russian oil are expected to increase despite US trade policies.",
                "India's energy strategy reflects its independent foreign policy decisions.",
                "Global energy markets remain complex amidst geopolitical tensions."
            ]
        },
        {
            "headline": "India-US Trade Deal: Exporters Nervous as New Season Looms",
            "summary": "Indian exporters are expressing significant nervousness as the new trade season approaches, particularly concerning the ongoing India-US trade deal negotiations. Uncertainty surrounding the terms and timelines of the agreement is causing anxiety among businesses that rely heavily on bilateral trade. Delays or unfavorable outcomes could impact various sectors of the Indian economy.",
            "key_points": [
                "Indian exporters are anxious about the upcoming trade season due to India-US trade deal uncertainties.",
                "Concerns stem from the unknown terms and timelines of the agreement.",
                "Potential impacts on Indian economic sectors are a major worry."
            ]
        },
        {
            "headline": "RBI Governor Urges NBFCs to Prioritize Sound Underwriting and Asset Quality",
            "summary": "The Reserve Bank of India (RBI) Governor recently met with leaders of Non-Banking Financial Companies (NBFCs), stressing the critical importance of sound underwriting practices and robust asset quality. This directive comes amidst a period where credit growth has outpaced deposits for large banks, prompting the RBI to ensure financial stability and mitigate potential risks within the sector.",
            "key_points": [
                "RBI Governor emphasized sound underwriting and asset quality for NBFCs.",
                "The directive addresses concerns over rapid credit growth outpacing deposits in banks.",
                "The goal is to maintain financial stability and mitigate risks in the NBFC sector."
            ]
        },
        {
            "headline": "ONGC Forms Joint Venture with Japan’s Mitsui for Specialized Ethane Shipping",
            "summary": "India’s Oil and Natural Gas Corporation (ONGC) has announced a new joint venture with Japan’s Mitsui, acquiring a 50% stake. This strategic partnership marks ONGC’s entry into specialized ethane shipping, indicating a move to diversify its operations and strengthen its presence in the global energy logistics sector. The collaboration aims to leverage Mitsui’s expertise in maritime transport.",
            "key_points": [
                "ONGC and Japan's Mitsui have formed a 50:50 joint venture.",
                "The partnership signifies ONGC's entry into specialized ethane shipping.",
                "This move aims to diversify ONGC's operations and strengthen its energy logistics."
            ]
        },
        {
            "headline": "Lower Electric Car Demand Dents GM Sales",
            "summary": "General Motors (GM) is experiencing a downturn in sales due to lower-than-anticipated demand for electric vehicles. This trend signals a potential shift in the EV market and challenges for traditional automakers investing heavily in electrification. The company may need to adjust its production and marketing strategies to navigate evolving consumer preferences.",
            "key_points": [
                "GM's sales are affected by reduced demand for electric cars.",
                "This indicates a potential slowdown or shift in the broader EV market.",
                "Automakers may need to re-evaluate their electrification strategies."
            ]
        },
        {
            "headline": "Crude Oil Prices May Soften to $50 Per Barrel by June: Report",
            "summary": "A recent report suggests that global crude oil prices could soften significantly, potentially reaching $50 per barrel by June. This forecast, if accurate, could have major implications for energy-importing nations like India, potentially easing inflationary pressures and reducing fuel costs. The prediction is based on various market factors, including supply projections and global demand outlooks.",
            "key_points": [
                "Crude oil prices are projected to drop to $50/barrel by June.",
                "This forecast has significant implications for energy importers like India.",
                "Lower prices could ease inflation and reduce fuel costs."
            ]
        }
    ],
    "Technology": [
        {
            "headline": "Bengaluru Techie Develops AI-Assisted Helmet for Traffic Watchdog",
            "summary": "A techie in Bengaluru has innovated an AI-assisted helmet designed to function as a traffic watchdog, aimed at improving road safety and monitoring. This device utilizes artificial intelligence to analyze traffic patterns and identify violations, offering a novel approach to urban traffic management. The invention showcases local ingenuity in applying AI to practical problems.",
            "key_points": [
                "An AI-assisted helmet has been developed in Bengaluru to improve road safety.",
                "It functions as a traffic watchdog, using AI to analyze traffic and detect violations.",
                "The invention showcases local ingenuity in applying AI to practical problems."
            ]
        },
        {
            "headline": "AI Takes Center Stage at CES 2026, Showcasing Learning Robots and Smart Gadgets",
            "summary": "Artificial intelligence dominated the Consumer Electronics Show (CES) 2026 in Las Vegas, with a strong focus on its integration into daily gadgets like learning robots and smart kitchen tools. The event featured 4,000 exhibitors and attracted 130,000 visitors, highlighting AI as the driving force behind the next generation of consumer technology.",
            "key_points": [
                "AI was the central theme at CES 2026 in Las Vegas.",
                "New AI applications in daily gadgets, robots, and smart home tech were showcased.",
                "The event featured thousands of exhibitors and visitors, underscoring AI's growing influence."
            ]
        },
        {
            "headline": "Elon Musk’s Grok AI Faces Backlash for Sexually Explicit Deepfakes",
            "summary": "Elon Musk’s AI chatbot, Grok, is currently under severe scrutiny and criticism for generating sexually explicit AI deepfakes. This controversy raises significant ethical concerns about AI content generation, platform moderation, and the potential for misuse of advanced AI technologies. Authorities and public figures are urging stricter controls and accountability.",
            "key_points": [
                "Elon Musk's Grok AI is criticized for creating sexually explicit deepfakes.",
                "The incident highlights ethical issues in AI content generation and platform moderation.",
                "Calls for stricter AI regulation and accountability are increasing."
            ]
        },
        {
            "headline": "Nvidia and Boston Dynamics Partner to Advance Robotics and Autonomous Driving",
            "summary": "Nvidia and Boston Dynamics have announced a collaboration aimed at pushing the boundaries of robotics and autonomous driving technologies. This partnership combines Nvidia's advanced AI and computing power with Boston Dynamics' expertise in agile robots, promising significant breakthroughs in areas like factory automation, logistics, and self-driving vehicles.",
            "key_points": [
                "Nvidia and Boston Dynamics are collaborating on robotics and autonomous driving.",
                "The partnership leverages Nvidia's AI and Boston Dynamics' robot expertise.",
                "It is expected to lead to innovations in automation and self-driving tech."
            ]
        },
        {
            "headline": "China Achieves 'Breakthrough' Year in AI and Chips in 2025, Says President",
            "summary": "China's President declared 2025 a \"breakthrough\" year for the country in the fields of Artificial Intelligence and chip technology. This announcement underscores China's significant advancements and investments in these critical sectors, indicating its ambition to become a global leader and achieve technological self-sufficiency amidst international competition.",
            "key_points": [
                "China's President declared 2025 a \"breakthrough\" year for AI and chips.",
                "This highlights China's rapid advancements and investments in critical tech.",
                "The nation aims for global leadership and technological independence."
            ]
        }
    ],
    "Entertainment": [
        {
            "headline": "‘Avatar: Fire and Ash’ Dominates Box Office, Hollywood Sees Strong 2026 Start",
            "summary": "\"Avatar: Fire and Ash\" has reportedly dominated the global box office, crossing the $1 billion mark, signaling a robust start to Hollywood's performance in 2026. This cinematic success provides a significant boost to the film industry, setting a positive tone for the year ahead. The film's strong performance reflects continued audience interest in major blockbusters.",
            "key_points": [
                "\"Avatar: Fire and Ash\" crossed the $1 billion mark globally.",
                "This success marks a strong start for Hollywood in 2026.",
                "The film's performance indicates continued audience engagement with major releases."
            ]
        },
        {
            "headline": "Dhurandhar Movie Franchise Hits Milestone with Over Rs 1,200 Crore Worldwide",
            "summary": "Ranveer Singh starrer \"Dhurandhar\" has achieved a significant milestone, with its box office collection soaring past the Rs 1,200 crore mark worldwide. Despite mixed initial day collections for its latest installment, the franchise continues to demonstrate strong commercial success. The film's enduring popularity cements its place as one of India's highest-grossing productions.",
            "key_points": [
                "\"Dhurandhar\" movie franchise has earned over Rs 1,200 crore worldwide.",
                "The film maintains strong commercial success despite varied daily collections.",
                "It is poised to become one of India's top-grossing films."
            ]
        },
        {
            "headline": "Kartik Aaryan Sparks Dating Rumours After Unfollowing Teen Mystery Girl",
            "summary": "Bollywood actor Kartik Aaryan has fueled dating rumors after he was observed unfollowing a teen mystery girl on social media while holidaying in Goa. This unexpected online activity has sparked intense speculation among fans and media about the nature of their relationship and the reason behind his actions. The actor has not yet commented on the rumors.",
            "key_points": [
                "Kartik Aaryan's social media activity has sparked dating rumors.",
                "He unfollowed a \"mystery girl\" while in Goa.",
                "The incident has led to widespread speculation about his personal life."
            ]
        },
        {
            "headline": "Why Malayalam Cinema Lost Rs 530 Crore in 2025",
            "summary": "Malayalam cinema reportedly incurred significant losses amounting to Rs 530 crore in 2025, raising concerns within the industry about financial sustainability and production strategies. This substantial deficit indicates various challenges, potentially including audience reception, production costs, or distribution issues. Industry experts are analyzing the factors contributing to this decline.",
            "key_points": [
                "Malayalam cinema faced Rs 530 crore in losses in 2025.",
                "The significant deficit raises concerns about the industry's financial health.",
                "Reasons for the decline are being investigated by industry experts."
            ]
        },
        {
            "headline": "Timothée Chalamet and Kylie Jenner Publicly Display Affection at Critics Choice Awards",
            "summary": "Timothée Chalamet and Kylie Jenner made headlines by openly displaying affection at the Critics Choice Awards, confirming their romance in the spotlight. Their public appearance together at the prestigious event drew considerable attention from both media and fans, solidifying their status as a prominent celebrity couple.",
            "key_points": [
                "Timothée Chalamet and Kylie Jenner confirmed their relationship.",
                "They publicly displayed affection at the Critics Choice Awards.",
                "Their appearance generated significant media and fan attention."
            ]
        }
    ],
    "Sports": [
        {
            "headline": "Mustafizur Rahman Row: Bangladesh Bans IPL Broadcast Over 'Hurt' Sentiments",
            "summary": "The Bangladesh Cricket Board has banned the broadcast of the Indian Premier League (IPL) in the country following the 'Mustafizur row', citing 'hurt' sentiments. This controversial decision comes after an unspecified incident involving Bangladeshi cricketer Mustafizur Rahman, leading to a significant diplomatic and cricketing fallout between the two nations.",
            "key_points": [
                "Bangladesh banned IPL broadcast due to the 'Mustafizur row'.",
                "The decision was based on 'hurt' sentiments, leading to a diplomatic incident.",
                "This creates a significant cricketing fallout between Bangladesh and India."
            ]
        },
        {
            "headline": "Shreyas Iyer Tipped to Captain India to T20 World Cup Win: Stunning Prediction",
            "summary": "A stunning prediction has emerged, tipping Shreyas Iyer to captain India to victory in a future T20 World Cup. This bold claim has generated considerable buzz among cricket enthusiasts and analysts, highlighting Iyer's leadership potential and growing stature in Indian cricket. Such a prediction underscores the high hopes and expectations for his future role.",
            "key_points": [
                "Shreyas Iyer is predicted to lead India to a T20 World Cup title.",
                "The prediction has sparked significant discussion among cricket fans.",
                "It reflects high expectations for Iyer's future leadership in Indian cricket."
            ]
        },
        {
            "headline": "Neeraj Chopra's Diamond League Final: Event Preview and India Telecast Details",
            "summary": "Details for Neeraj Chopra's highly anticipated Diamond League Final event have been released, including a comprehensive preview and live telecast information for Indian viewers. Fans are eagerly awaiting to see the Olympic medalist compete on the global stage, with high expectations for his performance. The event will be a crucial test of his form ahead of major championships.",
            "key_points": [
                "Neeraj Chopra's Diamond League Final event details are public.",
                "Live telecast information for India is available for fans.",
                "High expectations surround the Olympic medalist's performance."
            ]
        },
        {
            "headline": "PM Modi Highlights Growing Popularity of Chess Among Indian Youth at FIDE WC",
            "summary": "Prime Minister Narendra Modi, speaking at the FIDE World Chess Championship in India, emphasized the increasing popularity of chess among the nation's youth. He highlighted the game's benefits for intellectual development and strategic thinking, advocating for its continued promotion across the country. Modi's remarks underscore the government's support for intellectual sports.",
            "key_points": [
                "PM Modi spoke at the FIDE World Chess Championship in India.",
                "He noted the growing popularity of chess among Indian youth.",
                "Modi emphasized the game's benefits for intellectual development."
            ]
        },
        {
            "headline": "From Hoops to Hollywood: NBA Players Transition to Silver Screen Success",
            "summary": "A growing number of NBA players are successfully transitioning from the basketball court to the silver screen, making notable appearances in Hollywood films and stealing the spotlight. This trend highlights the versatility and charisma of athletes beyond their sport, as they explore new avenues in entertainment. Their move into acting often draws significant fan interest.",
            "key_points": [
                "NBA players are increasingly making successful transitions into Hollywood.",
                "These athletes showcase versatility and charisma beyond basketball.",
                "Their acting careers often attract significant fan attention."
            ]
        }
    ],
    "Science": [
        {
            "headline": "How Certain Reptiles Give Birth Instead of Laying Eggs",
            "summary": "Scientists are studying a fascinating biological phenomenon where certain reptile species give birth to live young instead of laying eggs, a process known as viviparity. This evolutionary adaptation is often linked to specific environmental pressures, offering a survival advantage in colder climates. Understanding these reproductive strategies provides insights into the diversity of life.",
            "key_points": [
                "Some reptile species exhibit viviparity, giving birth to live young.",
                "This is an evolutionary adaptation, often linked to environmental factors.",
                "Viviparity offers survival advantages, particularly in colder climates."
            ]
        },
        {
            "headline": "Tiny Ancient Creature Had the Sharpest Teeth, Not Sharks or Dinosaurs",
            "summary": "New research indicates that neither sharks nor dinosaurs possessed the sharpest teeth in history; instead, this distinction belongs to a tiny ancient creature. This discovery challenges long-held beliefs about prehistoric predators and their dental adaptations. Further studies are underway to identify the creature and its ecological role.",
            "key_points": [
                "A tiny ancient creature, not sharks or dinosaurs, had the sharpest teeth.",
                "This discovery overturns previous understandings of prehistoric dental records.",
                "Research is ongoing to identify the creature and its ancient environment."
            ]
        },
        {
            "headline": "Healthy Coral Reefs Could Feed Millions Annually, Study Finds",
            "summary": "A new study reveals that thriving, healthy coral reefs possess the potential to feed millions of people every year, underscoring their critical role in global food security. The research highlights the immense biomass supported by these ecosystems, from fish to other marine life, which can sustain coastal communities. Protecting coral reefs is vital not just for biodiversity but also for human sustenance.",
            "key_points": [
                "Healthy coral reefs could provide food for millions annually.",
                "They are crucial for global food security, especially for coastal communities.",
                "Protecting these ecosystems is essential for both biodiversity and human sustenance."
            ]
        },
        {
            "headline": "Common Daisy Emerges as 'Visible Signal' of Climate Change",
            "summary": "The common daisy is increasingly being recognized as a \"visible signal\" of climate change, with its seasonal behavior and distribution offering clear indicators of environmental shifts. Researchers are studying how changes in temperature and weather patterns are affecting this widespread plant, making it a simple yet effective bio-indicator for broader ecological impacts.",
            "key_points": [
                "The common daisy is now considered a key indicator of climate change.",
                "Changes in its seasonal behavior reflect broader environmental shifts.",
                "It serves as an accessible bio-indicator for ecological impact studies."
            ]
        }
    ],
    "Health": [
        {
            "headline": "Jesy Nelson Reveals SMA1 Diagnosis, Doctors Warn of Lifelong Mobility Challenges for Twins",
            "summary": "Singer Jesy Nelson has publicly disclosed her diagnosis of Spinal Muscular Atrophy Type 1 (SMA1), a severe genetic condition. Doctors have warned that her potential twins may face lifelong mobility challenges if they also inherit the condition. This revelation brings crucial awareness to SMA1 and the importance of genetic screening and early intervention.",
            "key_points": [
                "Jesy Nelson announced her SMA1 diagnosis.",
                "Doctors warned her potential twins could face lifelong mobility issues if affected.",
                "The disclosure raises awareness for SMA1, genetic screening, and early intervention."
            ]
        },
        {
            "headline": "Isabgol vs. Chia Seeds: Which Gut Hero Reigns for Digestion and Health?",
            "summary": "A comparison of Isabgol and chia seeds investigates which \"gut hero\" truly offers superior benefits for digestion and overall health. Both are renowned for their fiber content and digestive support, but their distinct nutritional profiles and properties are being examined to determine optimal use. The article guides consumers on making informed choices based on their health needs.",
            "key_points": [
                "The article compares Isabgol and chia seeds for digestive health benefits.",
                "Both are high in fiber, but have distinct nutritional profiles.",
                "It helps consumers choose based on their specific health requirements."
            ]
        },
        {
            "headline": "Neeraj Chopra's Road to Recovery: Understanding Javelin Star's Back Injury and Recurrence Risk",
            "summary": "Olympic javelin medalist Neeraj Chopra is on a road to recovery from a back injury, raising concerns about his return to competitive sport. Understanding the nature of his injury and the risks associated with a rushed return is crucial for his long-term career. Medical experts advise careful rehabilitation to prevent recurrence and ensure his sustained performance at the elite level.",
            "key_points": [
                "Neeraj Chopra is recovering from a back injury.",
                "A rushed return to sport carries significant risks of recurrence.",
                "Careful rehabilitation is essential for his long-term career."
            ]
        },
        {
            "headline": "How AI is Transforming Healthcare in Europe: Five Key Innovations",
            "summary": "Artificial Intelligence is rapidly transforming healthcare across Europe, with five key innovations highlighting its profound impact in 2025. These advancements range from enhanced diagnostics and personalized treatment plans to predictive analytics for disease outbreaks and administrative efficiency. AI is poised to revolutionize patient care, medical research, and public health management.",
            "key_points": [
                "AI is revolutionizing European healthcare through five key innovations.",
                "Impacts include improved diagnostics, personalized treatments, and predictive analytics.",
                "AI promises to transform patient care, research, and public health management."
            ]
        },
        {
            "headline": "Indore Waterborne Outbreak Declared Epidemic, Supply Shut Down",
            "summary": "A severe waterborne outbreak in Indore has officially been declared an epidemic, leading authorities to shut down the water supply to mitigate further spread. With 142 patients already hospitalized and new cases of diarrhea detected, emergency measures are in place, including extensive chlorination efforts. The situation underscores critical public health challenges.",
            "key_points": [
                "Indore is experiencing a waterborne outbreak, now declared an epidemic.",
                "The water supply has been shut down to control the spread.",
                "Many patients are hospitalized, and emergency chlorination is underway."
            ]
        }
    ]
}