{
    "World": [
        {
            "headline": "Uttarakhand Train Collision: 60 Injured in Hydroelectric Project",
            "summary": "Two loco trains collided within the Vishnugad-Pipalkoti hydroelectric project in Uttarakhand, resulting in injuries to 60 people. The incident occurred inside a tunnel, prompting an emergency response and highlighting safety concerns in industrial projects.",
            "key_points": [
                "Two loco trains collided inside a hydroelectric project tunnel.",
                "60 individuals sustained injuries in Uttarakhand.",
                "Incident highlights industrial safety concerns."
            ]
        },
        {
            "headline": "Tripura Youth's Family Challenges Uttarakhand Police on 'No Racism' Claim",
            "summary": "The family of a Tripura youth who died in Uttarakhand has questioned the police's statement dismissing racism as a factor in his death. They label the police's conclusions as 'premature' and demand a thorough investigation into potential racial bias.",
            "key_points": [
                "Family of deceased Tripura youth disputes police findings.",
                "Uttarakhand police dismissed racism as a factor in death.",
                "Family calls police statement 'premature' and seeks further probe."
            ]
        },
        {
            "headline": "Kin File Complaints Against Election Officials Over Bengal SIR Deaths",
            "summary": "Relatives of individuals who died under suspicious circumstances related to West Bengal's Special Investigation Report (SIR) have filed complaints against the Chief Election Commissioner and the state election body chief. The Election Commission of India has acknowledged and reacted to these serious allegations, indicating a formal inquiry may follow.",
            "key_points": [
                "Complaints filed against CEC and state poll chief.",
                "Allegations concern deaths following Bengal's SIR.",
                "Election Commission of India has reacted to the grievances."
            ]
        },
        {
            "headline": "CJI Calls for 'Approachable' People's Courts for Legal Emergencies",
            "summary": "Chief Justice of India Surya Kant has advocated for the establishment of 'approachable' people's courts to address legal emergencies effectively. He outlined this initiative as one of his key priorities, aiming to enhance accessibility to justice for all citizens.",
            "key_points": [
                "CJI Surya Kant wants accessible 'people's courts'.",
                "Aimed at providing swift justice in legal emergencies.",
                "Initiative is a key priority for the Chief Justice."
            ]
        },
        {
            "headline": "Jalpaiguri Mourns Khaleda Zia, Bangladesh's Ex-PM Born in Bengal",
            "summary": "The town of Jalpaiguri in West Bengal is in mourning following the death of Khaleda Zia, the former Prime Minister of Bangladesh. Zia, a significant political figure, was born in this Indian town, creating a unique cross-border connection and sense of loss.",
            "key_points": [
                "Khaleda Zia, former Bangladesh PM, has passed away.",
                "She was born in Jalpaiguri, West Bengal, India.",
                "The Indian town is mourning her death due to local ties."
            ]
        },
        {
            "headline": "ICE Arrests 'Worst of the Worst' Criminal Illegal Aliens, Including Pakistani National",
            "summary": "U.S. Immigration and Customs Enforcement (ICE) has reported the arrest of several 'criminal illegal aliens,' described as the 'worst of the worst.' Among those detained is a Pakistani national, raising questions about the identities and backgrounds of the individuals involved and their legal status.",
            "key_points": [
                "ICE arrested 'criminal illegal aliens' in the US.",
                "A Pakistani national was among the detained.",
                "Individuals are described as the 'worst of the worst'."
            ]
        },
        {
            "headline": "UP Couple Imprisons, Starves Retired Railway Employee and Daughter for 5 Years",
            "summary": "A horrific case from Uttar Pradesh reveals how a retired railway employee and his daughter were confined and starved for five years by a servant couple driven by property greed. The daughter miraculously survived, while the father passed away, with gruesome details emerging of their emaciated state and extreme neglect.",
            "key_points": [
                "Retired railway employee and daughter were imprisoned for 5 years.",
                "Servant couple held them for property greed.",
                "Daughter survived; father passed away from starvation and neglect.",
                "Gory details of their ordeal have emerged."
            ]
        },
        {
            "headline": "Woman Sub-Inspector Shunted After Threatening Couple With Abusive Language",
            "summary": "A female Sub-Inspector has been shunted from her position after allegedly threatening a couple with highly abusive and vulgar language. The incident has sparked outrage and led to immediate disciplinary action against the officer, highlighting issues of police conduct.",
            "key_points": [
                "Woman SI threatened a couple with abusive language.",
                "The officer was subsequently shunted from her position.",
                "Incident sparked outrage and led to disciplinary action."
            ]
        },
        {
            "headline": "Somali-Run Daycares in Minnesota Accused of 'Massive Fraud'",
            "summary": "Somali-run daycares in Minnesota are facing intense scrutiny and accusations of 'massive fraud,' with claims that U.S. taxpayers have been cheated out of significant funds. Investigations are underway into alleged widespread financial irregularities within these establishments, pointing to systemic issues.",
            "key_points": [
                "Somali-run daycares in Minnesota are under investigation.",
                "Accused of 'massive fraud' and cheating US taxpayers.",
                "Investigations target widespread financial irregularities."
            ]
        },
        {
            "headline": "Iran Warns US of 'Regret-Inducing Response' After Accepting Trump's Strike Challenge",
            "summary": "Iran has reportedly accepted a 'strike challenge' from former US President Donald Trump and has issued a stern warning to the United States, promising a 'regret-inducing response.' Tensions between the two nations appear to be escalating following these statements, raising concerns about regional stability.",
            "key_points": [
                "Iran accepted Trump's 'strike challenge'.",
                "Warned US of a 'regret-inducing response'.",
                "Indicates escalating tensions between the nations."
            ]
        },
        {
            "headline": "Somali Envoy Publicly Insults Israel at UN Following Somaliland Recognition Bid",
            "summary": "A Somali envoy publicly insulted Israel at the United Nations, an act that followed Israeli Prime Minister Netanyahu's contentious move to recognize Somaliland. The incident highlights escalating diplomatic friction and the sensitive nature of regional political shifts and alliances.",
            "key_points": [
                "Somali envoy publicly insulted Israel at the UN.",
                "Follows Netanyahu's move to recognize Somaliland.",
                "Highlights escalating diplomatic tensions."
            ]
        },
        {
            "headline": "First US Strike Inside Venezuela Targets 'Drug Port' in Secret CIA Operation",
            "summary": "The U.S. has reportedly conducted its first strike inside Venezuela, with the CIA allegedly bombing a 'drug port' in a secret operation. Former President Donald Trump seemingly confirmed the attack, indicating a significant, clandestine shift in US foreign policy towards the region and a potential escalation.",
            "key_points": [
                "First known US strike occurred inside Venezuela.",
                "CIA allegedly bombed a 'drug port' in a secret operation.",
                "Former President Trump reportedly confirmed the attack."
            ]
        },
        {
            "headline": "Persistent Racism Against Northeast Indians: A Deep-Rooted Issue",
            "summary": "Despite ongoing efforts, racism against individuals from Northeast India continues to be a pervasive problem, with many still struggling to assert their Indian identity in other parts of the country. The article explores the deep-rooted reasons why this form of discrimination persists, calling for greater social integration and awareness.",
            "key_points": [
                "Racism against Northeast Indians remains prevalent.",
                "Many struggle to assert their Indian identity.",
                "Article explores deep-rooted causes of this discrimination."
            ]
        },
        {
            "headline": "Assam Police Busts Terror Cell Linked to Bangladesh, 11 Arrested",
            "summary": "The Assam Police have successfully busted a terror cell suspected of radicalizing youths and having links to Bangladesh, leading to the arrest of 11 individuals. This operation represents a significant blow against extremist activities in the region, enhancing security measures.",
            "key_points": [
                "Assam Police dismantled a terror cell.",
                "Cell was radicalizing youths and linked to Bangladesh.",
                "11 individuals have been arrested in the operation."
            ]
        },
        {
            "headline": "PM Modi States 2025 Will Be Remembered for India's Reform Focus",
            "summary": "Prime Minister Narendra Modi declared that 2025 would be notably remembered for India's dedicated focus on implementing key reforms across various sectors. His statement underscores the government's unwavering commitment to structural changes and progressive policies for national development.",
            "key_points": [
                "PM Modi highlighted 2025 as a year of reforms for India.",
                "Emphasizes government's commitment to structural changes.",
                "Suggests progressive policies in various sectors of the economy."
            ]
        },
        {
            "headline": "Experts Hail PM Modi's Condemnation of Ukrainian Attack on Putin's Residence Crucial",
            "summary": "Experts are emphasizing the critical importance of Prime Minister Modi's condemnation of the alleged Ukrainian attack on Russian President Putin's residence. They view his stance as a significant diplomatic move amid escalating international tensions, signaling India's position on the conflict.",
            "key_points": [
                "PM Modi condemned alleged Ukrainian attack on Putin's residence.",
                "Experts deem Modi's condemnation 'crucial'.",
                "Highlights diplomatic significance amid international tensions."
            ]
        },
        {
            "headline": "Pakistani PM: Attack on Putin's Residence Threatens Peace",
            "summary": "The Pakistani Prime Minister has stated that the alleged attack on Russian President Putin's residence poses a serious threat to regional and global peace. His comments underscore international concerns regarding the escalation of conflict and calls for de-escalation.",
            "key_points": [
                "Pakistani PM commented on the attack on Putin's residence.",
                "Called it a 'serious threat to peace'.",
                "Highlights international concern over conflict escalation."
            ]
        },
        {
            "headline": "Russian Forces Advance Deep into Enemy Defenses, Says General Gerasimov",
            "summary": "General Staff Chief Gerasimov has reported that Russian forces are advancing deeply into enemy defenses, indicating significant military gains in the ongoing conflict. This statement suggests a shift in the conflict dynamics and continued Russian offensive operations.",
            "key_points": [
                "General Gerasimov reports deep Russian advances.",
                "Indicates significant military gains in conflict.",
                "Suggests continued offensive operations by Russian forces."
            ]
        },
        {
            "headline": "Kremlin Announces Imminent Putin-Trump Phone Call",
            "summary": "The Kremlin has announced that a new phone call between Russian President Vladimir Putin and former US President Donald Trump is set to take place in the very near future. This development signals ongoing diplomatic engagement or renewed communication between the two leaders amidst complex global dynamics.",
            "key_points": [
                "Kremlin announced upcoming Putin-Trump phone call.",
                "Call expected in the very near future.",
                "Signals ongoing diplomatic communication between leaders."
            ]
        },
        {
            "headline": "Russian Mission to UN Claims UN Leadership Discredited on Ukraine",
            "summary": "The Russian Mission to the UN has asserted that the United Nations leadership has long discredited itself concerning the conflict in Ukraine. This statement reflects Russia's critical view of the UN's role and effectiveness in addressing the ongoing crisis, intensifying diplomatic tensions.",
            "key_points": [
                "Russian Mission criticizes UN leadership.",
                "Claims UN discredited itself on the Ukraine issue.",
                "Reflects Russia's critical view of the UN's effectiveness."
            ]
        },
        {
            "headline": "Russian MoD: 89 Ukrainian Drones Destroyed by Air Defence",
            "summary": "Russia's Ministry of Defence (MoD) has reported that its air defence systems successfully destroyed 89 Ukrainian drones. This claim highlights the intensity of the ongoing aerial conflict and Russia's defensive capabilities against drone attacks.",
            "key_points": [
                "Russian MoD reports destruction of 89 Ukrainian drones.",
                "Highlights intense aerial conflict.",
                "Showcases Russian air defense capabilities."
            ]
        },
        {
            "headline": "Zaporozhye NPP Director Reports Regular Threats from Ukraine",
            "summary": "The director of the Zaporozhye Nuclear Power Plant has stated that its employees are regularly receiving threats from Ukraine. These allegations raise serious concerns about the safety and security of the facility and its personnel amidst the ongoing conflict, urging international attention.",
            "key_points": [
                "Zaporozhye NPP employees face regular threats.",
                "Allegations made by the plant's director.",
                "Raises concerns about plant safety and personnel security."
            ]
        },
        {
            "headline": "Venezuela Reaffirms Support for Somalia’s Territorial Integrity",
            "summary": "Venezuela has publicly reaffirmed its support for Somalia's territorial integrity, a move that comes amidst international discussions and disputes concerning the region. This statement highlights Venezuela's diplomatic stance on the matter, aligning with certain international actors.",
            "key_points": [
                "Venezuela publicly supports Somalia's territorial integrity.",
                "Comes amidst international discussions and disputes.",
                "Highlights Venezuela's diplomatic stance on the issue."
            ]
        },
        {
            "headline": "Russian Army Strikes Ukrainian Military-Linked Energy Facilities",
            "summary": "The Russian Ministry of Defence (MoD) has reported that its army has conducted strikes on energy facilities in Ukraine that are linked to its military operations. This targeting of infrastructure signifies a continuation of the conflict's strategic objectives to disrupt enemy capabilities.",
            "key_points": [
                "Russian Army struck Ukrainian energy facilities.",
                "Facilities reportedly linked to military operations.",
                "Indicates continued strategic targeting in the conflict."
            ]
        },
        {
            "headline": "Seizure of Russian Assets by EU Will Hasten 'De-Euroisation', Says BJP Politician",
            "summary": "A BJP politician has warned that the European Union's seizure of Russian assets will accelerate a process of 'de-Euroisation,' suggesting a shift away from the euro in international financial systems. This statement reflects concerns over the geopolitical consequences of such actions on global economic order.",
            "key_points": [
                "BJP politician warns against EU seizure of Russian assets.",
                "Predicts acceleration of 'de-Euroisation'.",
                "Highlights geopolitical consequences for global financial systems."
            ]
        },
        {
            "headline": "Von der Leyen Urges Ukraine EU Accession as Russia Obstructs Talks",
            "summary": "Ursula von der Leyen is strongly advocating for Ukraine's accession to the EU, even as Russia actively derails diplomatic talks. This push for membership is presented as part of a comprehensive security guarantee package for Kyiv, aiming to solidify its future within Europe.",
            "key_points": [
                "Von der Leyen supports Ukraine's EU accession.",
                "Russia is disrupting ongoing peace talks.",
                "Accession is seen as part of security guarantees for Kyiv."
            ]
        },
        {
            "headline": "Thieves Drill into German Bank Vault, Stealing Millions",
            "summary": "In a sophisticated heist, thieves successfully drilled into a German bank vault and stole millions of euros. The incident highlights vulnerabilities in banking security and the elaborate methods employed by criminals, prompting increased security reviews.",
            "key_points": [
                "Thieves broke into a German bank vault.",
                "Millions of euros were stolen in the heist.",
                "Highlights sophisticated criminal methods and security gaps."
            ]
        },
        {
            "headline": "Italy Cable Car Crash Injures Six, Evacuates 100",
            "summary": "A cable car crash in Italy has resulted in at least six injuries and necessitated the evacuation of 100 people. Emergency services responded swiftly to the incident, working to ensure the safety of those affected and investigate the cause.",
            "key_points": [
                "Cable car crash occurred in Italy.",
                "Six people were injured; 100 were evacuated.",
                "Emergency services responded and are investigating."
            ]
        },
        {
            "headline": "Channel Tunnel Partially Reopens, Eurostar Advises Travel Delays",
            "summary": "The Channel Tunnel has partially reopened following an incident, but Eurostar is still advising passengers to expect delayed travel. Disruptions continue as services gradually resume and recovery efforts are underway, impacting cross-channel commuters.",
            "key_points": [
                "Channel Tunnel partially reopened after an incident.",
                "Eurostar advises passengers to expect travel delays.",
                "Disruptions continue as services slowly resume."
            ]
        },
        {
            "headline": "Syria Unveils New Banknotes Without al-Assad's Image",
            "summary": "Syria has introduced new banknotes, notably removing images of Bashar al-Assad from the currency. This symbolic change could reflect internal political shifts or an attempt to rebrand the nation's image amidst ongoing conflicts and international pressure.",
            "key_points": [
                "Syria introduced new banknotes.",
                "Images of Bashar al-Assad are removed from currency.",
                "Suggests symbolic political change or re-branding effort."
            ]
        },
        {
            "headline": "Afghan Farmers Face Major Losses Following Opium Poppy Ban",
            "summary": "A new report indicates that Afghan farmers are experiencing significant economic losses after the implementation of an opium poppy cultivation ban. The prohibition has severely impacted their livelihoods, leading to widespread hardship and calls for alternative crop support.",
            "key_points": [
                "Afghan farmers suffer major economic losses.",
                "Due to the opium poppy cultivation ban.",
                "Prohibition severely impacts their livelihoods and causes hardship."
            ]
        },
        {
            "headline": "Israel to Halt Operations of Certain Aid Groups in Gaza by 2026",
            "summary": "Israel has announced its intention to halt the operations of some aid groups in Gaza starting in 2026. This decision raises concerns about humanitarian assistance in the region and could significantly impact aid delivery to vulnerable populations.",
            "key_points": [
                "Israel will cease some aid group operations in Gaza.",
                "Decision effective from 2026.",
                "Raises concerns about humanitarian aid delivery in the region."
            ]
        },
        {
            "headline": "Turkey Detains 357 Suspects in Crackdown on Islamic State",
            "summary": "Turkey has apprehended 357 suspects as part of a widening crackdown on the Islamic State jihadist group across the country. This large-scale operation underscores Turkey's commitment to counter-terrorism efforts and its resolve against extremist threats.",
            "key_points": [
                "Turkey detained 357 suspects in a nationwide operation.",
                "Crackdown targets the Islamic State jihadist group.",
                "Underscores Turkey's commitment to counter-terrorism."
            ]
        },
        {
            "headline": "Russia Displays Nuclear-Capable Oreshnik Missile System in Belarus",
            "summary": "Russia has publicly showcased its nuclear-capable Oreshnik missile system in Belarus, a move likely intended to send a strong geopolitical message to the West. This display raises concerns about regional stability and military posturing in Eastern Europe.",
            "key_points": [
                "Russia displayed Oreshnik missile system in Belarus.",
                "The missile system is nuclear-capable.",
                "Aims to send a strong geopolitical message to the West."
            ]
        }
    ],
    "Business": [
        {
            "headline": "SIPs Thrive in 2025: Are They Still Optimal for MF Investments?",
            "summary": "Systematic Investment Plans (SIPs) have seen a boom in 2025, attracting significant investor interest and capital. However, questions are being raised about whether SIPs remain the most effective and optimal strategy for investing in mutual funds, despite their widespread popularity.",
            "key_points": [
                "SIPs were highly popular and thriving in 2025.",
                "Article questions if they are still the best MF investment method.",
                "Examines the optimal strategy for mutual fund investments."
            ]
        },
        {
            "headline": "Top Stock Recommendations for December 31",
            "summary": "An updated list of top stock recommendations for December 31st has been released, providing investors with potential buying opportunities. These recommendations aim to guide individuals in making informed investment decisions before the year's end.",
            "key_points": [
                "List of top stock recommendations available.",
                "Recommendations specifically for December 31.",
                "Aims to guide investors' buying decisions."
            ]
        },
        {
            "headline": "Government Ends Subsidy for Electric Three-Wheelers After Meeting Targets",
            "summary": "The government has announced the cessation of subsidies for electric three-wheelers, stating that it has successfully met its established targets for promotion and adoption. This move signifies a shift in policy, as the initial relief program concludes, indicating market maturity.",
            "key_points": [
                "Government stops subsidies for electric three-wheelers.",
                "Decision follows meeting of promotional targets.",
                "Marks an end to the relief program for the sector."
            ]
        },
        {
            "headline": "Watch Business Projected to Reach $1 Billion in Revenue",
            "summary": "The watch manufacturing and sales industry is on track to achieve a significant milestone, projected to clock $1 billion in revenue. This forecast indicates robust growth and strong market performance within the sector, driven by consumer demand.",
            "key_points": [
                "Watch business expected to hit $1 billion revenue.",
                "Indicates strong growth in the sector.",
                "Positive market performance projection for the industry."
            ]
        },
        {
            "headline": "Adani Defence Aims to Fill India's AWACS Gap",
            "summary": "Adani Defence is reportedly targeting the critical gap in India's Airborne Warning and Control System (AWACS) capabilities, aiming to provide indigenous solutions. This strategic move could significantly enhance India's aerial surveillance and defense readiness, reducing reliance on foreign suppliers.",
            "key_points": [
                "Adani Defence targets India's AWACS deficit.",
                "Aims to provide indigenous defense solutions.",
                "Could boost India's aerial surveillance and defense readiness."
            ]
        },
        {
            "headline": "Indo-Russian Tech Cooperation: Growing Importance Amid Geopolitical Shifts",
            "summary": "The article delves into why technological cooperation between India and Russia has become more crucial than ever in the current geopolitical landscape. It explores the strategic benefits and mutual interests driving this enhanced collaboration, particularly in defense and space.",
            "key_points": [
                "Highlights increasing importance of Indo-Russian tech cooperation.",
                "Driven by current geopolitical shifts and global dynamics.",
                "Explores strategic benefits and mutual interests for both nations."
            ]
        },
        {
            "headline": "Global Trade Cracks Under Tariffs and China Shock in 2025",
            "summary": "The year 2025 saw global trade experiencing significant strain, cracking under the weight of escalating tariffs and a new 'China shock'. These factors contributed to instability and shifts in international economic dynamics, forcing companies to re-evaluate supply chains.",
            "key_points": [
                "Global trade faced significant strain in 2025.",
                "Impacted by rising tariffs and trade wars.",
                "Affected by a 'new China shock' in the global economy."
            ]
        }
    ],
    "Technology": [
        {
            "headline": "HAL Unveils India's Next-Generation Civil Helicopter",
            "summary": "Hindustan Aeronautics Limited (HAL) has officially unveiled India's next-generation civil helicopter, marking a significant advancement in indigenous aviation technology. This development aims to boost domestic capabilities in the civil aviation sector, reducing reliance on imports.",
            "key_points": [
                "HAL unveiled a new civil helicopter for India.",
                "Represents a significant advancement in indigenous aviation technology.",
                "Aims to boost domestic civil aviation capabilities."
            ]
        },
        {
            "headline": "2025: The Year Reviewed Through the Lens of AI",
            "summary": "This article provides a retrospective on the year 2025, analyzing key events and trends through the perspective of Artificial Intelligence. It explores how AI influenced developments and how its capabilities were perceived throughout the year, impacting various industries.",
            "key_points": [
                "Reviews 2025 using an AI-centric perspective.",
                "Analyzes key events and trends influenced by AI.",
                "Explores AI's impact and perception throughout the year."
            ]
        },
        {
            "headline": "Russia's Latest Weapons Spark Global Concern",
            "summary": "This article explores Russia's newest weapon systems, detailing how their development and deployment are putting the world on edge. It discusses the strategic implications and potential impact on global security, prompting international reactions and defense reassessments.",
            "key_points": [
                "Examines Russia's latest weapon systems.",
                "Discusses their impact on global security.",
                "Highlights strategic implications and international concern."
            ]
        },
        {
            "headline": "The Internet's Future in 2026: Addressing 'AI Slop'",
            "summary": "This article explores the future trajectory of the internet in 2026, particularly in light of the phenomenon termed 'AI slop' – low-quality AI-generated content. It delves into how artificial intelligence is shaping online content and user experience, raising questions about quality and authenticity.",
            "key_points": [
                "Examines the internet's direction in 2026.",
                "Focuses on the impact of 'AI slop' (low-quality AI content).",
                "Raises questions about content quality and authenticity online."
            ]
        },
        {
            "headline": "How Age Verification and 'AI Slop' Redefined Social Media in 2025",
            "summary": "The year 2025 marked a significant redefinition of social media, driven by advancements in age verification and the rise of 'AI slop' content. These factors reshaped user experience, content creation, and platform regulations, impacting online safety and quality.",
            "key_points": [
                "Social media was redefined in 2025.",
                "Key factors were age verification and 'AI slop'.",
                "Reshaped user experience, content creation, and platform regulations."
            ]
        }
    ],
    "Entertainment": [
        {
            "headline": "Ranveer Singh's 'Dhurandhar' Nears Rs 1,100 Crore Mark at Box Office",
            "summary": "Ranveer Singh's latest film, 'Dhurandhar,' is on track to cross the impressive Rs 1,100 crore mark at the box office after 26 days. The movie continues its strong performance, cementing its status as a major commercial success in Indian cinema and a blockbuster hit.",
            "key_points": [
                "'Dhurandhar' box office collection is soaring.",
                "Expected to surpass Rs 1,100 crore mark.",
                "Ranveer Singh starrer is a major commercial success."
            ]
        },
        {
            "headline": "Priyanka Gandhi's Son Raihan Engaged to Aviva Baig",
            "summary": "Raihan, son of prominent political figure Priyanka Gandhi Vadra, has announced his engagement to his long-time girlfriend, Aviva Baig. The news marks a personal milestone for the family, garnering attention from the public and media alike.",
            "key_points": [
                "Priyanka Gandhi Vadra's son, Raihan, is engaged.",
                "His fiancée is Aviva Baig, his long-time girlfriend.",
                "The engagement marks a personal milestone for the political family."
            ]
        },
        {
            "headline": "Hina Khan Discusses Evolving Idea of Intimacy in Long-Term Relationship",
            "summary": "Actress Hina Khan has shared her perspective on intimacy after 13 years with Rocky Jaiswal, stating that physical intimacy can sometimes take a backseat in a relationship. She emphasizes the evolving nature of connection over time, highlighting emotional bonds.",
            "key_points": [
                "Hina Khan discusses intimacy in her 13-year relationship.",
                "Notes physical intimacy can take a backseat over time.",
                "Emphasizes the evolving dynamics of long-term relationships."
            ]
        },
        {
            "headline": "Indian Cinema in 2026: Expectations and Aspirations",
            "summary": "This article offers a glimpse into what Indian cinema might bring in 2026, outlining anticipated trends and expressing hopes for its future direction. It covers potential shifts in storytelling, technology, and industry dynamics, predicting exciting changes.",
            "key_points": [
                "Discusses future trends for Indian cinema in 2026.",
                "Highlights expectations and aspirations for the industry.",
                "Covers potential shifts in storytelling and technology."
            ]
        },
        {
            "headline": "George and Amal Clooney Officially Become French Citizens",
            "summary": "Hollywood power couple George and Amal Clooney have officially become French citizens, embracing their new nationality. This move is significant for the celebrity couple and their growing connection to France, adding a new chapter to their lives.",
            "key_points": [
                "George and Amal Clooney are now French citizens.",
                "The move is significant for the celebrity couple.",
                "Strengthens their ties and connection to France."
            ]
        },
        {
            "headline": "Taylor Swift Gifts $600 to Kansas City Chiefs Game Staff for Christmas",
            "summary": "Pop superstar Taylor Swift showed her generosity by gifting $600 to each member of the Kansas City Chiefs game staff during Christmas. This gesture highlights her appreciation for the behind-the-scenes personnel who contribute to game day operations.",
            "key_points": [
                "Taylor Swift gave gifts to Chiefs game staff.",
                "Each staff member received $600 for Christmas.",
                "Gesture highlights her appreciation for their work."
            ]
        },
        {
            "headline": "South Korean Beauty Creator Daddoa Dies at 29, Shocking Global Fans",
            "summary": "Popular South Korean beauty creator Daddoa has passed away at the age of 29, leaving her millions of fans worldwide in shock and mourning. Her untimely death has prompted an outpouring of tributes from the global online community, highlighting her influence.",
            "key_points": [
                "South Korean beauty creator Daddoa died at age 29.",
                "Her death shocked fans across the world.",
                "Received an outpouring of tributes from the online community."
            ]
        }
    ],
    "Sports": [
        {
            "headline": "Four Indians Make Cricket Australia's Test XI of 2025",
            "summary": "Cricket Australia has announced its Test XI for 2025, featuring four Indian players, notably excluding prominent names like Yashasvi Jaiswal or Mohammed Siraj. The inclusion highlights their exceptional performance in the format over the year and their growing international recognition.",
            "key_points": [
                "Cricket Australia released its Test XI for 2025.",
                "Four Indian players were included in the list.",
                "Notable omissions include Yashasvi Jaiswal and Mohammed Siraj."
            ]
        },
        {
            "headline": "Shreyas Iyer Predicted to Lead India to World Cup Victory",
            "summary": "A stunning prediction suggests that Shreyas Iyer has the potential to captain India to a World Cup win in the future. This forecast highlights his leadership qualities and cricketing prowess, sparking excitement among fans and experts alike.",
            "key_points": [
                "Shreyas Iyer is predicted to captain India to a World Cup win.",
                "Highlights his leadership potential and cricketing prowess.",
                "Prediction sparks excitement among cricket fans."
            ]
        },
        {
            "headline": "Cricketers Who Courageously Battled Cancer",
            "summary": "This article profiles cricketers, including Michael Clarke and Yuvraj Singh, who have bravely battled cancer with remarkable courage and resilience. It celebrates their strength and the inspiration they provided both on and off the field in their fight against the disease.",
            "key_points": [
                "Profiles cricketers who fought cancer.",
                "Mentions Michael Clarke and Yuvraj Singh.",
                "Celebrates their resilience and courage in their battle."
            ]
        },
        {
            "headline": "Tendulkar Reveals His Favorite Bowler Among 201 Wicket Takers",
            "summary": "Sachin Tendulkar has revealed his favorite bowler out of the 201 players against whom he took wickets, a choice that might surprise many cricket enthusiasts. This insight offers a unique perspective from the legendary batsman's illustrious career.",
            "key_points": [
                "Sachin Tendulkar named his favorite bowler.",
                "The choice is among 201 wicket-takers he faced.",
                "Offers a surprising insight from the legendary batsman."
            ]
        },
        {
            "headline": "Indian-Origin Jatinder Singh to Captain Oman in Asia Cup 2025",
            "summary": "Indian-origin cricketer Jatinder Singh has been named the captain of the Oman national team for the upcoming Asia Cup 2025. This appointment is a significant moment for both Singh and Oman cricket, marking a key leadership role.",
            "key_points": [
                "Jatinder Singh will captain Oman in Asia Cup 2025.",
                "He is of Indian origin.",
                "This is a significant appointment for Oman cricket."
            ]
        },
        {
            "headline": "PM Modi Highlights Growing Popularity of Chess Among Indian Youth",
            "summary": "Prime Minister Narendra Modi has observed that chess is experiencing a surge in popularity among India's youth, attributing this to various initiatives and increasing awareness. His statement underscores the government's recognition of intellectual sports and their developmental benefits.",
            "key_points": [
                "PM Modi notes chess popularity among Indian youth.",
                "Attributed to various initiatives and increasing awareness.",
                "Highlights government's recognition of intellectual sports."
            ]
        },
        {
            "headline": "Ramandeep Singh's Journey from Chandigarh to Team India via KKR",
            "summary": "This article chronicles the inspiring 'gully to glory' journey of cricketer Ramandeep Singh, detailing his path from playing in Chandigarh to securing a spot in Team India, with a notable stint at Kolkata Knight Riders (KKR). It highlights his perseverance and rise in professional cricket.",
            "key_points": [
                "Profiles cricketer Ramandeep Singh's journey.",
                "Traces his path from Chandigarh to Team India.",
                "Highlights his professional rise via Kolkata Knight Riders (KKR)."
            ]
        },
        {
            "headline": "Virender Sehwag Faces Backlash for Promoting India vs Pakistan Match",
            "summary": "Former cricketer Virender Sehwag is reportedly facing criticism for promoting an India vs. Pakistan match, with some netizens invoking the memory of 'Pahalgam.' The controversy highlights the sensitive political undertones often associated with sporting events between the two nations.",
            "key_points": [
                "Virender Sehwag criticized for promoting IND vs PAK match.",
                "Backlash linked to 'Pahalgam' memory.",
                "Highlights political sensitivity in sports events."
            ]
        },
        {
            "headline": "Sarfaraz Khan Sends Strong Message to Selectors with Consecutive Centuries",
            "summary": "Cricketer Sarfaraz Khan is 'on fire,' having scored back-to-back centuries, which is sending a powerful message to the national selectors. His consistent performance in domestic cricket intensifies calls for his inclusion in the national team, making a strong case.",
            "key_points": [
                "Sarfaraz Khan scored consecutive centuries.",
                "Performance sends a strong message to selectors.",
                "Intensifies calls for his national team inclusion."
            ]
        }
    ],
    "Science": [
        {
            "headline": "Rosatom Delivers First Fuel Batch for Kudankulam NPP Unit 3",
            "summary": "Rosatom, the Russian state atomic energy corporation, has completed the delivery of the first batch of nuclear fuel for Unit 3 of India's Kudankulam Nuclear Power Plant. This marks a crucial step forward in the plant's operational readiness and Indo-Russian cooperation in nuclear energy.",
            "key_points": [
                "Rosatom delivered nuclear fuel for Kudankulam NPP Unit 3.",
                "First batch of fuel successfully delivered to India.",
                "Crucial for plant's operational readiness and Indo-Russian cooperation."
            ]
        },
        {
            "headline": "Russia Launches 52 Satellites into Orbit with Soyuz Rocket",
            "summary": "Russia successfully launched a Soyuz rocket from the Vostochny Cosmodrome, placing 52 satellites into orbit. This mission marks a significant achievement in Russia's space program, contributing to its satellite deployment capabilities and expanding its space infrastructure.",
            "key_points": [
                "Russia launched Soyuz rocket from Vostochny Cosmodrome.",
                "Successfully placed 52 satellites into orbit.",
                "Significant achievement for Russia's space program."
            ]
        },
        {
            "headline": "Space in 2026: Anticipating Moon Missions, Eclipses, and Auroras",
            "summary": "This article previews the exciting events expected in space exploration and observation in 2026, including planned moon missions, celestial eclipses, and visible auroras. It offers a glimpse into the astronomical calendar for the coming year, promising spectacular cosmic phenomena.",
            "key_points": [
                "Previews space events for 2026.",
                "Includes planned moon missions and celestial eclipses.",
                "Highlights opportunities for observing auroras."
            ]
        },
        {
            "headline": "Russia Launches Iranian Satellites into Orbit",
            "summary": "Iranian state media has reported that Russia successfully launched Iranian satellites into orbit, signifying a deepening of space cooperation between the two nations. This collaboration potentially boosts Iran's satellite capabilities for various applications.",
            "key_points": [
                "Russia launched Iranian satellites into orbit.",
                "Reported by Iranian state media.",
                "Highlights growing space cooperation between Russia and Iran."
            ]
        }
    ],
    "Health": [
        {
            "headline": "Cooling Drinks May Worsen Winter Coughs and Colds, Warns Nutritionist",
            "summary": "A nutritionist expert has warned that certain cooling drinks, despite their perceived benefits, could exacerbate winter coughs and colds. The article reveals hidden risks associated with these beverages, advising caution during colder months to prevent worsening symptoms.",
            "key_points": [
                "Cooling drinks can worsen winter coughs and colds.",
                "Nutritionist expert reveals hidden risks.",
                "Advises caution when consuming such beverages in winter."
            ]
        },
        {
            "headline": "Heart Attack Warning Signs Can Appear Days or Weeks in Advance",
            "summary": "Contrary to popular belief, heart attacks often provide warning signs days or even weeks before they occur, rather than striking suddenly. Understanding these subtle precursors can be crucial for early intervention and improved outcomes, urging greater awareness.",
            "key_points": [
                "Heart attacks often have preceding warning signs.",
                "Symptoms can appear days or weeks before an event.",
                "Early recognition is vital for timely intervention and better outcomes."
            ]
        },
        {
            "headline": "Diabetes and Thyroid Management Through Integrated Wellness Care",
            "summary": "This article shares a patient's experience with managing diabetes and thyroid conditions through an integrated wellness care approach. It highlights the benefits of combining various therapies and lifestyle changes for comprehensive health management and improved well-being.",
            "key_points": [
                "Focuses on integrated wellness for diabetes and thyroid management.",
                "Shares a patient's personal experience.",
                "Emphasizes comprehensive health management through combined therapies."
            ]
        },
        {
            "headline": "Young Adults Grapple with Early Cancer Diagnosis",
            "summary": "The article highlights the shock and disbelief experienced by young adults, like a 32-year-old, when diagnosed with cancer. It underscores the changing demographic of cancer patients and the challenges faced by younger individuals confronting such a diagnosis.",
            "key_points": [
                "Highlights early cancer diagnoses in young adults.",
                "Focuses on the shock and disbelief of patients.",
                "Addresses changing cancer demographics and challenges for younger patients."
            ]
        },
        {
            "headline": "Reducing Salt Intake Simplest Way to Cut Stroke Risk",
            "summary": "Experts state that one of the simplest and most effective ways to significantly reduce the risk of stroke is by cutting down on salt in one's diet. This dietary adjustment can have a profound impact on cardiovascular health, promoting long-term well-being.",
            "key_points": [
                "Reducing salt intake lowers stroke risk.",
                "Considered the simplest effective method.",
                "Has a profound impact on cardiovascular health."
            ]
        },
        {
            "headline": "Five Ways AI Transformed Healthcare in Europe in 2025",
            "summary": "The article outlines five significant ways Artificial Intelligence transformed healthcare in Europe during 2025. It highlights innovations ranging from diagnostics to personalized treatment plans, showcasing AI's growing impact on medical practices and patient care.",
            "key_points": [
                "AI significantly transformed European healthcare in 2025.",
                "Innovations included enhanced diagnostics and personalized treatment.",
                "Showcases AI's growing impact on medical practices."
            ]
        },
        {
            "headline": "Envisioning a Healthy Reset for 2026",
            "summary": "The article explores what a comprehensive 'healthy reset' should entail for the year 2026, offering guidance on physical, mental, and emotional well-being. It provides insights and recommendations for individuals seeking to improve their health in the new year.",
            "key_points": [
                "Explores comprehensive 'healthy reset' for 2026.",
                "Offers guidance on physical, mental, and emotional well-being.",
                "Provides recommendations for health improvement in the new year."
            ]
        }
    ]
}