{
    "World": [
        {
            "headline": "Putin in India: ‘Defence ties to deepen despite US, EU opposition’; S-500 supply uncertain",
            "summary": "Russian President Putin's visit to India aims to deepen defense cooperation, despite objections from the US and EU. The supply of the advanced S-500 missile system remains a point of discussion, underscoring ongoing strategic partnerships.",
            "key_points": [
                "Putin's visit focuses on strengthening India-Russia defense ties.",
                "US and EU oppose deeper defense cooperation between the two nations.",
                "Supply of the S-500 missile system is uncertain but under discussion."
            ]
        },
        {
            "headline": "LIVE UPDATES: Putin Arrives in New Delhi, Gives Bombshell Interview to Indian Journalists",
            "summary": "Russian President Vladimir Putin has arrived in New Delhi, with live updates covering his arrival and a \"bombshell\" interview given to Indian journalists. This visit is expected to significantly influence India-Russia bilateral relations and global perceptions.",
            "key_points": [
                "Putin arrived in New Delhi for a significant visit.",
                "Gave an important interview to Indian journalists.",
                "Visit expected to shape India-Russia bilateral relations."
            ]
        },
        {
            "headline": "Modi-Putin Bonhomie Evident During Visit; Leaders' Interactions Go Viral",
            "summary": "The strong camaraderie between Prime Minister Modi and President Putin was prominently displayed during the latter's visit, with their warm hugs, handshakes, and even a carpool ride garnering significant attention online. These interactions underscore the close ties between India and Russia on a personal and political level.",
            "key_points": [
                "Modi and Putin displayed strong bonhomie during the visit.",
                "Their interactions, including hugs and carpooling, went viral.",
                "Underscores close ties between India and Russia."
            ]
        },
        {
            "headline": "Putin Calls India Great Power That Cannot Be Treated Like British Colony",
            "summary": "Russian President Vladimir Putin lauded India as a great power that should not be treated like a former British colony, emphasizing its independent global standing. This statement acknowledges India's growing influence and self-reliance on the world stage, particularly in foreign policy decisions.",
            "key_points": [
                "Putin praised India as a great power.",
                "Stated India should not be treated as a British colony.",
                "Acknowledges India's independent global standing."
            ]
        },
        {
            "headline": "Modi-Putin Summit Underscores India’s Independent Foreign Policy: Expert",
            "summary": "An expert suggests that the Modi-Putin summit highlights India's steadfast refusal to conform to Western policies, showcasing its commitment to an independent foreign policy. This reinforces India's position as a sovereign global actor navigating complex international relations, prioritizing national interests.",
            "key_points": [
                "Modi-Putin summit highlights India's independent foreign policy.",
                "India refuses to conform to Western policies.",
                "Reinforces India's role as a sovereign global actor."
            ]
        },
        {
            "headline": "India, Russia to Sign Mobility and Economic Pacts During Putin's Visit",
            "summary": "India and Russia are expected to sign several agreements related to mobility and economic cooperation during President Putin's current visit. These pacts aim to streamline movement between the countries and bolster bilateral trade and investment, further solidifying their strategic partnership.",
            "key_points": [
                "India and Russia will sign mobility and economic pacts.",
                "Agreements to be finalized during Putin's visit.",
                "Aims to streamline movement and boost bilateral trade."
            ]
        },
        {
            "headline": "US Citizenship and Immigration Services (USCIS) Revises Work Permit Rules: Five Years to 18 Months",
            "summary": "The US Citizenship and Immigration Services (USCIS) is implementing new rules that may significantly reduce the validity period of immigrant work authorizations, potentially from five years down to 18 months. This change could have considerable implications for immigrants seeking to work in the United States, including a large Indian diaspora.",
            "key_points": [
                "USCIS is changing immigrant work authorization rules.",
                "Validity period may decrease from five years to 18 months.",
                "New rules will impact immigrants' ability to work in the US."
            ]
        },
        {
            "headline": "US Strike in Pacific Kills Four on Alleged Narco-Terror Boat",
            "summary": "A US military strike in the Pacific region resulted in the deaths of four individuals on a vessel identified as an alleged narco-terror boat. This operation highlights ongoing efforts by US forces to counter drug trafficking and terrorism at sea in critical international waters.",
            "key_points": [
                "US forces conducted a strike in the Pacific.",
                "Four people were killed on an alleged narco-terror boat.",
                "Operation targets drug trafficking and terrorism."
            ]
        },
        {
            "headline": "Israel-Backed Anti-Hamas Militia Leader Yasser Abu Shabab Killed in Gaza",
            "summary": "Yasser Abu Shabab, a leader of an Israel-backed militia operating against Hamas, was reportedly killed in Gaza. His death marks a significant event in the ongoing conflict dynamics within the region, potentially impacting anti-Hamas efforts and regional stability.",
            "key_points": [
                "Yasser Abu Shabab, anti-Hamas militia leader, was killed.",
                "His militia was backed by Israel.",
                "His death is significant in the Gaza conflict."
            ]
        },
        {
            "headline": "NATO Nation Cautions Europe: Putin's War May Shift to Black Sea",
            "summary": "A NATO nation has warned that Russia's war strategy might be shifting from the Ukraine front to the Black Sea, a development described as \"very frightening\" for Europe. This potential shift indicates a new phase in the conflict with broader regional and geopolitical implications, raising concerns for international security.",
            "key_points": [
                "NATO nation warns of a possible shift in Russia's war focus.",
                "The conflict might move to the Black Sea from the Ukraine front.",
                "This development is considered \"very frightening\" for Europe."
            ]
        },
        {
            "headline": "US Marines \"Storm\" Caribbean Amid Venezuela Invasion Speculation",
            "summary": "US Marines have reportedly deployed to the Caribbean, fueling speculation about a potential invasion of Venezuela and an \"all-out war\" scenario. This military movement suggests heightened tensions and a possible escalation in regional conflicts, drawing international attention.",
            "key_points": [
                "US Marines deployed to the Caribbean.",
                "Deployment fuels speculation of a Venezuela invasion.",
                "Indicates heightened regional tensions and potential escalation."
            ]
        },
        {
            "headline": "Hungary Accuses EU of \"Dumping Peace\" and Exerting Control Over Ukraine Decisions",
            "summary": "Hungary has strongly criticized the European Union, accusing it of \"dumping peace\" and asserting that \"Europeans are calling the shots in Ukraine.\" This statement underscores deep divisions within the EU regarding foreign policy and the conflict in Ukraine, challenging bloc unity.",
            "key_points": [
                "Hungary criticizes the EU over its approach to peace.",
                "Accuses EU of controlling Ukraine-related decisions.",
                "Highlights internal divisions within the EU on foreign policy."
            ]
        },
        {
            "headline": "Russian MoD Reports Destruction of 136 Ukrainian Drones Overnight",
            "summary": "Russia's Ministry of Defense announced that its air defense systems successfully destroyed 136 Ukrainian drones overnight. This signifies a large-scale drone attack and continued intense aerial warfare in the ongoing conflict, highlighting the technological aspect of modern combat.",
            "key_points": [
                "Russian air defenses destroyed 136 Ukrainian drones.",
                "Occurred overnight, indicating a large-scale attack.",
                "Highlights intense aerial warfare in the conflict."
            ]
        },
        {
            "headline": "Federica Mogherini Resigns Amid Fraud Probe at College of Europe",
            "summary": "Federica Mogherini, former EU foreign policy chief, has resigned as rector of the College of Europe following the initiation of a fraud probe. Her departure from the prestigious European affairs institution marks a significant development amid the ongoing investigation into alleged financial irregularities.",
            "key_points": [
                "Federica Mogherini resigned as College of Europe rector.",
                "Resignation follows a fraud probe.",
                "Significant development for the European affairs institution."
            ]
        },
        {
            "headline": "UK and Norway Form Naval Alliance to Hunt Russian Submarines",
            "summary": "The United Kingdom and Norway have established a new naval alliance specifically aimed at tracking and hunting Russian submarines. This strategic partnership underscores heightened security concerns in the North Atlantic and increased surveillance efforts against potential threats.",
            "key_points": [
                "UK and Norway formed a naval alliance.",
                "Alliance focuses on hunting Russian submarines.",
                "Highlights increased security concerns in the North Atlantic."
            ]
        },
        {
            "headline": "Lithuanian Court Convicts Governing Party Leader of Antisemitism",
            "summary": "A Lithuanian court has convicted the leader of a governing party on charges of antisemitism, a ruling that sends a strong message against hate speech in politics. This decision has significant implications for political discourse and tolerance in the country, upholding anti-discrimination laws.",
            "key_points": [
                "Lithuanian court convicted a governing party leader.",
                "Conviction was for antisemitism.",
                "Sends a strong message against hate speech in politics."
            ]
        },
        {
            "headline": "Poland Invests €2.3 Billion in Swedish Submarines to Modernize Navy",
            "summary": "Poland is investing €2.3 billion in Swedish submarines as part of a major effort to modernize its navy. This significant defense acquisition highlights Poland's commitment to strengthening its maritime capabilities amid regional security concerns and increasing geopolitical tensions in Europe.",
            "key_points": [
                "Poland invests €2.3 billion in Swedish submarines.",
                "Part of a major navy modernization effort.",
                "Highlights commitment to strengthening maritime capabilities."
            ]
        },
        {
            "headline": "Inquiry Finds Putin \"Morally Responsible\" for UK Novichok Death",
            "summary": "An inquiry has concluded that Russian President Vladimir Putin is \"morally responsible\" for the Novichok poisoning death in the UK. This finding places significant blame on the Russian leadership for the high-profile incident, intensifying diplomatic tensions and calls for accountability.",
            "key_points": [
                "Inquiry blames Putin for UK Novichok death.",
                "Putin found \"morally responsible.\"",
                "Places significant blame on Russian leadership."
            ]
        },
        {
            "headline": "Officials Allege Russia Sent Abducted Ukrainian Children to North Korea",
            "summary": "Officials claim that Russia has sent Ukrainian children, who were allegedly abducted, to North Korea. This grave accusation points to potential war crimes and further escalates international condemnation against Russia's actions in Ukraine, drawing attention to humanitarian crises.",
            "key_points": [
                "Officials allege Russia sent abducted Ukrainian children to North Korea.",
                "Grave accusation points to potential war crimes.",
                "Escalates international condemnation against Russia."
            ]
        },
        {
            "headline": "Emmanuel Macron Urges China to Back Ukraine Peace Plan",
            "summary": "French President Emmanuel Macron has appealed to China to support a peace plan for Ukraine, recognizing Beijing's significant diplomatic influence on the global stage. This plea highlights the ongoing international efforts to find a resolution to the conflict, seeking China's pivotal role.",
            "key_points": [
                "Macron urged China to support Ukraine peace plan.",
                "Recognizes China's diplomatic influence.",
                "Highlights international efforts for conflict resolution."
            ]
        },
        {
            "headline": "Two-Thirds of Europeans Believe Their Countries Unprepared for Conflict with Russia",
            "summary": "A survey indicates that two-thirds of Europeans believe their respective countries are not prepared to engage in conflict with Russia. This finding highlights significant public concern about defense readiness and potential geopolitical tensions, pushing for stronger defense strategies.",
            "key_points": [
                "Survey reveals two-thirds of Europeans feel unprepared for conflict with Russia.",
                "Highlights public concern about defense readiness.",
                "Points to potential geopolitical tensions."
            ]
        },
        {
            "headline": "New Zealand Thief Swallows $19K Pendant; Police Await Recovery",
            "summary": "In a bizarre incident in New Zealand, a thief swallowed a $19,000 bond pendant, leaving Auckland police in a predicament as they await its natural recovery. The unusual crime has captured public attention and poses a unique challenge for law enforcement agencies.",
            "key_points": [
                "Thief swallowed a $19,000 pendant in New Zealand.",
                "Police are waiting for natural recovery of the item.",
                "A unique and bizarre case for law enforcement."
            ]
        },
        {
            "headline": "Human Rights Lawyer Claims Colombian Man Killed by US Strike Was a Fisherman, Not Drug Trafficker",
            "summary": "A human rights lawyer asserts that a Colombian man killed by US strikes in the Caribbean was a tuna fisherman, not a drug trafficker, contradicting initial US claims. This counter-claim raises questions about target identification and the human cost of military operations, prompting further investigation.",
            "key_points": [
                "Lawyer claims US strike killed a fisherman, not a drug trafficker.",
                "Contradicts US reports on the Caribbean strike.",
                "Raises concerns about target identification and military operations."
            ]
        },
        {
            "headline": "Trump Oversees Congo-Rwanda Peace Deal in Washington, Emphasizing Neutrality",
            "summary": "Former President Trump has reportedly overseen a peace deal between Congo and Rwanda in Washington, stating his intention of \"never taking sides.\" This diplomatic intervention aims to de-escalate tensions in the African Great Lakes region, fostering stability and cooperation.",
            "key_points": [
                "Trump mediated a peace deal between Congo and Rwanda.",
                "The agreement was overseen in Washington.",
                "Trump emphasized a neutral stance in the process."
            ]
        },
        {
            "headline": "Kremlin Announces Putin to Meet US Special Envoy Witkoff on December 2",
            "summary": "The Kremlin confirmed that Russian President Vladimir Putin is scheduled to meet with US Special Envoy Witkoff on December 2. This high-level meeting indicates ongoing diplomatic efforts to address key international issues and potentially de-escalate conflicts, underscoring continued dialogue.",
            "key_points": [
                "Putin will meet US Special Envoy Witkoff.",
                "Meeting scheduled for December 2.",
                "Indicates ongoing high-level diplomatic efforts."
            ]
        },
        {
            "headline": "FSB Thwarts Ukraine-Ordered Assassination of Russian Defense Official in Crimea",
            "summary": "Russia's FSB announced it prevented a Ukraine-ordered assassination attempt on a senior Russian defense official in Crimea. This alleged plot highlights intensified covert operations and intelligence warfare between the warring nations, raising security concerns in the region.",
            "key_points": [
                "FSB prevented assassination attempt in Crimea.",
                "Target was a senior Russian defense official.",
                "Allegedly ordered by Ukraine, highlighting covert operations."
            ]
        },
        {
            "headline": "Zelensky Reportedly Faces New US Pressure in Bilateral Talks",
            "summary": "Reports suggest Ukrainian President Zelensky is encountering a new wave of pressure from the US during bilateral talks. This could relate to strategic decisions, corruption concerns, or military aid, indicating complex diplomatic dynamics between allies amidst ongoing conflict.",
            "key_points": [
                "Zelensky reportedly faces new US pressure.",
                "Occurring during bilateral talks.",
                "Could relate to strategic decisions or aid."
            ]
        },
        {
            "headline": "Indonesia Flood Death Toll Rises to 702; Search Efforts Intensify",
            "summary": "The death toll from widespread floods in Indonesia has tragically climbed to 702, with search and rescue operations intensifying to find more victims. The disaster highlights the severe impact of extreme weather events in the region and the urgent need for humanitarian aid.",
            "key_points": [
                "Indonesia flood death toll reached 702.",
                "Search and rescue operations are intensifying.",
                "Highlights severe impact of extreme weather."
            ]
        }
    ],
    "Business": [
        {
            "headline": "IndiGo Meltdown: Hundreds of Flights Cancelled, Passengers Stranded Nationwide",
            "summary": "IndiGo is experiencing a severe operational crisis with approximately 300 flights cancelled, leading to widespread chaos and stranded passengers across India. The airline's handling of the situation is exacerbating frustration among flyers, impacting various travelers from professionals to those attending personal events.",
            "key_points": [
                "IndiGo cancelled around 300 flights, causing nationwide disruption.",
                "Passengers are stranded and facing significant frustration due to poor communication.",
                "The crisis is affecting a broad spectrum of travelers."
            ]
        },
        {
            "headline": "A Weaker Rupee Could Be India’s Smartest Economic Strategy",
            "summary": "A weaker Indian Rupee might currently be India's most advantageous economic strategy, potentially boosting exports and making imports more expensive, thereby supporting domestic industries. This analysis explores the potential benefits of currency depreciation in the current global economic climate for national growth.",
            "key_points": [
                "A weaker rupee could benefit India's economy.",
                "It may boost exports and curb imports.",
                "Supports domestic industries in the current climate."
            ]
        },
        {
            "headline": "Indian Rupee Ends Six-Day Slide, Settles at 89.98 Against Dollar",
            "summary": "The Indian Rupee concluded a six-day depreciation streak, stabilizing at 89.98 against the US dollar. This halt in decline brings some relief to markets after a period of currency weakening, suggesting a potential shift in market dynamics and investor sentiment.",
            "key_points": [
                "Indian Rupee ended a six-day depreciation.",
                "Settled at 89.98 against the US dollar.",
                "Brings relief to markets after a period of weakening."
            ]
        },
        {
            "headline": "RBI Allows Rupee to Weaken Amid Outflows; Focus Shifts to Curbing Speculation",
            "summary": "The Reserve Bank of India (RBI) has permitted the Rupee to weaken amidst significant capital outflows, with a renewed focus on curbing speculative activities in the currency market. This strategy aims to manage the currency's stability while addressing underlying economic pressures and maintaining financial health.",
            "key_points": [
                "RBI allowed Rupee to weaken due to capital outflows.",
                "Focus is now on curbing currency speculation.",
                "Strategy aims to manage stability and economic pressures."
            ]
        },
        {
            "headline": "India Emphasizes Need to Balance Trade with Russia",
            "summary": "India is emphasizing the importance of balancing its trade relations with Russia, indicating a strategic approach to maintain economic stability while navigating geopolitical complexities. This focus aims to ensure mutual benefit and sustainable partnerships, especially in critical sectors like energy and defense.",
            "key_points": [
                "India stresses balancing trade with Russia.",
                "Aims for strategic economic stability.",
                "Focuses on mutual benefit and sustainable partnerships."
            ]
        },
        {
            "headline": "Russia Offers Untapped Opportunities for Indian Businesses, Says Commerce Minister",
            "summary": "India's Commerce Minister stated that Russia offers significant untapped opportunities for Indian businesses, encouraging greater economic engagement between the two nations. This highlights potential for increased trade and investment despite geopolitical contexts, fostering new avenues for growth.",
            "key_points": [
                "Indian Commerce Minister sees untapped business opportunities in Russia.",
                "Encourages greater economic engagement.",
                "Highlights potential for increased trade and investment."
            ]
        },
        {
            "headline": "Balanced, Diversified Trade Key to $100 Billion Russia–India Turnover: Maksim Reshetnikov",
            "summary": "Russian Commerce Minister Maksim Reshetnikov emphasized that achieving a $100 billion trade turnover between Russia and India requires a balanced and diversified trade approach. This strategy aims to expand beyond traditional sectors and foster sustainable economic growth and broader cooperation.",
            "key_points": [
                "Maksim Reshetnikov states balanced trade is crucial for Russia-India turnover.",
                "Goal is to reach $100 billion in trade.",
                "Requires diversification beyond traditional sectors for sustainable growth."
            ]
        },
        {
            "headline": "Sberbank, Russia's Top Lender, Plans to Expand Operations in India",
            "summary": "Sberbank, Russia's largest lender, is reportedly looking to significantly increase its operations and presence in India. This move indicates deepening financial ties between the two countries and potential new opportunities for Indian businesses in the banking sector.",
            "key_points": [
                "Sberbank aims to expand its operations in India.",
                "This signifies stronger financial ties between Russia and India.",
                "Could open new business opportunities for India."
            ]
        },
        {
            "headline": "Russian Export Center (REC) Increases Financial Support for Exports to India",
            "summary": "The Russian Export Center (REC) has announced increased financial support for Russian exports destined for India, aiming to boost bilateral trade. This initiative will facilitate smoother transactions and encourage more Russian companies to enter the Indian market, fostering economic exchange.",
            "key_points": [
                "REC increased financial support for Russian exports to India.",
                "Aims to boost bilateral trade between the nations.",
                "Facilitates Russian companies' entry into the Indian market."
            ]
        },
        {
            "headline": "India–Russia Business Forum 2025: Full Program Announced",
            "summary": "The comprehensive program for the India–Russia Business Forum 2025 has been announced, outlining key sessions and participants. The forum aims to foster economic collaboration and explore new investment opportunities between the two countries, promoting strategic business development.",
            "key_points": [
                "India–Russia Business Forum 2025 program announced.",
                "Forum aims to foster economic collaboration.",
                "Expected to explore new investment opportunities."
            ]
        },
        {
            "headline": "SEBI to Seize Rs 546 Crore in Largest Action Against a 'Finfluencer'",
            "summary": "Market regulator SEBI is set to seize Rs 546 crore in its largest ever enforcement action against a \"finfluencer\" (financial influencer). This move underscores SEBI's crackdown on illicit financial advice and market manipulation through social media, protecting investors.",
            "key_points": [
                "SEBI will seize Rs 546 crore from a \"finfluencer.\"",
                "This is SEBI's largest action against such an individual.",
                "Highlights crackdown on illicit financial advice and market manipulation."
            ]
        },
        {
            "headline": "BAT to Divest 7% Stake in ITC Hotels for Rs 3,000 Crore",
            "summary": "British American Tobacco (BAT) plans to sell a 7% stake in ITC Hotels, potentially raising Rs 3,000 crore. This divestment could impact ownership structure and strategy of ITC Hotels, while providing significant capital for BAT for other investments.",
            "key_points": [
                "BAT plans to sell 7% stake in ITC Hotels.",
                "The sale could generate Rs 3,000 crore.",
                "Potential impact on ITC Hotels' ownership and BAT's capital."
            ]
        },
        {
            "headline": "Cayman Islands Seeks Information Pacts with SEBI and GIFT City Regulator",
            "summary": "The Cayman Islands is exploring agreements for information exchange with India's market regulator SEBI and the GIFT City regulator. Such pacts would enhance transparency and regulatory cooperation, benefiting financial markets in both jurisdictions and curbing illicit finance.",
            "key_points": [
                "Cayman Islands seeking info exchange agreements.",
                "Partners include SEBI and GIFT City regulator.",
                "Aims to enhance transparency and regulatory cooperation."
            ]
        },
        {
            "headline": "RBI Expands Services for Basic Savings Accounts",
            "summary": "The Reserve Bank of India (RBI) has introduced an array of new services for basic savings bank deposit accounts, enhancing their utility and accessibility for account holders. This initiative aims to promote financial inclusion and provide more comprehensive banking solutions for all citizens.",
            "key_points": [
                "RBI expanded services for basic savings accounts.",
                "Aims to enhance utility and accessibility.",
                "Promotes financial inclusion for account holders."
            ]
        },
        {
            "headline": "Brokers' Body Calls for Reinstatement of Weekly Options on Bank Nifty",
            "summary": "A prominent brokers' body is advocating for the reintroduction of weekly options trading on Bank Nifty. This move, if approved, could provide traders with more flexible and short-term investment opportunities in the banking sector, increasing market liquidity.",
            "key_points": [
                "Brokers' body requests weekly options on Bank Nifty.",
                "Aims to provide more flexible trading opportunities.",
                "Could impact short-term investments in the banking sector."
            ]
        },
        {
            "headline": "Kotak CEO States Banks Lost Long-Term Value in Foreign Stake Sales",
            "summary": "The CEO of Kotak Mahindra Bank has asserted that Indian banks have forfeited long-term value through the sale of stakes to foreign entities. This view suggests concerns about the strategic implications and loss of future growth potential from such transactions, impacting domestic financial control.",
            "key_points": [
                "Kotak CEO claims banks lost long-term value.",
                "Loss attributed to selling stakes to foreign entities.",
                "Raises concerns about strategic implications and future growth."
            ]
        },
        {
            "headline": "Rupee Slump Beyond 90/Dollar: Implications for Investors",
            "summary": "The Indian Rupee's slump past 90 per US dollar has significant implications for investors, affecting import costs, export competitiveness, and investment strategies. This depreciation signals a challenging economic environment for many, necessitating adjusted financial planning.",
            "key_points": [
                "Rupee fell past 90 against the US dollar.",
                "Impacts import costs and export competitiveness.",
                "Creates a challenging environment for investors."
            ]
        },
        {
            "headline": "Fireside Ventures Closes Rs 2,265 Crore Fund IV, Focuses on Consumer Bets",
            "summary": "Fireside Ventures has successfully closed its fourth fund, Fund IV, raising Rs 2,265 crore, and is sharpening its investment focus on consumer-centric businesses. This capital will be deployed to support innovative brands in the evolving consumer market, boosting domestic entrepreneurship.",
            "key_points": [
                "Fireside Ventures closed Fund IV with Rs 2,265 crore.",
                "New fund will focus on consumer businesses.",
                "Capital targets innovative brands in the consumer market."
            ]
        },
        {
            "headline": "European Natural Gas Prices Tumble Despite Cold Winter",
            "summary": "European natural gas prices are unexpectedly falling despite the onset of a cold winter, defying typical market trends. This situation could be attributed to high storage levels, diversified supply, or reduced industrial demand, offering some relief to consumers and businesses.",
            "key_points": [
                "European natural gas prices are falling.",
                "This occurs despite cold winter conditions.",
                "Possible causes include high storage or diversified supply."
            ]
        },
        {
            "headline": "EU Commission Launches Antitrust Probe Against Meta Despite US Pressure",
            "summary": "The European Union Commission has initiated an antitrust probe against Meta Platforms, despite apparent pressure from the United States. This investigation signals the EU's commitment to regulating large tech companies and ensuring fair competition in the digital market.",
            "key_points": [
                "EU Commission began antitrust probe against Meta.",
                "Decision made despite US pressure.",
                "Signals EU's commitment to tech regulation and fair competition."
            ]
        },
        {
            "headline": "US Demand Sustains Swiss Watch Sales Despite High Tariffs",
            "summary": "Strong demand from the United States is keeping Swiss watch sales robust, even in the face of hefty tariffs. This sustained interest from American consumers underscores the luxury market's resilience and brand loyalty, maintaining industry stability.",
            "key_points": [
                "US demand supports Swiss watch sales.",
                "Sales remain strong despite high tariffs.",
                "Highlights luxury market resilience and brand loyalty."
            ]
        },
        {
            "headline": "ECB Affirms Italy's Gold Reserves Are Not a \"Political Treasure\"",
            "summary": "The European Central Bank (ECB) has clarified that Italy's gold reserves are not a \"political treasure\" belonging to the people, but rather a central bank asset, aiming to depoliticize debates around national wealth. This statement addresses ongoing discussions about central bank independence and national assets.",
            "key_points": [
                "ECB states Italy's gold reserves are central bank assets.",
                "Aims to depoliticize national wealth debates.",
                "Clarifies central bank independence."
            ]
        },
        {
            "headline": "OpenAI Awards Millions to Nonprofits Under New Foundation Structure",
            "summary": "OpenAI has allocated millions of dollars to various nonprofits under its recently established foundation structure. This philanthropic initiative demonstrates the AI giant's commitment to social impact and ethical development of artificial intelligence, contributing to broader societal benefits.",
            "key_points": [
                "OpenAI awarded millions to nonprofits.",
                "Done under its new foundation structure.",
                "Highlights commitment to social impact and ethical AI development."
            ]
        },
        {
            "headline": "Luxury Night Buses with Lie-Flat Seats Launched in Europe",
            "summary": "Europe has introduced luxury night buses equipped with lie-flat seats, aiming to redefine intercity travel with enhanced comfort and privacy. This innovation caters to travelers seeking premium overnight transportation alternatives, providing a comfortable journey.",
            "key_points": [
                "Europe introduces luxury night buses.",
                "Buses feature lie-flat seats for enhanced comfort.",
                "Aims to redefine intercity travel."
            ]
        }
    ],
    "Technology": [
        {
            "headline": "IIT Bombay–Monash Team Uncovers TB Bacteria's Lipid Wall for Drug Resistance",
            "summary": "A collaborative team from IIT Bombay and Monash University has made a significant breakthrough in understanding tuberculosis, discovering a unique lipid wall that enables the bacteria to evade existing drugs. This finding is crucial for developing new treatment strategies against TB, offering hope for drug-resistant strains.",
            "key_points": [
                "IIT Bombay and Monash University team researched TB.",
                "They discovered a lipid wall helping TB bacteria resist drugs.",
                "The finding is vital for new TB drug development."
            ]
        },
        {
            "headline": "Mark Zuckerberg Cuts Metaverse Budget, Shifts Meta's Focus to AI; Stock Rises 5%",
            "summary": "Mark Zuckerberg has announced a reduction in Meta's metaverse budget, signaling a strategic shift towards focusing more on Artificial Intelligence. This news led to a 5% rise in Meta's stock, as investors reacted positively to the re-prioritization, indicating confidence in AI investments.",
            "key_points": [
                "Mark Zuckerberg reduces Meta's metaverse budget.",
                "Meta is shifting its strategic focus to AI.",
                "Company stock rose by 5% following the announcement."
            ]
        },
        {
            "headline": "E-Motorcycle Company Ultraviolette Raises $45 Million in Funding",
            "summary": "Ultraviolette, an Indian electric motorcycle manufacturer, has successfully raised $45 million in its latest funding round. This significant investment will likely fuel the company's expansion, research, and development in the rapidly growing EV market, boosting sustainable mobility.",
            "key_points": [
                "Ultraviolette, an e-motorcycle company, secured $45 million.",
                "Funding will support expansion and R&D.",
                "Highlights growth in the EV market."
            ]
        },
        {
            "headline": "Red Dead Redemption on Netflix: Download Guide and Device Specifications",
            "summary": "This guide provides details on how to download Red Dead Redemption on Netflix, including minimum phone specifications and recommendations for the best flagship and budget devices. It caters to gamers looking to access the popular title on the streaming platform, expanding its reach.",
            "key_points": [
                "Guide for downloading Red Dead Redemption on Netflix.",
                "Includes minimum phone specifications for play.",
                "Recommends best flagship and budget devices for optimal experience."
            ]
        },
        {
            "headline": "Elon Musk's Neuralink Brain Chip Enables Movement of Robotic Limbs",
            "summary": "Elon Musk's Neuralink brain chip has achieved a significant milestone, enabling individuals to move robotic limbs through thought. This breakthrough represents a major advancement in neurotechnology, offering new possibilities for people with paralysis and improving quality of life.",
            "key_points": [
                "Neuralink brain chip now allows robotic limb movement.",
                "Major breakthrough in neurotechnology.",
                "Offers new possibilities for paralysis patients."
            ]
        },
        {
            "headline": "India Boosts Anti-Submarine Warfare with Underwater Drones: Navy Chief",
            "summary": "India's Navy Chief announced that the country is significantly enhancing its anti-submarine warfare capabilities by integrating advanced underwater drones. This strategic acquisition aims to modernize naval defenses and bolster maritime security, reflecting a focus on advanced military technology.",
            "key_points": [
                "India is acquiring advanced underwater drones.",
                "Aims to boost anti-submarine warfare capabilities.",
                "Modernizes naval defenses and maritime security."
            ]
        },
        {
            "headline": "Expert: Russia's New High-Precision Loitering Munitions Could Halt Ukrainian Forces",
            "summary": "An expert suggests that Russia's deployment of new high-precision loitering munitions could potentially halt Ukrainian forces, offering a significant tactical advantage. This highlights the evolving nature of warfare and the impact of advanced weaponry on battlefield outcomes.",
            "key_points": [
                "Russia's new loitering munitions could halt Ukrainian forces.",
                "Expert points to a significant tactical advantage.",
                "Highlights evolving warfare and advanced weaponry impact."
            ]
        },
        {
            "headline": "European Investment Bank Backs EU Commission's AI Gigafactory Plan",
            "summary": "The European Investment Bank (EIB) Group has announced its support for the European Commission's ambitious plan to establish an AI gigafactory. This backing signifies a major investment in AI infrastructure, aiming to bolster Europe's technological competitiveness and innovation capacity.",
            "key_points": [
                "EIB Group supports EU Commission's AI gigafactory plan.",
                "Major investment in AI infrastructure.",
                "Aims to boost Europe's technological competitiveness."
            ]
        },
        {
            "headline": "EU Utilizes Cutting-Edge Technologies to Combat Drug Traffickers",
            "summary": "The European Union is increasingly focusing on deploying cutting-edge technologies in its efforts to combat drug traffickers. This strategic shift aims to enhance surveillance, detection, and interdiction capabilities against organized crime, improving law enforcement effectiveness.",
            "key_points": [
                "EU is using cutting-edge technologies.",
                "Aims to combat drug traffickers more effectively.",
                "Enhances surveillance, detection, and interdiction capabilities."
            ]
        },
        {
            "headline": "EU's Top General Calls for Realignment of Drone Strategy",
            "summary": "The European Union's top general has called for a significant realignment of Europe's drone strategy, emphasizing the need for advanced capabilities in both defense and surveillance. This push reflects growing awareness of drone warfare's evolving role and geopolitical threats, urging rapid adaptation.",
            "key_points": [
                "EU's top general advocates for drone strategy realignment.",
                "Emphasizes need for advanced defense and surveillance capabilities.",
                "Reflects evolving drone warfare and geopolitical threats."
            ]
        },
        {
            "headline": "AI-Powered Robots Exhibited at Tokyo Trade Show",
            "summary": "AI-powered robots were prominently featured at a recent trade show in Tokyo, showcasing advancements in automation and artificial intelligence. The exhibition highlights innovative applications across various industries and potential future integrations, driving technological progress.",
            "key_points": [
                "AI-powered robots featured at Tokyo trade show.",
                "Showcased advancements in automation and AI.",
                "Highlights innovative applications across industries."
            ]
        },
        {
            "headline": "OECD Report: Europe Lags Global South in AI Adoption",
            "summary": "An OECD report indicates that Europe is falling behind the Global South in the adoption of Artificial Intelligence, signaling a potential competitive disadvantage. This finding urges European policymakers to accelerate AI integration and investment to catch up and innovate.",
            "key_points": [
                "OECD report shows Europe behind Global South in AI adoption.",
                "Signals potential competitive disadvantage.",
                "Urges accelerated AI integration and investment in Europe."
            ]
        },
        {
            "headline": "Russia Reportedly Blocks Apple's FaceTime Service",
            "summary": "Russia has reportedly blocked Apple's FaceTime service, adding to a series of restrictions on Western technology platforms. This move could impact communication for many users in Russia and highlights ongoing digital censorship efforts, limiting access to international services.",
            "key_points": [
                "Russia reportedly blocked Apple's FaceTime.",
                "Part of ongoing restrictions on Western tech.",
                "Impacts user communication and digital censorship."
            ]
        },
        {
            "headline": "Meta Removes Under-16 Accounts in Australia Due to Social Media Ban",
            "summary": "Meta has begun removing accounts belonging to users under 16 years old in Australia, complying with a new social media ban targeting minors. This action reflects tighter regulations on online platforms to protect younger users, prioritizing child safety online.",
            "key_points": [
                "Meta removed accounts for users under 16 in Australia.",
                "Compliance with new social media ban for minors.",
                "Reflects tighter regulations for protecting younger users online."
            ]
        },
        {
            "headline": "Russia Bans Roblox, Citing \"Justifying Terrorism\"",
            "summary": "Russia's media regulator has banned the popular online gaming platform Roblox, alleging it is \"justifying terrorism.\" This drastic measure highlights Russia's strict content control policies and broad censorship efforts over digital platforms, impacting user access.",
            "key_points": [
                "Russia's media regulator banned Roblox.",
                "Justification cited as \"justifying terrorism.\"",
                "Highlights strict content control and censorship."
            ]
        }
    ],
    "Entertainment": [
        {
            "headline": "'Dhurandhar' Early Buzz Hints at Ranveer Singh's Biggest Opener",
            "summary": "Early reviews and buzz for the film 'Dhurandhar' suggest it could be actor Ranveer Singh's highest-grossing opening. The positive reception indicates strong audience anticipation and critical enthusiasm for the movie's debut, promising a successful box office run.",
            "key_points": [
                "'Dhurandhar' is receiving positive early buzz.",
                "It is anticipated to be Ranveer Singh's biggest opening film.",
                "Strong audience and critical enthusiasm is noted."
            ]
        },
        {
            "headline": "Countries Boycott Eurovision After EBU Confirms Israel's Participation",
            "summary": "Several countries have initiated a boycott of the Eurovision Song Contest after the European Broadcasting Union (EBU) confirmed Israel's participation. This move reflects widespread political and social tensions impacting cultural events, highlighting ongoing geopolitical controversies.",
            "key_points": [
                "Countries are boycotting Eurovision.",
                "Boycott is in response to Israel's confirmed participation.",
                "Highlights political tensions affecting cultural events."
            ]
        },
        {
            "headline": "Republic and Sputnik Collaborate for Joint Broadcast on Putin’s India Visit",
            "summary": "Republic TV and Sputnik have partnered to offer a joint broadcast covering Russian President Putin's visit to India. This media collaboration provides extensive coverage and diverse perspectives on the significant bilateral event, catering to a wider audience.",
            "key_points": [
                "Republic TV and Sputnik are collaborating for a joint broadcast.",
                "Coverage focuses on Putin's India visit.",
                "Aims to provide extensive and diverse perspectives."
            ]
        },
        {
            "headline": "British Public Rules 'Die Hard' is Not a Christmas Movie",
            "summary": "The British public has collectively decided that \"Die Hard\" does not qualify as a Christmas movie, settling a long-standing festive debate. This popular consensus impacts the film's cultural classification during the holiday season, defining its genre.",
            "key_points": [
                "British public concluded 'Die Hard' is not a Christmas movie.",
                "Settles a long-standing festive debate.",
                "Impacts the film's cultural classification."
            ]
        },
        {
            "headline": "Iconic Booker T & the MG’s Guitarist Steve Cropper Dies at 84",
            "summary": "Steve Cropper, the legendary guitarist for Booker T & the MG's and an influential figure in soul music, has passed away at the age of 84. His death marks a significant loss to the music world, remembering his iconic contributions to countless hits and his enduring legacy.",
            "key_points": [
                "Steve Cropper, Booker T & the MG's guitarist, died at 84.",
                "He was an influential figure in soul music.",
                "His passing is a significant loss to the music world."
            ]
        },
        {
            "headline": "Doctor Who Sold Matthew Perry Ketamine Sentenced to Prison",
            "summary": "The doctor who illegally sold ketamine to actor Matthew Perry, which contributed to his death, has been sentenced to prison. This verdict concludes a high-profile case linked to the tragic passing of the \"Friends\" star, bringing legal closure to the incident.",
            "key_points": [
                "Doctor who sold ketamine to Matthew Perry sentenced.",
                "Ketamine contributed to the actor's death.",
                "Concludes a high-profile case related to the actor's passing."
            ]
        }
    ],
    "Sports": [
        {
            "headline": "Mohammed Shami Shines with Man-of-the-Match Performance After India Team Snub",
            "summary": "Pacer Mohammed Shami, surprisingly left out of the Indian national team, delivered a Man-of-the-Match performance in the Syed Mushtaq Ali Trophy (SMAT). His strong showing serves as a powerful response to his exclusion, demonstrating his continued form and skill on the field.",
            "key_points": [
                "Mohammed Shami was not selected for Team India.",
                "He delivered a Man-of-the-Match performance in SMAT.",
                "His performance is seen as a strong statement to selectors."
            ]
        },
        {
            "headline": "Prediction: Shreyas Iyer Could Lead India to a World Cup Victory",
            "summary": "A \"stunning prediction\" suggests that cricketer Shreyas Iyer possesses the leadership qualities to captain India to a World Cup win. This bold statement highlights his potential as a future leader for the national team, igniting fan and expert discussions.",
            "key_points": [
                "Shreyas Iyer is predicted to captain India to a World Cup win.",
                "Highlights his potential leadership qualities.",
                "A bold prediction for India's national cricket team."
            ]
        },
        {
            "headline": "Indian-Origin Jatinder Singh to Captain Oman in Asia Cup 2025",
            "summary": "Indian-origin cricketer Jatinder Singh has been appointed to lead the Oman team in the upcoming Asia Cup 2025. This marks a significant milestone for him and for Oman's cricket ambitions in the regional tournament, fostering diverse talent in international cricket.",
            "key_points": [
                "Jatinder Singh, of Indian origin, will captain Oman.",
                "He will lead the team in the Asia Cup 2025.",
                "Significant for Oman's cricket and his career."
            ]
        },
        {
            "headline": "Neeraj Chopra's Diamond League Final: Preview, Schedule, and Live Telecast",
            "summary": "This article provides a comprehensive preview of Neeraj Chopra's performance in the Diamond League Final, including event times and live telecast details for Indian viewers. All eyes are on the Olympic champion as he aims for another strong finish in this prestigious event.",
            "key_points": [
                "Preview of Neeraj Chopra's Diamond League Final event.",
                "Includes schedule and live telecast information for India.",
                "Focus on the Olympic champion's performance."
            ]
        },
        {
            "headline": "PM Modi Highlights Growing Popularity of Chess Among Indian Youth at FIDE World Cup",
            "summary": "During the FIDE World Cup in India, Prime Minister Narendra Modi remarked on the increasing popularity of chess among Indian youth. His statement underscores the government's recognition of intellectual sports and their growth nationwide, encouraging strategic thinking.",
            "key_points": [
                "PM Modi noted chess's rising popularity in India.",
                "Statement made during the FIDE World Cup.",
                "Highlights growth of intellectual sports among youth."
            ]
        },
        {
            "headline": "Golden State Warriors Considering Resigning $190 Million Star Guard to Support Stephen Curry",
            "summary": "Rumors suggest the Golden State Warriors are exploring options to re-sign a $190 million star guard to provide additional support for Stephen Curry. This strategic move aims to strengthen the team's roster ahead of the crucial trade deadline, optimizing their championship prospects.",
            "key_points": [
                "Golden State Warriors are in trade rumors.",
                "They might re-sign a $190 million star guard.",
                "The move is intended to support Stephen Curry and bolster the team."
            ]
        },
        {
            "headline": "Olympic Flame Illuminates Parthenon En Route to Milan Cortina Winter Games",
            "summary": "The Olympic flame recently illuminated the ancient Parthenon before continuing its journey to the Milan Cortina Winter Games. This ceremonial moment symbolizes the blend of historical tradition with modern athletic pursuit, marking a significant cultural event.",
            "key_points": [
                "Olympic flame lit up the Parthenon.",
                "It is en route to the Milan Cortina Winter Games.",
                "Symbolizes tradition meeting modern sports."
            ]
        }
    ],
    "Science": [
        {
            "headline": "IIT Bombay–Monash Team Uncovers TB Bacteria's Lipid Wall for Drug Resistance",
            "summary": "A collaborative team from IIT Bombay and Monash University has made a significant breakthrough in understanding tuberculosis, discovering a unique lipid wall that enables the bacteria to evade existing drugs. This finding is crucial for developing new treatment strategies against TB, offering hope for drug-resistant strains.",
            "key_points": [
                "IIT Bombay and Monash University team researched TB.",
                "They discovered a lipid wall helping TB bacteria resist drugs.",
                "The finding is vital for new TB drug development."
            ]
        },
        {
            "headline": "Study Reveals Geographic Concentration of \"Dark\" Personalities",
            "summary": "A large-scale study has identified regions where individuals with \"dark\" personality traits reportedly live and thrive. This research delves into the geographical distribution of certain psychological profiles and their environmental factors, contributing to personality science.",
            "key_points": [
                "Study explores geographical areas where \"dark\" personalities thrive.",
                "Identifies potential environmental factors influencing these traits.",
                "Offers insights into psychological profiles across regions."
            ]
        },
        {
            "headline": "DNA on Shawl Links Polish Immigrant to Jack the Ripper, But Experts Are Skeptical",
            "summary": "DNA evidence found on a shawl has reportedly linked a 19th-century Polish immigrant to the infamous Jack the Ripper case, though many experts express skepticism. This new development reopens old debates and challenges historical assumptions about the serial killer, prompting further forensic analysis.",
            "key_points": [
                "DNA on a shawl linked a Polish immigrant to Jack the Ripper.",
                "Many experts are skeptical about the new evidence.",
                "The finding reignites debates about the historical case."
            ]
        },
        {
            "headline": "Norway Halts Controversial Deep-Sea Mining Until 2029",
            "summary": "Norway has announced a moratorium on controversial deep-sea mining activities until 2029, pausing the practice amid environmental concerns. This decision reflects a cautious approach to resource extraction from marine ecosystems, prioritizing ecological protection.",
            "key_points": [
                "Norway paused deep-sea mining.",
                "Moratorium will last until 2029.",
                "Decision driven by environmental concerns over marine ecosystems."
            ]
        },
        {
            "headline": "Major Study on Global Cost of Climate Change Retracted",
            "summary": "A prominent study estimating the global financial costs of climate change has been retracted due to undisclosed methodological flaws. This retraction raises concerns about data integrity in climate science research and impacts policy discussions, highlighting the importance of rigorous peer review.",
            "key_points": [
                "Major climate change cost study was retracted.",
                "Retraction due to undisclosed methodological flaws.",
                "Raises concerns about data integrity in climate science."
            ]
        },
        {
            "headline": "Climate Change Exacerbates \"Human-Made Crisis\" of Asia's Floods",
            "summary": "Climate change is intensifying the \"human-made crisis\" of recurrent floods across Asia, with rising temperatures and altered weather patterns contributing to more extreme precipitation events. This highlights the urgent need for climate adaptation and mitigation strategies in vulnerable regions.",
            "key_points": [
                "Climate change worsens floods in Asia.",
                "Described as a \"human-made crisis.\"",
                "Urgent need for climate adaptation and mitigation strategies."
            ]
        },
        {
            "headline": "The Last Supermoon of the Year is Visible",
            "summary": "The last supermoon of the year is now visible, offering a spectacular celestial event for stargazers. This article provides guidance on how and when to best spot this larger-than-usual full moon, creating a unique astronomical viewing opportunity.",
            "key_points": [
                "The year's last supermoon is visible.",
                "It is a significant celestial event.",
                "Provides tips on how to best observe it."
            ]
        }
    ],
    "Health": [
        {
            "headline": "Misunderstood and Undiagnosed Ovarian Disorder Highlighted",
            "summary": "An ovarian disorder often goes misunderstood and undiagnosed, leading to prolonged health issues for many women. Increased awareness and better diagnostic tools are crucial for early detection and effective management of this condition, improving women's health outcomes.",
            "key_points": [
                "An ovarian disorder is frequently misunderstood.",
                "It often remains undiagnosed, affecting women's health.",
                "Better awareness and diagnostics are needed for effective management."
            ]
        },
        {
            "headline": "Man Diagnosed with Colon Cancer at 31: 6 Symptoms Not to Ignore",
            "summary": "A 31-year-old man was diagnosed with colon cancer after experiencing six key symptoms, prompting a gastroenterologist to warn against ignoring such signs. Early detection through awareness of symptoms is crucial for effective treatment of this often-undetected disease, especially in younger adults.",
            "key_points": [
                "A 31-year-old diagnosed with colon cancer.",
                "Six specific symptoms led to the diagnosis.",
                "Gastroenterologist emphasizes not ignoring early signs for timely treatment."
            ]
        },
        {
            "headline": "Gastroenterologist Reveals 4 Signs of Colon Cancer in Your 30s",
            "summary": "A gastroenterologist has outlined four critical signs of colon cancer that individuals in their 30s should be aware of. This information is vital for early detection, as colon cancer is increasingly being found in younger adults and often goes unnoticed until advanced stages.",
            "key_points": [
                "Gastroenterologist identifies four colon cancer signs for people in their 30s.",
                "Early detection is crucial for effective treatment.",
                "Highlights the increasing prevalence in younger adults."
            ]
        },
        {
            "headline": "Night-time Habit Discovered to Improve Heart Health and Lower Blood Pressure",
            "summary": "A new study has revealed a specific night-time habit that can significantly contribute to improved heart health and reduced blood pressure. This finding offers a simple yet effective strategy for cardiovascular well-being, promoting healthier lifestyle choices.",
            "key_points": [
                "Study identifies a night-time habit for better heart health.",
                "The habit can also reduce blood pressure.",
                "Offers a simple strategy for cardiovascular well-being."
            ]
        },
        {
            "headline": "WHO Reports Rise in Malaria Deaths in 2024 Amid Funding Cuts",
            "summary": "The World Health Organization (WHO) has reported an increase in malaria deaths in 2024, warning that reduced funding poses a significant risk of the disease's resurgence. This highlights a critical public health challenge exacerbated by insufficient investment, jeopardizing global health efforts.",
            "key_points": [
                "Malaria deaths increased in 2024, per WHO.",
                "Funding cuts threaten malaria resurgence.",
                "Highlights critical public health challenge due to underfunding."
            ]
        },
        {
            "headline": "One HPV Vaccine May Be Sufficient Against Cervical Cancer",
            "summary": "Scientists are suggesting that a single dose of the HPV vaccine might be sufficient to effectively combat cervical cancer, challenging previous multi-dose recommendations. This finding could revolutionize vaccination strategies and improve global access to preventative care, especially in low-resource settings.",
            "key_points": [
                "Scientists suggest one HPV vaccine dose may prevent cervical cancer.",
                "Challenges existing multi-dose recommendations.",
                "Could improve global access to preventative care."
            ]
        },
        {
            "headline": "Study Warns Vegan Teens with Heavy Periods at Risk of Anaemia",
            "summary": "A new study indicates that vegan teenagers experiencing heavy menstrual periods may be at an elevated risk of developing anaemia. This finding emphasizes the importance of balanced nutritional intake and monitoring for specific dietary groups, requiring careful health management.",
            "key_points": [
                "Vegan teens with heavy periods may face anaemia risk.",
                "Study highlights importance of balanced nutrition.",
                "Emphasizes monitoring for specific dietary groups."
            ]
        }
    ]
}