{
    "World": [
        {
            "headline": "Operation Epic Fury: US-Israel strikes kill Iran's Supreme Leader Khamenei, sparks regional chaos",
            "summary": "US and Israeli forces conducted \"Operation Epic Fury,\" a massive aerial assault on Iran, reportedly killing Supreme Leader Ayatollah Ali Khamenei and members of his family. This unprecedented strike has ignited widespread retaliation from Iran, including missile and drone attacks on Israel and US bases, pushing the Middle East into a severe state of escalation and uncertainty regarding Khamenei's succession.",
            "key_points": [
                "US-Israel \"Operation Epic Fury\" reportedly resulted in the death of Iran's Supreme Leader Khamenei.",
                "Iran has retaliated with missile and drone attacks on US and Israeli targets.",
                "The region faces severe escalation and uncertainty over Iran's leadership succession.",
                "This marks a significant escalation of the conflict."
            ]
        },
        {
            "headline": "Strait of Hormuz closure threat looms, India prepares for oil supply disruptions",
            "summary": "Fears of a Strait of Hormuz closure are mounting due to escalating Middle East tensions, posing a significant threat to global oil supplies and India's energy security. Exporters anticipate severe shipment delays and increased costs, while Indian airlines face widespread cancellations impacting travel to and from the region. The Indian Aviation Ministry is reviewing preparedness to mitigate the impact on operations.",
            "key_points": [
                "Escalating Middle East tensions threaten a Strait of Hormuz closure, impacting global oil.",
                "India is bracing for severe disruptions to its crucial oil supplies.",
                "Indian exporters warn of shipment delays, higher freight and insurance costs.",
                "Widespread flight cancellations in the Middle East affect Indian aviation."
            ]
        },
        {
            "headline": "Iranian strike debris hits Dubai’s Burj Al Arab; PV Sindhu among Indians stranded",
            "summary": "Debris from an intercepted Iranian drone struck Dubai's iconic Burj Al Arab, causing a minor fire, as the UAE issued emergency alerts amidst missile threats. Indian badminton star PV Sindhu was among numerous travelers stranded in Dubai due to flight disruptions, describing a frightening explosion near the airport. The incidents highlight the immediate civilian impact of the escalating conflict.",
            "key_points": [
                "Drone debris from an Iranian strike caused a fire at Dubai's Burj Al Arab.",
                "UAE residents received emergency alerts amidst missile threats.",
                "Indian athlete PV Sindhu was stranded in Dubai due to airspace closures.",
                "The incidents underscore civilian impact and travel chaos in the region."
            ]
        },
        {
            "headline": "Russia alleges UK, France preparing to arm Ukraine with nuclear weapons, warns of global security threat",
            "summary": "Russian Foreign Intelligence reports that the UK and France are preparing to arm Ukraine with nuclear weapons, a move that Russia warns threatens nonproliferation and global security. The Kremlin has stated it will inform the US about the likely appearance of nuclear arms in Ukraine, emphasizing that a settlement in the conflict is impossible without addressing the NATO expansion issue. This potential development marks a dangerous escalation in the Ukraine conflict.",
            "key_points": [
                "Russian Foreign Intel claims UK/France are preparing to arm Ukraine with nuclear weapons.",
                "Russia warns this move threatens nonproliferation and global security.",
                "Kremlin plans to inform the US and links Ukraine settlement to NATO expansion.",
                "The alleged plan marks a dangerous escalation in the Ukraine conflict."
            ]
        },
        {
            "headline": "Afghanistan-Pakistan border clashes escalate dramatically; impact on Kabul-Delhi trade feared",
            "summary": "Border tensions between Afghanistan and Pakistan have escalated severely, with reports of loud blasts and gunfire in Kabul and Pakistan's Defense Minister declaring \"open war\" and accusing the Taliban of exporting terrorism. Russia has called for diplomatic resolution, but the heightened conflict is expected to significantly disrupt trade routes, particularly affecting economic ties and goods flow between Kabul and Delhi.",
            "key_points": [
                "Afghanistan-Pakistan border clashes have intensified, with reports of gunfire in Kabul.",
                "Pakistan's Defense Minister has declared \"open war\" and accused Taliban of exporting terrorism.",
                "The escalation is expected to negatively impact Kabul-Delhi trade routes.",
                "Russia advocates for a diplomatic resolution to the conflict."
            ]
        },
        {
            "headline": "Nepal’s Political Crisis: Dr. Baburam Bhattarai Talks Exclusively to Sputnik India",
            "summary": "Dr. Baburam Bhattarai provided exclusive insights into Nepal’s ongoing political crisis, detailing the complex internal dynamics and challenges facing the nation. The crisis continues to draw regional attention, given Nepal's strategic importance and its close ties with India.",
            "key_points": [
                "Nepal is grappling with an ongoing political crisis.",
                "Dr. Baburam Bhattarai offered exclusive insights into the situation.",
                "The crisis is significant due to Nepal's strategic importance and ties to India."
            ]
        },
        {
            "headline": "The New START Treaty: The US-Russia Path to Nuclear Limits",
            "summary": "The New START Treaty, a cornerstone of nuclear arms control, defines the path for the US and Russia to limit their strategic nuclear arsenals. This treaty plays a critical role in global security, maintaining a balance of power and preventing an unrestricted arms race between the world's two largest nuclear powers.",
            "key_points": [
                "New START Treaty sets limits on US and Russian strategic nuclear arsenals.",
                "It is crucial for global security and arms control.",
                "The treaty helps prevent an unrestricted nuclear arms race."
            ]
        }
    ],
    "Business": [
        {
            "headline": "PM Modi inaugurates Micron’s Sanand chip plant, bolstering India’s semiconductor self-reliance",
            "summary": "Prime Minister Modi has inaugurated Micron's new semiconductor chip manufacturing plant in Sanand, Gujarat, a pivotal step in India's journey towards technological self-reliance. This significant investment is expected to boost domestic manufacturing, attract further foreign direct investment, and establish India as a crucial player in the global semiconductor ecosystem.",
            "key_points": [
                "PM Modi inaugurated Micron's semiconductor plant in Sanand, Gujarat.",
                "The plant is a major step towards India's technological self-reliance.",
                "It is expected to boost domestic manufacturing and attract FDI.",
                "India is positioned as a key player in the global semiconductor ecosystem."
            ]
        },
        {
            "headline": "FM Sitharaman to probe Fino Payments Bank chief's arrest amid GST overreach concerns; AI shock hits Indian IT stocks",
            "summary": "Finance Minister Nirmala Sitharaman has pledged to investigate the arrest of Fino Payments Bank's chief, addressing concerns about potential GST overreach by tax authorities. Separately, the Indian IT sector experienced its worst monthly decline in 17 years, losing Rs 5.7 lakh crore in market value, primarily due to the \"AI shock\" and widespread investor uncertainty.",
            "key_points": [
                "FM Sitharaman will investigate Fino Payments Bank chief's arrest for potential GST overreach.",
                "Indian IT stocks suffered their worst monthly fall in 17 years.",
                "The sector lost Rs 5.7 lakh crore, attributed to \"AI shock\" and investor uncertainty."
            ]
        },
        {
            "headline": "India significantly increases aluminum imports from Russia in 2025, nearly fourfold surge",
            "summary": "India dramatically increased its aluminum imports from Russia in 2025, with a nearly fourfold surge in volume. This strategic shift in raw material sourcing highlights evolving trade dynamics and strengthens economic ties between the two nations, potentially influenced by global supply chain changes or specific trade agreements.",
            "key_points": [
                "India's aluminum imports from Russia increased nearly fourfold in 2025.",
                "This indicates a strategic shift in India's raw material sourcing.",
                "The surge strengthens economic ties between India and Russia."
            ]
        },
        {
            "headline": "EPFO likely to maintain 8.25% interest rate for FY 2026, impacting millions of subscribers",
            "summary": "The Employees' Provident Fund Organisation (EPFO) is expected to maintain its interest rate at 8.25% for the financial year 2026. This decision is crucial for millions of provident fund subscribers, directly affecting the returns on their long-term savings and financial planning.",
            "key_points": [
                "EPFO is projected to keep its interest rate at 8.25% for FY 2026.",
                "This decision impacts millions of provident fund subscribers.",
                "It directly affects returns on long-term savings."
            ]
        }
    ],
    "Technology": [
        {
            "headline": "Sam Altman: OpenAI's 'impossible' goals achievable by non-technical candidates",
            "summary": "OpenAI CEO Sam Altman controversially stated that the company's ambitious, often-dubbed \"impossible\" goals can be achieved by non-technical candidates. This perspective emphasizes a broader talent pool for AI innovation, suggesting that diverse skill sets beyond traditional coding expertise are crucial for groundbreaking advancements in the field.",
            "key_points": [
                "Sam Altman claims OpenAI's ambitious goals are achievable by non-technical people.",
                "This highlights the importance of diverse skill sets for AI innovation.",
                "It challenges traditional views on technical expertise in the AI field."
            ]
        },
        {
            "headline": "Uber CEO predicts future of cab rides: autonomous, electric, and integrated mobility in 15-20 years",
            "summary": "Uber CEO Dara Khosrowshahi offered a glimpse into the future of cab rides, forecasting significant transformations within 15 to 20 years. He predicted widespread adoption of autonomous vehicles, fully electric fleets, and seamlessly integrated mobility services that will redefine urban transportation and passenger experiences.",
            "key_points": [
                "Uber CEO predicts major changes in cab rides within 15-20 years.",
                "Future transportation will feature autonomous vehicles and electric fleets.",
                "Integrated mobility services are expected to redefine urban travel."
            ]
        },
        {
            "headline": "Sam Altman under fire for Pentagon deal; Anthropic raises red flag on mass surveillance",
            "summary": "OpenAI CEO Sam Altman is facing backlash and calls to \"cancel ChatGPT\" after reports surfaced about a deal with the Pentagon. This controversy has intensified discussions on AI ethics, with rival firm Anthropic publicly drawing a \"red line\" against mass surveillance, highlighting growing industry concerns regarding AI's military applications and data privacy.",
            "key_points": [
                "Sam Altman faces criticism for OpenAI's alleged Pentagon deal.",
                "Calls to \"cancel ChatGPT\" reflect ethical concerns about AI's military use.",
                "Rival Anthropic publicly opposes mass surveillance, emphasizing AI ethics.",
                "The incident highlights growing industry debate on AI applications and privacy."
            ]
        }
    ],
    "Entertainment": [
        {
            "headline": "BRIT Awards 2026 winners announced: Olivia Dean, Rose, K-Pop Demon Hunters celebrate big wins",
            "summary": "The BRIT Awards 2026 celebrated musical excellence, with Olivia Dean, Rose, and K-Pop sensation Demon Hunters among the evening's prominent winners. The star-studded ceremony also featured a memorable performance by Harry Styles, delivering his first-ever live rendition of 'Aperture', captivating audiences globally.",
            "key_points": [
                "Olivia Dean, Rose, and K-Pop Demon Hunters were top winners at BRIT Awards 2026.",
                "Harry Styles gave his first live performance of 'Aperture'.",
                "The awards celebrated significant achievements in the music industry."
            ]
        },
        {
            "headline": "'The Kerala Story 2' earns over Rs 4 crore on Day 2; Rashmika-Vijay wedding captivates fans",
            "summary": "'The Kerala Story 2' demonstrated a strong box office performance, grossing over Rs 4 crore on its second day of release, signaling significant audience engagement. Meanwhile, the wedding of popular actors Rashmika Mandanna and Vijay Deverakonda captivated fans, with Rashmika arriving in a traditional palki, showcasing her radiant bridal glow.",
            "key_points": [
                "'The Kerala Story 2' collected over Rs 4 crore on its second day.",
                "Rashmika Mandanna and Vijay Deverakonda's wedding generated significant fan interest.",
                "Rashmika made a grand entrance in a palki, showcasing her bridal look."
            ]
        },
        {
            "headline": "'The Matrix 5' officially confirmed by director, extending iconic sci-fi saga",
            "summary": "The director of \"The Matrix\" franchise has officially confirmed that \"The Matrix 5\" is in the works, signaling a continuation of the groundbreaking sci-fi series. This announcement has generated considerable excitement among fans, eager for more of the franchise's signature blend of philosophical narrative and innovative action sequences.",
            "key_points": [
                "\"The Matrix 5\" has been officially confirmed by its director.",
                "The announcement extends the iconic sci-fi saga.",
                "Fans are excited for the continuation of its philosophical and action themes."
            ]
        }
    ],
    "Sports": [
        {
            "headline": "India vs West Indies T20 World Cup 2026 Super 8s at Eden Gardens; Chakravarthy under spotlight",
            "summary": "India is set to play West Indies in the T20 World Cup 2026 Super 8s at Eden Gardens, with a detailed pitch report and weather forecast available. Indian spinner Varun Chakravarthy is under scrutiny due to his varying performance, and stunning predictions suggest Shreyas Iyer could potentially captain India to a future World Cup victory.",
            "key_points": [
                "India faces West Indies in T20 World Cup 2026 Super 8s at Eden Gardens.",
                "Pitch report and weather forecast are key for the upcoming match.",
                "Varun Chakravarthy's T20 World Cup performance is being closely watched.",
                "Shreyas Iyer is predicted by some to potentially lead India to a World Cup win."
            ]
        },
        {
            "headline": "J&K’s Ranji triumph sparks healing hopes; PM Modi highlights chess popularity in India",
            "summary": "Jammu & Kashmir's recent Ranji Trophy victory has ignited discussions about its potential to foster unity and heal long-standing regional divisions. Concurrently, Prime Minister Modi lauded the increasing popularity of chess among Indian youth, especially following the FIDE World Cup in India, recognizing its role in promoting intellectual engagement and strategic thinking nationwide.",
            "key_points": [
                "J&K's Ranji Trophy win is seen as a symbol of unity and healing.",
                "PM Modi noted the rising popularity of chess among Indian youth.",
                "The FIDE World Cup in India boosted interest in chess as an intellectual sport."
            ]
        },
        {
            "headline": "Neeraj Chopra prepares for Diamond League Final; Indian-origin Jatinder Singh to captain Oman in Asia Cup",
            "summary": "Olympic javelin thrower Neeraj Chopra is set to compete in the Diamond League Final, with all eyes on his performance; event previews and live telecast details are available for Indian fans. In parallel, Indian-origin cricketer Jatinder Singh will lead Oman as captain in the Asia Cup 2025, marking a significant milestone for a player of Indian heritage on the international stage.",
            "key_points": [
                "Neeraj Chopra is gearing up for the Diamond League Final.",
                "Event previews and live telecast information are available in India.",
                "Indian-origin Jatinder Singh will captain Oman in Asia Cup 2025.",
                "This highlights the growing presence of Indian-origin players in international cricket."
            ]
        }
    ],
    "Science": [
        {
            "headline": "NASA revises Artemis moon landing to 2028; study reveals human brain can grow new cells into 80s",
            "summary": "NASA has revised its Artemis moon landing target to 2028, implementing a new strategy to overcome past delays and technical hurdles in its ambitious lunar exploration program. Concurrently, a new study challenges prior beliefs, showing that the human brain can continue to generate new cells and maintain sharpness well into a person's 80s, offering promising insights into aging and cognitive health.",
            "key_points": [
                "NASA's Artemis moon landing goal is now set for 2028 with a revised strategy.",
                "A new study indicates the human brain can grow new cells and remain sharp into the 80s.",
                "The research provides insights into aging and cognitive health.",
                "NASA aims to address technical challenges for future lunar missions."
            ]
        },
        {
            "headline": "Kuno National Park confirms Gamini’s fourth cub, marking new milestone for Project Cheetah",
            "summary": "India's Project Cheetah achieved a significant milestone with Kuno National Park confirming the birth of Gamini’s fourth cub. This brings the nation's total cheetah population to 39, including 28 India-born cubs, underscoring the success of scientific management and conservation efforts in re-establishing the species in India.",
            "key_points": [
                "Kuno National Park confirmed the birth of Gamini’s fourth cheetah cub.",
                "India's total cheetah population is now 39, with 28 born in India.",
                "This marks a significant success for Project Cheetah's conservation efforts.",
                "The milestone highlights effective scientific management of the program."
            ]
        }
    ],
    "Health": [
        {
            "headline": "US measles cases surge past 1,100; study links PFAS exposure to faster aging in men over 50",
            "summary": "The United States is experiencing a significant measles outbreak, with over 1,100 cases reported nationwide, predominantly among unvaccinated individuals. Health officials are urging increased immunization. In a separate development, a new study has linked PFAS exposure to accelerated aging in men over 50, raising serious concerns about the long-term health consequences of these persistent chemicals.",
            "key_points": [
                "US measles cases have surpassed 1,100, primarily affecting unvaccinated individuals.",
                "Health officials are calling for greater immunization efforts.",
                "A new study links PFAS exposure to faster aging in men over 50.",
                "This raises concerns about the health impact of \"forever chemicals.\""
            ]
        },
        {
            "headline": "Aggressive H3N2 variant prompts flu shot changes; collagen supplements show skin, joint benefits",
            "summary": "An aggressive H3N2 influenza variant has necessitated crucial changes to this year's flu shot formulation to enhance protection against the evolving virus. Concurrently, a new scientific review highlights the benefits of collagen supplements, noting improvements in skin elasticity, hydration, and a reduction in joint pain for users.",
            "key_points": [
                "An aggressive H3N2 flu variant has led to changes in this year's flu shot.",
                "Collagen supplements are shown to improve skin elasticity and hydration.",
                "The supplements also contribute to reducing joint pain."
            ]
        },
        {
            "headline": "Doctor clarifies diabetes test confusion (good fasting sugar, high HbA1c); diet alert reveals blood sugar spikes",
            "summary": "A doctor has clarified the common confusion where individuals show good fasting sugar but high HbA1c, explaining the diagnostic implications for diabetes. Additionally, a diabetes diet alert reveals common foods that can spike blood sugar more significantly than pure sugar itself, advising caution. The importance of observing urine for potential danger signals has also been emphasized by health experts.",
            "key_points": [
                "A doctor explains discrepancies between good fasting sugar and high HbA1c in diabetes tests.",
                "A diet alert warns about common foods that spike blood sugar more than sugar.",
                "Health experts emphasize monitoring urine for early danger signals."
            ]
        }
    ]
}