{
    "World": [
        {
            "headline": "‘Don’t know how to live anymore’: Kin of lynched Bangladeshi Hindu worker speaks out",
            "summary": "The family of a Bangladeshi Hindu worker who was lynched has expressed profound grief and despair. The incident highlights rising communal tensions in the region, causing immense suffering for those left behind.",
            "key_points": [
                "Bangladeshi Hindu worker lynched.",
                "Family members express severe distress and inability to cope.",
                "Incident points to growing communal tensions in Bangladesh."
            ]
        },
        {
            "headline": "Uttarakhand mute spectator to grabbing of forest land: Supreme Court",
            "summary": "The Supreme Court has criticized the Uttarakhand government for its inaction regarding the encroachment of forest land. This highlights a significant failure in land protection and environmental governance within the state.",
            "key_points": [
                "Supreme Court criticizes Uttarakhand government.",
                "Government failed to prevent grabbing of forest land.",
                "Highlights issues in environmental protection and governance."
            ]
        },
        {
            "headline": "'Learn Hindi, or...' Delhi BJP neta Renu Chaudhary's red card to foreign footballer",
            "summary": "Delhi BJP leader Renu Chaudhary has sparked controversy by allegedly telling a foreign footballer to learn Hindi or face consequences. This incident has raised questions about linguistic imposition and cultural insensitivity in India.",
            "key_points": [
                "Delhi BJP leader Renu Chaudhary makes controversial remarks.",
                "Told a foreign footballer to learn Hindi.",
                "Raises concerns about linguistic imposition and cultural sensitivity."
            ]
        },
        {
            "headline": "As tension rises, Bangladesh shuts visa operations in Delhi",
            "summary": "Bangladesh has temporarily suspended its visa operations in Delhi amidst rising tensions. This move could impact travel and diplomatic relations between India and its neighboring country, signaling a diplomatic chill.",
            "key_points": [
                "Bangladesh suspends visa operations in Delhi.",
                "Action taken due to rising tensions.",
                "Could affect India-Bangladesh travel and diplomatic ties."
            ]
        },
        {
            "headline": "Delhi pollution: GRAP-IV flags polluters, but gaps in emission testing cloud true picture",
            "summary": "GRAP-IV measures have identified polluters in Delhi, but inadequacies in emission testing obscure the accurate severity of the pollution crisis. This highlights systemic issues in environmental enforcement and monitoring, preventing effective action against the city's severe air quality problems.",
            "key_points": [
                "GRAP-IV identifies polluters in Delhi.",
                "Gaps in emission testing hinder understanding of true pollution levels.",
                "Indicates systemic issues in environmental monitoring and enforcement."
            ]
        },
        {
            "headline": "Mumbai air pollution: HC summons BMC chief over polluting infra sites; non-compliance found at 36 sites",
            "summary": "The Bombay High Court has summoned the BMC chief regarding polluting infrastructure sites in Mumbai, with non-compliance found at 36 locations. This action underscores growing judicial intervention in environmental issues and challenges facing urban development projects in the city.",
            "key_points": [
                "Bombay High Court summons BMC chief over Mumbai air pollution.",
                "Non-compliance identified at 36 infrastructure sites.",
                "Highlights judicial intervention in environmental matters."
            ]
        },
        {
            "headline": "'Afghans Are Our Brothers': India Urges Drug Firms to Help Afghanistan Meet Demand",
            "summary": "India has appealed to drug firms to assist Afghanistan in meeting its medical supply demands, emphasizing that \"Afghans are our brothers.\" This humanitarian gesture aims to provide crucial aid to the crisis-stricken nation, reflecting India's compassionate foreign policy.",
            "key_points": [
                "India urges drug firms to help Afghanistan with medical supplies.",
                "Emphasizes humanitarian ties, calling Afghans \"brothers.\"",
                "Aims to provide crucial aid to the crisis-stricken nation."
            ]
        },
        {
            "headline": "Seizure of Russian Assets in EU Will Accelerate ‘De-Euroisation’: BJP Politician",
            "summary": "A BJP politician has warned that the seizure of Russian assets in the EU will hasten \"de-Euroisation,\" implying a shift away from the Euro in international finance. This viewpoint suggests significant geopolitical and economic repercussions from the sanctions, impacting global financial systems.",
            "key_points": [
                "BJP politician warns EU seizure of Russian assets will accelerate \"de-Euroisation.\"",
                "Implies shift away from Euro in international finance.",
                "Suggests geopolitical and economic repercussions from sanctions."
            ]
        },
        {
            "headline": "Indian Expert Breaks Down Eurasia's Strategic Complexity at Valdai Conference in Moscow",
            "summary": "An Indian expert offered a detailed analysis of Eurasia's strategic complexities at the Valdai Conference in Moscow. Their insights provide an Indian perspective on geopolitical dynamics in the region, contributing to international discourse.",
            "key_points": [
                "Indian expert analyzes Eurasia's strategic complexities.",
                "Presented at Valdai Conference in Moscow.",
                "Provides an Indian perspective on regional geopolitics."
            ]
        },
        {
            "headline": "UN failing, BRICS outpacing G7: South Africa’s High Commissioner to India",
            "summary": "South Africa's High Commissioner to India stated that the UN is failing, while BRICS nations are surpassing the G7 in global influence. This perspective highlights a shifting global power balance and criticism of traditional international institutions, with implications for India's role.",
            "key_points": [
                "SA High Commissioner to India states UN is failing.",
                "Claims BRICS outpacing G7 in global influence.",
                "Highlights shifting global power balance and institutional criticism."
            ]
        },
        {
            "headline": "Would India-EAEU FTA Blunt the Impact of US Tariffs?",
            "summary": "The article discusses whether a potential Free Trade Agreement (FTA) between India and the EAEU could mitigate the effects of US tariffs. This analysis considers strategic economic alliances as a countermeasure to protectionist trade policies, crucial for India's economic resilience.",
            "key_points": [
                "Discusses if India-EAEU FTA can blunt US tariffs.",
                "Considers strategic economic alliances.",
                "Aims to counter protectionist trade policies."
            ]
        },
        {
            "headline": "Zelensky Is Foolish to Believe He Can Defeat Russia: IAF Vet",
            "summary": "An IAF (Indian Air Force) veteran has asserted that Ukrainian President Zelensky is \"foolish\" to believe he can defeat Russia. This perspective suggests a cynical view of Ukraine's military prospects and the realities of the conflict, from an Indian strategic analyst's point of view.",
            "key_points": [
                "IAF veteran states Zelensky is \"foolish\" to think he can defeat Russia.",
                "Suggests a cynical view of Ukraine's military prospects.",
                "Highlights the perceived realities of the conflict."
            ]
        },
        {
            "headline": "Trump greenlights Greenland grab: US prez names special envoy; what it means",
            "summary": "US President Trump has appointed a special envoy for Greenland, signaling renewed interest in the autonomous Danish territory. This move could escalate diplomatic tensions with Denmark and has geopolitical implications regarding Arctic resources and strategic positioning.",
            "key_points": [
                "Trump appoints special envoy for Greenland.",
                "Signals renewed US interest in the territory.",
                "Could lead to diplomatic tensions with Denmark.",
                "Has geopolitical implications for the Arctic region."
            ]
        },
        {
            "headline": "FBI director Kash Patel under fire for using taxpayer-funded armoured BMW X5, new jet demand",
            "summary": "FBI director Kash Patel is facing criticism for his alleged lavish spending, including the use of a taxpayer-funded armored BMW X5 and a demand for a new private jet. This has sparked controversy regarding the responsible use of public funds and official privileges.",
            "key_points": [
                "FBI Director Kash Patel under scrutiny for alleged lavish spending.",
                "Criticized for using taxpayer-funded armored BMW X5.",
                "Also facing backlash for demanding a new private jet."
            ]
        },
        {
            "headline": "ISIS, Bombs & Shotguns: Rare Pics Of Bondi Gunmen Training Before Attack; Aus PM Apologises To Jews",
            "summary": "Rare images have emerged showing the Bondi gunmen training with weapons before their attack, which has prompted Australia's Prime Minister to apologize to the Jewish community. The revelations highlight the depth of the terrorist plot and the need for heightened security measures.",
            "key_points": [
                "Images reveal Bondi gunmen's pre-attack training with weapons.",
                "Australian PM apologizes to the Jewish community.",
                "Underscores the severity of the terrorist plot."
            ]
        },
        {
            "headline": "Putin Aide RAGES At Kyiv After Moscow Car Bomb Kills Russian General | ‘TERRIBLE ACT OF MURDER!’",
            "summary": "A top aide to Vladimir Putin has vehemently condemned Kyiv after a car bomb in Moscow killed a Russian general, labeling the incident a \"terrible act of murder.\" This event marks a significant escalation in the ongoing conflict and could lead to severe retaliatory measures.",
            "key_points": [
                "Russian general killed by car bomb in Moscow.",
                "Putin's aide blames Kyiv, calling it \"terrible act of murder.\"",
                "Incident signifies a major escalation in the conflict."
            ]
        },
        {
            "headline": "BIG! Putin’s War ‘WIPES OUT’ American Fighters In Ukraine; Zelensky Presses Trump To Do This Next…",
            "summary": "A report claims that American fighters in Ukraine have been \"wiped out\" by Putin's forces, leading President Zelensky to urge Trump for specific actions. This development signals a critical turn in the Ukraine conflict and could influence US foreign policy.",
            "key_points": [
                "Report states American fighters in Ukraine were \"wiped out\".",
                "Zelensky urges Trump to take specific actions.",
                "Marks a critical point in the Ukraine conflict."
            ]
        },
        {
            "headline": "Ukraine hits Russian oil terminal, jets and ships in wave of strikes",
            "summary": "Ukraine launched a series of strikes targeting a Russian oil terminal, jets, and ships, indicating a significant escalation of offensive operations. Russia retaliated with extensive drone attacks on Ukrainian energy infrastructure.",
            "key_points": [
                "Ukraine strikes Russian oil terminal, jets, and ships.",
                "Signifies escalation of offensive operations.",
                "Russia retaliates with drone attacks on Ukrainian energy infrastructure."
            ]
        },
        {
            "headline": "Cyberattack knocks France's postal service and its banking arm offline",
            "summary": "A significant cyberattack has disrupted France's national postal service and its associated banking arm, taking both offline. This incident highlights the increasing vulnerability of critical infrastructure to cyber threats and the widespread impact on public services.",
            "key_points": [
                "France's postal service and banking arm hit by cyberattack.",
                "Services taken offline, impacting public access.",
                "Highlights vulnerability of critical infrastructure to cyber threats."
            ]
        },
        {
            "headline": "France to build new nuclear carrier replacing Charles de Gaulle",
            "summary": "France has announced plans to construct a new nuclear-powered aircraft carrier, which will replace the existing Charles de Gaulle. This strategic defense initiative aims to modernize its naval capabilities and project power globally.",
            "key_points": [
                "France to build new nuclear aircraft carrier.",
                "Will replace the Charles de Gaulle.",
                "Aims to modernize naval capabilities and project power."
            ]
        },
        {
            "headline": "Turkish MPs brawl during heated budget debate",
            "summary": "A heated budget debate in the Turkish parliament erupted into a physical brawl among MPs, highlighting deep political divisions. The altercation underscores the intense partisan atmosphere in the country's legislative body.",
            "key_points": [
                "Turkish MPs brawled during a heated budget debate.",
                "Highlights deep political divisions.",
                "Underscores intense partisan atmosphere."
            ]
        },
        {
            "headline": "Airport strikes to hit major European hubs this Christmas",
            "summary": "Major European airports are bracing for widespread strikes this Christmas, which are expected to cause significant travel disruptions. The industrial action will affect thousands of passengers during the busy holiday season.",
            "key_points": [
                "Airport strikes planned for major European hubs.",
                "Expected to cause significant travel disruptions over Christmas.",
                "Will impact thousands of passengers."
            ]
        },
        {
            "headline": "US pursuing third oil tanker in international waters near Venezuela",
            "summary": "The United States is reportedly pursuing a third oil tanker in international waters close to Venezuela, escalating tensions in the region. This action is likely part of broader US efforts to exert pressure on Venezuela's oil industry and government.",
            "key_points": [
                "US pursuing third oil tanker near Venezuela.",
                "Escalates tensions in the region.",
                "Part of US pressure on Venezuela's oil industry."
            ]
        },
        {
            "headline": "First climate migrants land in Australia after leaving sinking nation",
            "summary": "The first group of climate migrants has arrived in Australia after being displaced from their sinking island nation. This event marks a poignant moment in the global climate crisis, highlighting the real-world impact of rising sea levels.",
            "key_points": [
                "First climate migrants arrive in Australia.",
                "Displaced from their sinking island nation.",
                "Highlights real-world impact of climate change and rising sea levels."
            ]
        },
        {
            "headline": "German paraplegic engineer becomes first wheelchair user to travel to space",
            "summary": "A German paraplegic engineer has made history by becoming the first wheelchair user to travel to space. This groundbreaking achievement marks a significant step forward for inclusivity in space exploration.",
            "key_points": [
                "German paraplegic engineer travels to space.",
                "First wheelchair user to achieve this feat.",
                "Significant step for inclusivity in space exploration."
            ]
        }
    ],
    "Business": [
        {
            "headline": "Top stocks to buy today: Stock market recommendations for December 23, 2025 - check list",
            "summary": "Experts have provided a list of top stock recommendations for December 23, 2025, for investors looking for potential opportunities. This guidance aims to help individuals make informed decisions in the current market, especially in India.",
            "key_points": [
                "Stock market recommendations released for today.",
                "Aims to guide investors on potential opportunities.",
                "Helps in making informed market decisions."
            ]
        },
        {
            "headline": "RBI spent $12 billion to not let Re breach 89 level in October",
            "summary": "The Reserve Bank of India (RBI) intervened significantly in October, spending $12 billion to prevent the Indian Rupee from falling below the 89-per-dollar mark. This highlights the central bank's efforts to maintain currency stability amidst market pressures.",
            "key_points": [
                "RBI spent $12 billion in October.",
                "Intervention aimed at preventing Rupee from breaching 89 per dollar.",
                "Demonstrates RBI's commitment to currency stability."
            ]
        },
        {
            "headline": "'Low inflation boost for competitiveness': RBI",
            "summary": "The Reserve Bank of India (RBI) has stated that low inflation will enhance the country's economic competitiveness. This perspective suggests that stable prices are crucial for fostering a favorable business environment and boosting exports.",
            "key_points": [
                "RBI states low inflation boosts economic competitiveness.",
                "Stable prices are seen as beneficial for business environment.",
                "Expected to support export growth."
            ]
        },
        {
            "headline": "FedEx questioned for hiring hundreds of H-1B workers while firing US staff: 'Our strategy...'",
            "summary": "FedEx is facing scrutiny for allegedly hiring hundreds of H-1B visa workers while simultaneously laying off US employees. The company's strategy is being questioned amidst concerns about job displacement and immigration policies, which is a sensitive topic for Indian professionals.",
            "key_points": [
                "FedEx under scrutiny for H-1B hires.",
                "Allegations of simultaneous layoffs of US staff.",
                "Questions raised about job displacement and company strategy."
            ]
        },
        {
            "headline": "April-October gross FDI flows rise 15% to $58 billion",
            "summary": "India's gross Foreign Direct Investment (FDI) inflows increased by 15% to $58 billion between April and October. This growth indicates strong international investor confidence and a positive outlook for the country's economy.",
            "key_points": [
                "Gross FDI flows rose 15% from April to October.",
                "Total FDI reached $58 billion.",
                "Indicates strong international investor confidence."
            ]
        },
        {
            "headline": "In gold we trust: Yellow metal, silver log new highs",
            "summary": "Both gold and silver have reached new record highs, signaling a surge in investor confidence in precious metals. This trend often reflects economic uncertainty and a flight to safe-haven assets, highly relevant for Indian households.",
            "key_points": [
                "Gold and silver have hit new record highs.",
                "Indicates increased investor confidence in precious metals.",
                "Often a sign of economic uncertainty."
            ]
        },
        {
            "headline": "Voltas, HCL Tech & more: Stocks to look out for today; check details",
            "summary": "Several prominent Indian stocks, including Voltas and HCL Tech, are drawing investor attention today, with specific details provided for market participants. These companies are being highlighted for potential movements or significant news in the Indian market.",
            "key_points": [
                "Voltas, HCL Tech, and other stocks are in focus.",
                "Details provided for market observation.",
                "Suggests potential market movements for these companies."
            ]
        },
        {
            "headline": "Terms of reference talks for Canada FTA soon: Piyush Goyal",
            "summary": "India's Commerce Minister Piyush Goyal announced that talks for the terms of reference for a Free Trade Agreement (FTA) with Canada will commence soon. This signifies a push towards strengthening economic ties and facilitating bilateral trade.",
            "key_points": [
                "Piyush Goyal announced upcoming FTA talks with Canada.",
                "Focus on establishing terms of reference.",
                "Aims to strengthen economic and trade relations."
            ]
        },
        {
            "headline": "India seals trade pact with New Zealand, gets tariff-free access to markets",
            "summary": "India has finalized a trade pact with New Zealand, securing tariff-free access to its markets. This agreement is expected to boost bilateral trade and open new avenues for Indian exports, enhancing India's global trade footprint.",
            "key_points": [
                "India and New Zealand finalize trade pact.",
                "India gains tariff-free market access.",
                "Expected to boost bilateral trade and exports."
            ]
        },
        {
            "headline": "Sensex up for 2nd day on steady, global cues",
            "summary": "The Sensex recorded gains for the second consecutive day, driven by steady domestic and positive global market cues. This upward trend reflects a generally optimistic investor sentiment in the Indian stock market.",
            "key_points": [
                "Sensex rises for second consecutive day.",
                "Driven by steady domestic and global market cues.",
                "Reflects optimistic investor sentiment."
            ]
        },
        {
            "headline": "'Mitsubishi to power Shriram Finance's growth'",
            "summary": "Mitsubishi is set to play a key role in powering the growth of Shriram Finance, indicating a strategic partnership between the two entities. This collaboration could lead to significant advancements and expansion for Shriram Finance in India's financial sector.",
            "key_points": [
                "Mitsubishi to support Shriram Finance's growth.",
                "Indicates a strategic partnership.",
                "Expected to drive advancements and expansion."
            ]
        },
        {
            "headline": "Global giants bank on Indian-origin CFOs",
            "summary": "A growing number of global corporations are appointing Chief Financial Officers (CFOs) of Indian origin, highlighting their talent and expertise. This trend underscores India's increasing influence in global business leadership roles and the recognition of Indian talent.",
            "key_points": [
                "Global giants increasingly appoint Indian-origin CFOs.",
                "Highlights talent and expertise of Indian professionals.",
                "Shows India's growing influence in global business leadership."
            ]
        },
        {
            "headline": "Father’s guarantee: Oracle co-founder Larry Ellison backstops son’s $78bn Paramount bid for Warner Bros. Discovery",
            "summary": "Oracle co-founder Larry Ellison is reportedly backing his son's $78 billion bid for Paramount and Warner Bros. Discovery, providing a significant financial guarantee. This move underscores a major consolidation effort in the media industry, driven by substantial capital.",
            "key_points": [
                "Larry Ellison supports son's $78 billion bid for Paramount and Warner Bros. Discovery.",
                "Provides significant financial backing.",
                "Highlights major consolidation in the media industry."
            ]
        },
        {
            "headline": "AP Moller in clean energy race, ArcelorMittal to add capacity",
            "summary": "AP Moller is actively participating in the clean energy race, while ArcelorMittal plans to expand its production capacity. These moves reflect a broader industry shift towards sustainability and increased output in global industrial sectors.",
            "key_points": [
                "AP Moller entering clean energy sector.",
                "ArcelorMittal plans to increase capacity.",
                "Reflects industry trends towards sustainability and growth."
            ]
        },
        {
            "headline": "China hits EU with 42.7% tariff on dairy imports",
            "summary": "China has imposed a substantial 42.7% tariff on dairy imports from the European Union, signaling a significant trade dispute. This move could severely impact European dairy producers and reshape global dairy trade flows.",
            "key_points": [
                "China imposes 42.7% tariff on EU dairy imports.",
                "Signals a significant trade dispute.",
                "Expected to impact European dairy producers."
            ]
        }
    ],
    "Technology": [
        {
            "headline": "Why Does Indo-Russian Tech Cooperation Matter More Than Ever Just Now?",
            "summary": "The article explores the increased importance of Indo-Russian technology cooperation in the current geopolitical landscape. It highlights how this collaboration serves both nations' strategic interests and technological development, especially for India's defense and space sectors.",
            "key_points": [
                "Explores increased importance of Indo-Russian tech cooperation.",
                "Highlights strategic interests for both nations.",
                "Focuses on technological development."
            ]
        },
        {
            "headline": "Call of Duty co-creator Vince Zampella killed in Ferrari crash in California",
            "summary": "Vince Zampella, a co-creator of the popular \"Call of Duty\" video game franchise, has died in a Ferrari crash in California. His death marks a significant loss for the gaming industry and millions of fans worldwide.",
            "key_points": [
                "Vince Zampella, Call of Duty co-creator, died.",
                "Killed in a Ferrari crash in California.",
                "Significant loss for the gaming industry."
            ]
        },
        {
            "headline": "A pirate activist group scraped and released Spotify’s entire library",
            "summary": "A pirate activist group has reportedly scraped and released Spotify's complete music library, raising significant copyright and data security concerns. This action poses a major challenge to the music streaming industry and intellectual property rights.",
            "key_points": [
                "Pirate group scraped and released Spotify's entire library.",
                "Raises copyright and data security concerns.",
                "Major challenge to music streaming and intellectual property."
            ]
        },
        {
            "headline": "Russia's Su-57 Takes to the Skies for the First Time with New Next-Gen Engine",
            "summary": "Russia's Su-57 fighter jet has completed its inaugural flight with a new next-generation engine, marking a significant advancement in its aviation technology. This upgrade is expected to enhance the aircraft's performance and capabilities, boosting its combat readiness.",
            "key_points": [
                "Russia's Su-57 fighter jet flies with new next-gen engine.",
                "Marks significant advancement in aviation technology.",
                "Expected to enhance aircraft performance."
            ]
        },
        {
            "headline": "Drones Power Modern Warfare, Russia’s Edge Is Tangible: Expert",
            "summary": "An expert argues that drones are central to modern warfare, asserting that Russia possesses a clear and tangible advantage in drone technology. This analysis highlights the critical role of unmanned aerial vehicles in contemporary military strategy and intelligence.",
            "key_points": [
                "Expert states drones are central to modern warfare.",
                "Claims Russia has a tangible edge in drone technology.",
                "Highlights critical role of UAVs in military strategy."
            ]
        }
    ],
    "Entertainment": [
        {
            "headline": "'Dhurandhar' tops 2025 worldwide; sets new overseas mark",
            "summary": "The Indian film 'Dhurandhar' has emerged as the highest-grossing film worldwide in 2025, also setting a new record for overseas box office performance. This achievement highlights its global appeal and commercial success in the entertainment industry.",
            "key_points": [
                "'Dhurandhar' is the highest-grossing film worldwide in 2025.",
                "It also set a new record for overseas box office.",
                "Demonstrates significant global commercial success."
            ]
        },
        {
            "headline": "Forensic report negative: Shine Tom Chacko gets clean chit",
            "summary": "Indian actor Shine Tom Chacko has received a clean chit after his forensic report came back negative, clearing his name in an ongoing investigation. This development is a significant relief for the actor and concludes a period of legal uncertainty.",
            "key_points": [
                "Actor Shine Tom Chacko receives clean chit.",
                "Forensic report came back negative.",
                "Clears his name in the investigation."
            ]
        },
        {
            "headline": "KBC17: Can you guess the answer for Rs 5,00,000 question",
            "summary": "A question worth Rs 5,00,000 on the popular Indian show \"Kaun Banega Crorepati 17\" has challenged contestants and viewers alike. The segment engages the audience by inviting them to guess the correct answer, adding to the show's excitement.",
            "key_points": [
                "KBC17 featured a challenging Rs 5,00,000 question.",
                "Engaged contestants and home viewers.",
                "Asked audiences to guess the answer."
            ]
        },
        {
            "headline": "Films of Sreenivasan that aged like truth",
            "summary": "Several films starring Indian actor Sreenivasan are highlighted for their timeless relevance and enduring truths, demonstrating their lasting impact. These movies are praised for their insightful narratives that continue to resonate with audiences across generations.",
            "key_points": [
                "Sreenivasan's films are praised for timeless relevance.",
                "Highlight their enduring truths and lasting impact.",
                "Narratives continue to resonate with audiences."
            ]
        },
        {
            "headline": "‘Kis Kisko Pyaar Karoon 2’ box office collection day 11",
            "summary": "The box office collection for the Indian film \"Kis Kisko Pyaar Karoon 2\" on its 11th day has been released, providing an update on its commercial performance. The figures indicate the film's standing in the current cinematic market.",
            "key_points": [
                "\"Kis Kisko Pyaar Karoon 2\" box office collection for day 11 released.",
                "Provides an update on its commercial performance.",
                "Indicates its standing in the current market."
            ]
        },
        {
            "headline": "Avatar 3 box office Day 4: Film fails to break Dhurandhar craze",
            "summary": "On its fourth day, \"Avatar 3\" struggled to surpass the box office success of \"Dhurandhar,\" indicating a strong competitive market for the Indian film. This suggests that \"Dhurandhar\" continues to dominate audience interest and ticket sales.",
            "key_points": [
                "\"Avatar 3\" struggled to match \"Dhurandhar\" at the box office.",
                "Happened on its fourth day of release.",
                "\"Dhurandhar\" continues to dominate audience interest."
            ]
        },
        {
            "headline": "'Akhanda 2' BO day 11: Balayya's film touches Rs 85.1 crore",
            "summary": "Balayya's Indian film \"Akhanda 2\" has reportedly reached a box office collection of Rs 85.1 crore on its 11th day. This figure indicates a strong performance and continued success in the cinematic market.",
            "key_points": [
                "Balayya's film \"Akhanda 2\" collected Rs 85.1 crore by day 11.",
                "Indicates a strong box office performance.",
                "Shows continued success in the cinematic market."
            ]
        },
        {
            "headline": "'Bha. Bha. Ba.' BO day 5: Film crosses Rs 17.50 crore",
            "summary": "The Indian film \"Bha. Bha. Ba.\" has crossed Rs 17.50 crore at the box office by its fifth day, marking a successful run. This indicates a positive reception and strong commercial performance.",
            "key_points": [
                "Film \"Bha. Bha. Ba.\" crosses Rs 17.50 crore.",
                "Achieved this by its fifth day.",
                "Indicates a successful commercial performance."
            ]
        },
        {
            "headline": "Newlywed Samantha Ruth Prabhu turns a silk saree into a style moment",
            "summary": "Newlywed Indian actress Samantha Ruth Prabhu has showcased her fashion prowess by transforming a traditional silk saree into a significant style statement. Her elegant and modern interpretation has garnered widespread attention.",
            "key_points": [
                "Samantha Ruth Prabhu made a style statement with a silk saree.",
                "Her newlywed status adds to the interest.",
                "Praised for elegance and modern interpretation."
            ]
        },
        {
            "headline": "KBC17: Contestant reveals he didn't get married due to the show",
            "summary": "A contestant on \"Kaun Banega Crorepati 17\" shared a surprising revelation, stating that he remained unmarried because of the show. This personal anecdote added an emotional and memorable moment to the episode.",
            "key_points": [
                "KBC17 contestant revealed he didn't marry because of the show.",
                "Surprising and personal anecdote.",
                "Added an emotional moment to the episode."
            ]
        },
        {
            "headline": "Uorfi Javed on late night ordeal: When someone comes at 3 am...",
            "summary": "Indian celebrity Uorfi Javed recounted a harrowing late-night ordeal, describing an incident where someone arrived at her residence at 3 am. Her account highlights concerns about personal safety and privacy, sparking public discussion.",
            "key_points": [
                "Uorfi Javed shares a late-night ordeal.",
                "Describes someone arriving at her home at 3 am.",
                "Raises concerns about personal safety and privacy."
            ]
        },
        {
            "headline": "Laughter Chefs 3: Arjun Bijlani is not replacing Bharti Singh",
            "summary": "Reports confirm that Arjun Bijlani will not be replacing Bharti Singh in the Indian reality show \"Laughter Chefs 3,\" clarifying previous speculation. The show's cast remains as planned, with both personalities maintaining their roles.",
            "key_points": [
                "Arjun Bijlani not replacing Bharti Singh in \"Laughter Chefs 3.\"",
                "Clarifies previous speculation.",
                "Show's cast remains as planned."
            ]
        },
        {
            "headline": "Mumtaz calls Fardeen Khan ‘HEERA LADKA,’ opens up on daughter’s separation, praises the ‘Heeramandi’ actor",
            "summary": "Veteran actress Mumtaz affectionately called Fardeen Khan a \"Heera Ladka\" (diamond boy), while also discussing her daughter's separation and praising the \"Heeramandi\" actor. Her candid remarks offer insights into family matters and her appreciation for Fardeen Khan's work.",
            "key_points": [
                "Mumtaz praises Fardeen Khan as \"Heera Ladka\".",
                "Discusses her daughter's separation.",
                "Also praises his work in \"Heeramandi\"."
            ]
        },
        {
            "headline": "At 92, Vyjayanthimala transforms a chair into her stage!",
            "summary": "At the age of 92, veteran Indian actress Vyjayanthimala captivated audiences by transforming a simple chair into her stage, demonstrating her enduring grace and talent. Her performance is a testament to her timeless artistry and passion for the performing arts.",
            "key_points": [
                "Vyjayanthimala, at 92, used a chair as her stage.",
                "Demonstrated enduring grace and talent.",
                "Showcased her timeless artistry."
            ]
        },
        {
            "headline": "‘Stranger Things 5’ Vol 2 Teaser: Vecna's truth to be revealed",
            "summary": "A teaser for \"Stranger Things 5\" Vol 2 hints that the truth about Vecna will finally be unveiled. Fans are eagerly anticipating the final installment of the popular series, expecting major revelations and dramatic conclusions.",
            "key_points": [
                "\"Stranger Things 5\" Vol 2 teaser released.",
                "Promises to reveal Vecna's truth.",
                "Fans anticipate major revelations in the final season."
            ]
        },
        {
            "headline": "Christopher Nolan unveils new 'The Odyssey' Trailer - WATCH",
            "summary": "Christopher Nolan has released a new trailer for his upcoming film, \"The Odyssey,\" showcasing thrilling new clips. The trailer teases epic battles involving Matt Damon, Gods, and monsters, building anticipation for the mythological epic.",
            "key_points": [
                "Christopher Nolan unveils new trailer for \"The Odyssey.\"",
                "Trailer features thrilling clips and epic battles.",
                "Matt Damon, Gods, and monsters are teased in the film."
            ]
        },
        {
            "headline": "Enrique Iglesias and Anna Kournikova welcome their 4 child",
            "summary": "Enrique Iglesias and Anna Kournikova have welcomed their fourth child, expanding their family. The news brings joy to the couple and their fans globally, celebrating their growing family.",
            "key_points": [
                "Enrique Iglesias and Anna Kournikova welcomed their fourth child.",
                "Expands their family.",
                "News brings joy to the couple."
            ]
        },
        {
            "headline": "‘Driving Home For Christmas’ singer Chris Rea dies aged 74",
            "summary": "Chris Rea, the beloved singer-songwriter known for \"Driving Home For Christmas,\" has passed away at the age of 74. His death marks the loss of a revered musician whose work touched many during the festive season.",
            "key_points": [
                "Chris Rea, singer of \"Driving Home For Christmas,\" dies at 74.",
                "Known for his popular festive song.",
                "A loss for the music industry."
            ]
        },
        {
            "headline": "Sinners, accidents and battles: Here are the best movies of 2025",
            "summary": "A curated list of the best movies of 2025 has been released, featuring films themed around sinners, accidents, and battles. This compilation highlights cinematic achievements and diverse storytelling from the year, for global audiences.",
            "key_points": [
                "List of best movies of 2025 released.",
                "Features films on sinners, accidents, and battles.",
                "Highlights cinematic achievements and diverse storytelling."
            ]
        },
        {
            "headline": "Pyres, Screams and Light: Here are the Best Albums of 2025",
            "summary": "A selection of the best albums of 2025, titled \"Pyres, Screams and Light,\" has been compiled, showcasing musical highlights from the year. This list celebrates significant artistic contributions across various genres, appealing to a wide audience.",
            "key_points": [
                "List of best albums of 2025, \"Pyres, Screams and Light,\" released.",
                "Showcases musical highlights from the year.",
                "Celebrates significant artistic contributions."
            ]
        }
    ],
    "Sports": [
        {
            "headline": "'Disrespectful': Pak's Sarfaraz lashes out at India U19 boys; calls their act 'unethical'",
            "summary": "Pakistan's Sarfaraz has strongly criticized the India U19 boys, labeling their actions as \"disrespectful\" and \"unethical.\" This outburst highlights growing tensions and controversies in junior cricket between the rival nations.",
            "key_points": [
                "Pakistan's Sarfaraz criticizes India U19 team.",
                "Calls their actions \"disrespectful\" and \"unethical.\"",
                "Indicates growing tensions in junior cricket."
            ]
        },
        {
            "headline": "U19 Asia Cup: Vaibhav Sooryavanshi booed by Pakistan fans after India's defeat - Watch",
            "summary": "Vaibhav Sooryavanshi of India's U19 team was booed by Pakistan fans following India's defeat in the U19 Asia Cup. The incident underscores the intense rivalry between the two nations in cricket and the emotional reactions of fans.",
            "key_points": [
                "Vaibhav Sooryavanshi booed by Pakistan fans.",
                "Occurred after India's defeat in U19 Asia Cup.",
                "Highlights intense India-Pakistan cricket rivalry."
            ]
        },
        {
            "headline": "Stunning prediction! 'Shreyas Iyer can captain India to a World Cup win'",
            "summary": "A stunning prediction has been made that Indian cricketer Shreyas Iyer possesses the potential to lead India to a World Cup victory as captain. This highlights strong belief in his leadership abilities and strategic acumen.",
            "key_points": [
                "Prediction: Shreyas Iyer can lead India to World Cup win.",
                "Highlights belief in his captaincy.",
                "Points to his strategic acumen."
            ]
        },
        {
            "headline": "From Clarke to Yuvraj: Cricketers who battled cancer with courage",
            "summary": "The article celebrates cricketers like Michael Clarke and India's Yuvraj Singh who bravely fought cancer, highlighting their resilience on and off the field. Their stories serve as an inspiration, showcasing strength in adversity.",
            "key_points": [
                "Celebrates cricketers like Clarke and Yuvraj who battled cancer.",
                "Highlights their resilience and courage.",
                "Serves as an inspiration to many."
            ]
        },
        {
            "headline": "201 wickets, one favourite: Tendulkar's pick will surprise you",
            "summary": "Indian cricket legend Sachin Tendulkar has revealed his favorite among bowlers with 201 wickets, a choice that is expected to surprise many cricket enthusiasts. His selection provides unique insight into his perspective on the game.",
            "key_points": [
                "Tendulkar reveals his favorite bowler with 201 wickets.",
                "Choice expected to surprise many.",
                "Offers unique insight into his cricket perspective."
            ]
        },
        {
            "headline": "Asia Cup 2025: Indian-origin Jatinder Singh to led Oman",
            "summary": "Indian-origin cricketer Jatinder Singh has been named to lead Oman in the Asia Cup 2025, a significant milestone for him and for the team. This appointment reflects his leadership qualities and impact on Omani cricket, highlighting Indian diaspora's contribution.",
            "key_points": [
                "Indian-origin Jatinder Singh to captain Oman in Asia Cup 2025.",
                "Significant milestone for him and Omani cricket.",
                "Reflects his leadership and impact."
            ]
        },
        {
            "headline": "Diamond League Final: Neeraj Chopra's event preview, time and live telecast in India",
            "summary": "A preview for India's Olympic medalist Neeraj Chopra's event at the Diamond League Final includes details on its timing and live telecast options in India. This information is crucial for Indian fans eager to watch their star athlete compete.",
            "key_points": [
                "Preview for Neeraj Chopra's Diamond League Final event.",
                "Includes event time and live telecast details for India.",
                "Crucial for Indian fans to watch."
            ]
        },
        {
            "headline": "FIDE WC in India: PM Modi says 'Chess is gaining popularity among our youth'",
            "summary": "Prime Minister Modi noted the increasing popularity of chess among Indian youth during the FIDE World Cup in India. His statement highlights the growing engagement with the sport and its educational benefits for the nation.",
            "key_points": [
                "PM Modi observes rising popularity of chess among Indian youth.",
                "Statement made during FIDE World Cup in India.",
                "Highlights growing engagement and educational benefits of the sport."
            ]
        },
        {
            "headline": "Gully To Glory: Ramandeep Singh's journey from Chandigarh to Team India via KKR",
            "summary": "The article chronicles Ramandeep Singh's inspiring journey from local \"gully\" cricket in Chandigarh to playing for Team India, with a notable stop at KKR. His story exemplifies dedication and perseverance in achieving cricketing dreams within India.",
            "key_points": [
                "Ramandeep Singh's journey from Chandigarh to Team India.",
                "Includes his time with KKR.",
                "Story highlights dedication and perseverance in cricket."
            ]
        },
        {
            "headline": " 'We can't forget Pahalgam': Sehwag under fire for promoting IND vs PAK",
            "summary": "Former Indian cricketer Virender Sehwag is facing criticism for promoting an India vs Pakistan match, with critics invoking the memory of Pahalgam. The controversy highlights the sensitivity surrounding Indo-Pak relations and public expectations from national figures.",
            "key_points": [
                "Virender Sehwag criticized for promoting India vs Pakistan match.",
                "Critics evoke memory of Pahalgam.",
                "Highlights sensitivity of Indo-Pak relations."
            ]
        },
        {
            "headline": "Sehwag junior arrives! Aaryavir Sehwag smashes boundaries for fun",
            "summary": "Aaryavir Sehwag, son of Indian cricketing legend Virender Sehwag, is making headlines for his impressive batting, smashing boundaries with ease. His performance signals the emergence of a new talent in the cricketing world, carrying on a family legacy.",
            "key_points": [
                "Aaryavir Sehwag, Virender Sehwag's son, shows impressive batting.",
                "Making headlines for smashing boundaries.",
                "Signals the emergence of a new cricketing talent."
            ]
        },
        {
            "headline": "'Two reasons': Why was Dhoni promoted over Yuvraj? Sachin breaks silence",
            "summary": "Indian cricket legend Sachin Tendulkar has finally broken his silence on why MS Dhoni was promoted ahead of Yuvraj Singh in a crucial match, citing \"two reasons.\" His explanation sheds light on a significant strategic decision in Indian cricket history.",
            "key_points": [
                "Sachin Tendulkar explains Dhoni's promotion over Yuvraj.",
                "Cites \"two reasons\" for the decision.",
                "Sheds light on a key strategic moment in Indian cricket."
            ]
        },
        {
            "headline": "Hanuma Vihari joins Tripura after leaving Andhra Pradesh",
            "summary": "Indian cricketer Hanuma Vihari has officially joined the Tripura cricket team following his departure from Andhra Pradesh. This move marks a new chapter in his domestic cricket career, potentially bringing his experience to a new team in India.",
            "key_points": [
                "Hanuma Vihari joins Tripura cricket team.",
                "Follows his departure from Andhra Pradesh.",
                "Marks a new chapter in his domestic career."
            ]
        },
        {
            "headline": "'I have to go back again ... ': Rohit Sharma opens up",
            "summary": "Indian cricket captain Rohit Sharma has opened up about needing to \"go back again,\" hinting at a period of reflection or a return to basics. His statement suggests a personal or professional challenge he aims to address.",
            "key_points": [
                "Rohit Sharma expresses need to \"go back again.\"",
                "Hints at reflection or return to basics.",
                "Suggests addressing a personal or professional challenge."
            ]
        },
        {
            "headline": "Sarfaraz on fire! Back-to-back tons send strong message to selectors",
            "summary": "Indian cricketer Sarfaraz Khan is in exceptional form, having scored back-to-back centuries, sending a strong message to national selectors. His consistent high performance makes a compelling case for his inclusion in higher-level cricket.",
            "key_points": [
                "Sarfaraz Khan scores back-to-back centuries.",
                "Sends strong message to national selectors.",
                "Strong case for higher-level inclusion."
            ]
        },
        {
            "headline": "KCL thriller: Samson smashes century, but Muhammad steals show – Watch",
            "summary": "In a thrilling KCL match, Indian cricketer Sanju Samson scored a magnificent century, but it was Muhammad who ultimately stole the show with a remarkable performance. The game provided high drama and exceptional individual displays.",
            "key_points": [
                "Sanju Samson scored a century in a KCL thriller.",
                "Muhammad stole the show with a remarkable performance.",
                "Match featured high drama and exceptional displays."
            ]
        },
        {
            "headline": "Morocco begin AFCON 2025 with statement win over Comoros",
            "summary": "Morocco kicked off their AFCON 2025 campaign with a decisive statement win against Comoros, signaling their strong intent for the tournament. This victory establishes them as a formidable contender early in the competition.",
            "key_points": [
                "Morocco starts AFCON 2025 with a statement win.",
                "Defeated Comoros in their opening match.",
                "Establishes them as a strong contender."
            ]
        },
        {
            "headline": "NBA and FIBA to approach European clubs over new league plan",
            "summary": "The NBA and FIBA are reportedly planning to engage with European clubs regarding a proposal for a new basketball league. This initiative could significantly reshape the landscape of professional basketball in Europe, attracting global attention.",
            "key_points": [
                "NBA and FIBA to discuss new league with European clubs.",
                "Proposal aims to reshape European professional basketball.",
                "Indicates major changes for the sport in the region."
            ]
        }
    ],
    "Science": [
        {
            "headline": "IIT, Australian university develop nanotech drug delivery for breast cancer",
            "summary": "Researchers at an IIT in India and an Australian university have collaborated to develop an innovative nanotech drug delivery system specifically for breast cancer. This breakthrough holds significant promise for more targeted and effective cancer treatments globally.",
            "key_points": [
                "IIT and Australian university develop nanotech drug delivery.",
                "System is for breast cancer treatment.",
                "Promises more targeted and effective therapies."
            ]
        },
        {
            "headline": "Warming seas trigger record ‘bloom’ of octopuses in British waters",
            "summary": "Rising sea temperatures have led to a record-breaking \"bloom\" of octopuses in British waters, a phenomenon attributed to climate change. This ecological shift highlights the profound impact of global warming on marine biodiversity and ecosystems worldwide.",
            "key_points": [
                "Warming seas cause record octopus \"bloom\" in British waters.",
                "Attributed to climate change.",
                "Highlights impact of global warming on marine biodiversity."
            ]
        },
        {
            "headline": "How the galaxy frog’s striking appearance became its biggest threat",
            "summary": "The galaxy frog's distinctive appearance, while beautiful, has paradoxically become its greatest threat, making it a target for collectors and habitat destruction. This highlights the double-edged sword of unique species characteristics in conservation efforts.",
            "key_points": [
                "Galaxy frog's striking appearance is its biggest threat.",
                "Makes it a target for collectors and habitat destruction.",
                "Highlights challenges for unique species in conservation."
            ]
        }
    ],
    "Health": [
        {
            "headline": "This trendy oral habit can risk your heart! Understanding how tongue scraping can cause endocarditis, its symptoms, and managing oral care",
            "summary": "A popular oral habit, tongue scraping, has been linked to a potential risk of endocarditis, a severe heart condition. The article explains how this connection works, outlines the symptoms to watch for, and provides guidance on safer oral care practices, relevant for health-conscious Indians.",
            "key_points": [
                "Tongue scraping linked to potential risk of endocarditis.",
                "Explains the mechanism, symptoms, and oral care management.",
                "Highlights the importance of understanding oral health practices."
            ]
        },
        {
            "headline": "Integrative Ayurveda and yoga therapy in long-standing thalassemia-related anemia",
            "summary": "Integrative Ayurveda and yoga therapy are being explored for their efficacy in managing long-standing thalassemia-related anemia. This approach combines traditional Indian medicine and holistic practices to improve patient outcomes and quality of life.",
            "key_points": [
                "Ayurveda and yoga therapy explored for thalassemia-related anemia.",
                "Focus on managing long-standing condition.",
                "Aims to improve patient outcomes using holistic practices."
            ]
        },
        {
            "headline": "Sleep loss, stress, obesity emerging as key risks for breast cancer: ICMR study",
            "summary": "An ICMR study from India has identified sleep loss, stress, and obesity as increasingly significant risk factors for breast cancer. This research underscores the importance of lifestyle modifications and early interventions in cancer prevention, particularly in the Indian context.",
            "key_points": [
                "ICMR study links sleep loss, stress, obesity to breast cancer risk.",
                "Highlights emerging key risk factors.",
                "Emphasizes lifestyle modification for prevention."
            ]
        },
        {
            "headline": "Could lemon water be a helpful add-on for gout care? A pilot study offers early evidence",
            "summary": "A pilot study suggests that lemon water could potentially serve as a helpful supplementary treatment for gout care, offering early evidence for its benefits. This research opens avenues for natural remedies in managing the condition, a topic of interest in traditional health practices.",
            "key_points": [
                "Pilot study suggests lemon water for gout care.",
                "Offers early evidence of benefits.",
                "Opens avenues for natural remedies."
            ]
        },
        {
            "headline": "Diseases that surged in 2025: What we learned & how to stay prepared in 2026",
            "summary": "The article reviews diseases that saw a significant increase in 2025, detailing lessons learned and strategies for preparedness in 2026. This analysis aims to inform public health efforts and individual readiness for future health challenges globally.",
            "key_points": [
                "Reviews diseases that surged in 2025.",
                "Outlines lessons learned and preparedness strategies for 2026.",
                "Aims to inform public health and individual readiness."
            ]
        },
        {
            "headline": "7 iron and vitamin c rich fruit combos that can reduce the risk of anemia",
            "summary": "Seven fruit combinations rich in iron and Vitamin C are presented as effective ways to reduce the risk of anemia. These dietary suggestions offer practical advice for improving nutrient intake and overall health, especially for populations prone to deficiencies.",
            "key_points": [
                "Seven fruit combos rich in iron and Vitamin C.",
                "Aimed at reducing anemia risk.",
                "Offers practical dietary advice for health."
            ]
        },
        {
            "headline": "How much alcohol is safe to drink this Christmas? Experts can’t agree",
            "summary": "Experts are divided on what constitutes a safe amount of alcohol consumption during the Christmas period, reflecting ongoing debates in health guidelines. This lack of consensus leaves individuals with mixed messages regarding festive drinking habits.",
            "key_points": [
                "Experts disagree on safe alcohol limits for Christmas.",
                "Reflects ongoing debates in health guidelines.",
                "Leaves individuals with mixed messages on festive drinking."
            ]
        },
        {
            "headline": "Fake COVID-19 and flu tests found across Europe",
            "summary": "Counterfeit COVID-19 and flu test kits have been discovered circulating across Europe, raising significant public health concerns. These fake tests undermine diagnostic efforts and could lead to delayed treatment and increased spread of illness.",
            "key_points": [
                "Fake COVID-19 and flu tests found in Europe.",
                "Raises significant public health concerns.",
                "Undermines diagnosis and could increase illness spread."
            ]
        },
        {
            "headline": "Scientists simulate how bird flu could spread to humans",
            "summary": "Scientists have conducted simulations to understand the potential pathways and mechanisms through which bird flu could transmit to humans. This research is critical for developing effective preparedness strategies and preventing a widespread outbreak.",
            "key_points": [
                "Scientists simulate bird flu spread to humans.",
                "Aims to understand transmission pathways.",
                "Critical for preparedness and preventing outbreaks."
            ]
        },
        {
            "headline": "Can eating full-fat cheese protect your brain? New study says it might",
            "summary": "A new study suggests that consuming full-fat cheese might offer protective benefits for brain health, challenging conventional dietary wisdom. This research could lead to re-evaluation of dairy in brain-healthy diets.",
            "key_points": [
                "New study suggests full-fat cheese protects brain.",
                "Challenges conventional dietary advice.",
                "Could lead to re-evaluation of dairy in brain diets."
            ]
        },
        {
            "headline": "Spanish police raid research lab in African swine fever investigation",
            "summary": "Spanish police have raided a research lab as part of an investigation into African swine fever, indicating a serious probe into the disease's origins or spread. This action underscores the economic and agricultural threat posed by the highly contagious virus.",
            "key_points": [
                "Spanish police raid research lab for African swine fever.",
                "Serious investigation into disease origins/spread.",
                "Highlights economic and agricultural threat."
            ]
        }
    ]
}