{
    "World": [
        {
            "headline": "Over 4 decades in Maharashtra politics: Ajit Pawar's long innings ends with dream unfulfilled",
            "summary": "Veteran Maharashtra politician Ajit Pawar passed away, marking the end of a political career spanning over four decades. His death comes at a critical juncture for the state's political landscape, leaving behind an unfulfilled dream.",
            "key_points": [
                "Ajit Pawar, a prominent figure in Maharashtra politics, has died.",
                "His political career spanned over 40 years, with significant impact on the state.",
                "The death leaves his political ambitions and dreams unfulfilled."
            ]
        },
        {
            "headline": "Ajit Pawar's last rites to be held in Baramati at 11 am; PM Modi, Amit Shah to attend",
            "summary": "The last rites for Ajit Pawar will take place in his hometown of Baramati at 11 AM. Several prominent political figures, including Prime Minister Modi and Home Minister Amit Shah, are expected to attend, highlighting his stature.",
            "key_points": [
                "Ajit Pawar's funeral is scheduled for 11 AM in Baramati.",
                "Prime Minister Modi and Home Minister Amit Shah are confirmed attendees.",
                "The presence of top leaders underscores Pawar's political significance."
            ]
        },
        {
            "headline": "‘It was flying very low, suddenly it started spiralling & crashed’: Final moments of Learjet 45 that killed Ajit Pawar",
            "summary": "Eyewitness accounts detail the final moments of the Learjet 45 carrying Ajit Pawar, describing the plane flying unusually low before spiralling and crashing. Investigations are underway to determine the cause of the tragic accident.",
            "key_points": [
                "Eyewitnesses reported the Learjet 45 flying at a very low altitude.",
                "The aircraft was seen spiralling before it crashed.",
                "The incident led to the death of Ajit Pawar and is under investigation."
            ]
        },
        {
            "headline": "Xi sacks generals: Why turmoil may make China more dangerous, not less",
            "summary": "Chinese President Xi Jinping has reportedly sacked several generals, leading to significant turmoil within the military leadership. This internal upheaval could potentially make China more unpredictable and dangerous on the global stage, rather than weakening it.",
            "key_points": [
                "Several Chinese generals have been dismissed by President Xi Jinping.",
                "The leadership changes indicate significant internal turmoil within China's military.",
                "This instability could lead to a more dangerous and less predictable China internationally."
            ]
        },
        {
            "headline": "Column: If the middle-power moment has arrived, India must lead it",
            "summary": "A column argues that the current global landscape presents a 'middle-power moment,' an opportune time for nations like India to assume leadership roles. It posits that India is uniquely positioned to steer international discourse and action, given its growing economic and diplomatic influence.",
            "key_points": [
                "The global stage is set for middle powers to exert greater influence.",
                "India is identified as a key nation that should lead this new era.",
                "The country's increasing strength positions it for a leadership role."
            ]
        },
        {
            "headline": "After Putin, Xi Tells US To Back Off From Iran; Khamenei Warns 'Even Small Attack Would Trigger War'",
            "summary": "Following Russia's stance, China's President Xi Jinping has also warned the US to de-escalate tensions with Iran. Supreme Leader Khamenei of Iran further amplified the warning, stating that any minor attack would lead to a full-scale war, raising fears of a broader conflict.",
            "key_points": [
                "Chinese President Xi Jinping has urged the US to back off from Iran.",
                "Iran's Supreme Leader Khamenei threatened war in response to any attack.",
                "The warnings from global powers heighten concerns over escalating conflict in the region."
            ]
        },
        {
            "headline": "Iran's Drones & Ballistic Missiles Can Finish 40,000 US Troops: Rubio Drops Bombshell In US Senate",
            "summary": "During a US Senate hearing, Senator Marco Rubio issued a stark warning, claiming that Iran's arsenal of drones and ballistic missiles could neutralize 40,000 US troops. This statement underscores serious concerns about Iran's military capabilities and the potential risks to US forces in the region.",
            "key_points": [
                "Senator Marco Rubio stated Iran's weaponry could incapacitate a large number of US troops.",
                "The statement highlights the perceived threat of Iran's drone and missile capabilities.",
                "It raises serious security concerns for US military presence in the Middle East."
            ]
        },
        {
            "headline": "Uttarakhand horror: 25-year-old woman offered lift, raped in moving car; two arrested",
            "summary": "In a shocking incident in Uttarakhand, a 25-year-old woman was allegedly raped in a moving car after being offered a lift. Two suspects have been arrested by the police, and investigations are ongoing.",
            "key_points": [
                "A young woman was raped in a moving car in Uttarakhand.",
                "She was offered a lift by the perpetrators.",
                "Police have arrested two individuals in connection with the crime."
            ]
        },
        {
            "headline": "Children hid in closet: Indian national, 3 relatives shot dead in family dispute in US",
            "summary": "An Indian national and three relatives were tragically shot dead in the US during a family dispute, with children reportedly hiding in a closet. The incident highlights the devastating consequences of domestic violence and disputes within the community.",
            "key_points": [
                "An Indian national and three relatives were killed in a US shooting.",
                "The incident occurred during a family dispute, with children witnessing the tragedy.",
                "The event underscores the severe impact of internal family conflicts."
            ]
        },
        {
            "headline": "Indian-origin Keshav Poddar to serve as Jersey City deputy mayor; takes oath on Bhagwat Gita",
            "summary": "Keshav Poddar, an Indian-origin individual, has been appointed as the new deputy mayor of Jersey City. His oath-taking ceremony notably involved the Bhagwat Gita, signifying a cultural and religious acknowledgment in his new role.",
            "key_points": [
                "Keshav Poddar, of Indian origin, becomes Jersey City's new deputy mayor.",
                "He took his oath of office using the Bhagwat Gita.",
                "His appointment marks a significant moment for the Indian diaspora in US politics."
            ]
        }
    ],
    "Business": [
        {
            "headline": "‘Very disappointed’: Scott Bessent hits out at Europe over India-EU trade deal — what he said",
            "summary": "Scott Bessent has expressed strong disappointment with Europe's handling of the India-EU trade deal, criticizing certain aspects of the agreement. His comments highlight ongoing tensions and differing expectations surrounding the complex trade negotiations.",
            "key_points": [
                "Scott Bessent criticized Europe's approach to the India-EU trade deal.",
                "He expressed deep disappointment regarding the specifics of the agreement.",
                "His remarks point to underlying issues in the ongoing trade negotiations."
            ]
        },
        {
            "headline": "Will Budget 2026 provide clarity on cryptocurrency taxation, simplify compliance?",
            "summary": "Anticipation is high for Budget 2026 to bring much-needed clarity on cryptocurrency taxation and simplify compliance procedures. The crypto industry and investors are hoping for a progressive framework that fosters growth while ensuring regulatory oversight.",
            "key_points": [
                "Budget 2026 is expected to clarify cryptocurrency taxation.",
                "The industry seeks simpler compliance mechanisms for digital assets.",
                "A clear regulatory framework is crucial for the crypto market's future in India."
            ]
        },
        {
            "headline": "Top stocks to buy today: Stock recommendations today - check list",
            "summary": "Financial analysts have released their top stock recommendations for today, January 29, 2026. Investors are advised to review the curated list for potential buying opportunities in the market.",
            "key_points": [
                "A list of top stock recommendations for today is available.",
                "Investors can check the list for potential buying opportunities.",
                "These recommendations are provided by financial experts."
            ]
        },
        {
            "headline": "The EU deal India waited 18 years for finally arrives — with careful limits",
            "summary": "After 18 years of negotiations, India and the European Union have finally reached a trade agreement. The deal, though long-awaited, comes with carefully defined limits and clauses, reflecting the complex and often contentious nature of such extensive international trade pacts.",
            "key_points": [
                "India and the EU have concluded a trade deal after 18 years.",
                "The agreement includes specific limitations and conditions.",
                "The deal signifies a major milestone in economic relations despite its cautious framework."
            ]
        },
        {
            "headline": "FTA to open vast opportunities for India’s youth: PM",
            "summary": "Prime Minister Modi stated that the recently signed Free Trade Agreement (FTA) is set to unlock extensive opportunities for India's youth. He emphasized the potential for job creation, skill development, and increased economic engagement on a global scale.",
            "key_points": [
                "PM Modi highlighted the FTA's potential to create opportunities for Indian youth.",
                "The agreement is expected to boost job creation and skill development.",
                "It aims to enhance India's economic engagement globally."
            ]
        },
        {
            "headline": "At 7.8%, IIP growth hits over 2-year high",
            "summary": "India's Index of Industrial Production (IIP) has recorded a significant growth of 7.8%, reaching its highest level in over two years. This robust performance signals a strong recovery and expansion in the country's industrial sector.",
            "key_points": [
                "IIP growth reached 7.8%, a two-year high.",
                "The industrial sector shows strong recovery and expansion.",
                "This indicates positive momentum in India's economy."
            ]
        },
        {
            "headline": "Maruti net profit rises 4% on rebound in sales",
            "summary": "Maruti Suzuki has reported a 4% increase in its net profit, driven by a strong rebound in vehicle sales. The positive financial results reflect an improving market demand and effective strategies by the automotive giant.",
            "key_points": [
                "Maruti Suzuki's net profit increased by 4%.",
                "The growth is attributed to a significant rebound in sales.",
                "The results indicate a positive market trend for the auto sector."
            ]
        },
        {
            "headline": "Rupee slips to record low again, ends at 91.99 per dollar on month-end demand",
            "summary": "The Indian Rupee has once again fallen to a record low, closing at 91.99 against the US dollar, primarily due to month-end dollar demand. This depreciation raises concerns about import costs and inflation.",
            "key_points": [
                "The Indian Rupee hit a new record low of 91.99 per dollar.",
                "Increased month-end demand for the US dollar contributed to the fall.",
                "The depreciation has implications for India's economy and import prices."
            ]
        },
        {
            "headline": "‘India must use AI to create real economic value’",
            "summary": "Experts advocate for India to strategically leverage Artificial Intelligence (AI) to generate tangible economic value across various sectors. The focus is on implementing AI solutions that drive productivity, innovation, and sustainable growth, rather than just technological adoption.",
            "key_points": [
                "India needs to use AI to generate actual economic benefits.",
                "Emphasis is on practical AI applications for productivity and innovation.",
                "Strategic AI implementation is key for sustainable economic growth."
            ]
        },
        {
            "headline": "Tether is shaking up gold market with massive metal hoard",
            "summary": "Tether, a major stablecoin issuer, is significantly impacting the gold market by accumulating a massive hoard of physical gold. This move signals a diversification strategy and potentially a new player influencing gold prices and stability.",
            "key_points": [
                "Tether is acquiring a large amount of physical gold.",
                "This strategy is influencing the traditional gold market.",
                "It suggests a diversification in Tether's asset backing."
            ]
        }
    ],
    "Technology": [
        {
            "headline": "China’s new soft robot can float, crawl and walk through spaces others cannot",
            "summary": "Chinese researchers have developed an innovative soft robot capable of navigating complex environments by floating, crawling, and walking. This breakthrough in robotics offers new possibilities for exploration and operations in challenging terrains where traditional robots struggle.",
            "key_points": [
                "China has developed a versatile new soft robot.",
                "The robot can float, crawl, and walk, allowing it to traverse diverse spaces.",
                "This innovation could revolutionize exploration in difficult environments."
            ]
        },
        {
            "headline": "'For official use only': Indian-origin CISA acting director uploaded sensitive government files to public ChatGPT, says report",
            "summary": "An Indian-origin acting director at CISA (Cybersecurity and Infrastructure Security Agency) is under scrutiny for allegedly uploading sensitive government files marked 'for official use only' to a public ChatGPT. This incident raises serious concerns about data security and the misuse of AI tools within government agencies.",
            "key_points": [
                "An Indian-origin CISA acting director is accused of uploading classified files to ChatGPT.",
                "The files were marked 'for official use only.'",
                "The incident highlights significant government data security risks with AI tools."
            ]
        },
        {
            "headline": "AI mistake leads tourists to hunt fake Tasmania hot springs",
            "summary": "An AI error has reportedly misguided tourists in Tasmania to search for non-existent hot springs, causing frustration and wasted efforts. This incident underscores the potential for misinformation from AI-generated content and the need for verification.",
            "key_points": [
                "Tourists in Tasmania were misled by an AI error about hot springs.",
                "The AI-generated information led to a fruitless search for the fake location.",
                "The incident highlights issues of accuracy and reliability in AI-generated travel information."
            ]
        },
        {
            "headline": "EU wants AI to pay for using copyrighted work",
            "summary": "The European Union is proposing that AI systems should compensate creators for the use of copyrighted material in their training data. This move aims to protect intellectual property rights in the age of generative AI and ensure fair remuneration for artists and content producers.",
            "key_points": [
                "The EU is considering a policy for AI to pay for copyrighted content use.",
                "This initiative aims to protect intellectual property rights in AI development.",
                "The goal is to ensure fair compensation for creators whose work trains AI models."
            ]
        }
    ],
    "Entertainment": [
        {
            "headline": "Nicki Minaj calls herself Trump's 'No. 1 fan'",
            "summary": "Rapper Nicki Minaj publicly declared herself former President Trump's 'No. 1 fan,' a statement that quickly garnered significant attention. Her comment has sparked varied reactions across social media and the entertainment industry.",
            "key_points": [
                "Nicki Minaj publicly proclaimed herself a top fan of Donald Trump.",
                "Her statement has generated widespread reactions.",
                "The declaration sparked discussion in both political and entertainment spheres."
            ]
        },
        {
            "headline": "'Border 2' box office, day 7: Sunny Deol, Varun Dhawan, Ahan Shetty film eyes Rs 300 cr worldwide",
            "summary": "The film 'Border 2,' starring Sunny Deol, Varun Dhawan, and Ahan Shetty, is nearing a global box office collection of Rs 300 crore by its seventh day. The movie has shown strong performance, indicating a successful run.",
            "key_points": [
                "'Border 2' is performing strongly at the box office.",
                "The film is close to reaching Rs 300 crore worldwide by its seventh day.",
                "The movie features Sunny Deol, Varun Dhawan, and Ahan Shetty."
            ]
        },
        {
            "headline": "Revisiting Tubelight: Why Salman Khan’s most tender performance deserved more love",
            "summary": "A retrospective look at Salman Khan's film 'Tubelight' argues that his performance, often cited as one of his most tender, deserved greater critical and audience appreciation. The article delves into the nuances of his portrayal and the film's understated narrative.",
            "key_points": [
                "Salman Khan's performance in 'Tubelight' is being re-evaluated.",
                "His portrayal is considered one of his most tender and nuanced roles.",
                "The article suggests the film and his acting deserved more recognition."
            ]
        },
        {
            "headline": "Marc Anthony to welcome EIGHTH child: Singer announces 26-year-old wife Nadia Ferreira's pregnancy; David Beckham congratulates couple",
            "summary": "Renowned singer Marc Anthony is expecting his eighth child with his 26-year-old wife, Nadia Ferreira, who announced her pregnancy. The couple received congratulations from celebrity friends, including David Beckham, marking another addition to their growing family.",
            "key_points": [
                "Marc Anthony and Nadia Ferreira are expecting their eighth child.",
                "Nadia Ferreira announced her pregnancy, drawing widespread attention.",
                "Celebrities, including David Beckham, extended their congratulations."
            ]
        },
        {
            "headline": "Rubina Dilaik shares a video announcing 'I'm Pregnant'; Is the actress expecting another baby after twins Jeeva and Edha?",
            "summary": "Actress Rubina Dilaik caused a stir by sharing a video titled 'I'm Pregnant,' leading to speculation about whether she is expecting another child after her twins, Jeeva and Edha. Fans are eagerly awaiting clarification regarding the announcement.",
            "key_points": [
                "Rubina Dilaik posted a video hinting at a new pregnancy.",
                "This has led to speculation about another child after her twins.",
                "Fans are awaiting confirmation from the actress."
            ]
        }
    ],
    "Sports": [
        {
            "headline": "Shocking! 'Not feeling respected': Yuvraj reveals why he left cricket",
            "summary": "Cricket legend Yuvraj Singh has revealed that a 'lack of respect' was a key factor in his decision to retire from the sport. His candid comments shed light on the emotional toll and challenges faced by athletes even at the pinnacle of their careers.",
            "key_points": [
                "Yuvraj Singh stated a 'lack of respect' led to his cricket retirement.",
                "His revelation provides insight into the challenges faced by top athletes.",
                "The comments highlight the emotional aspects of a player's career."
            ]
        },
        {
            "headline": "Bangladesh says 'no security risks'; clears shooting team for India travel",
            "summary": "Bangladesh has affirmed that there are no security risks, clearing its national shooting team for travel to India. This assurance allows for smooth participation in upcoming events and strengthens sporting ties between the two nations.",
            "key_points": [
                "Bangladesh confirmed no security risks for its shooting team.",
                "The team is cleared to travel to India for upcoming competitions.",
                "This decision facilitates international sporting events and bilateral relations."
            ]
        },
        {
            "headline": "Stunning prediction! 'Shreyas Iyer can captain India to a World Cup win'",
            "summary": "A 'stunning prediction' suggests that Shreyas Iyer possesses the leadership qualities to captain India to a World Cup victory. This bold claim has sparked considerable debate among cricket pundits and fans regarding his potential as a future national captain.",
            "key_points": [
                "A prediction claims Shreyas Iyer could lead India to a World Cup title.",
                "This statement has generated significant discussion in the cricket community.",
                "It highlights Iyer's potential as a future captain for the Indian team."
            ]
        },
        {
            "headline": "From Clarke to Yuvraj: Cricketers who battled cancer with courage",
            "summary": "The article highlights inspiring stories of cricketers, including Michael Clarke and Yuvraj Singh, who bravely battled cancer and returned to or continued their careers. Their journeys serve as powerful testaments to resilience and determination in the face of adversity.",
            "key_points": [
                "The piece features cricketers like Clarke and Yuvraj who fought cancer.",
                "It showcases their courage and determination in overcoming the disease.",
                "These stories highlight resilience in the face of significant health challenges."
            ]
        },
        {
            "headline": "Sarfaraz on fire! Back-to-back tons send strong message to selectors",
            "summary": "Sarfaraz Khan is in exceptional form, hitting back-to-back centuries, which sends a strong message to national selectors. His consistent high performance is making a compelling case for his inclusion in higher-level teams.",
            "key_points": [
                "Sarfaraz Khan has scored consecutive centuries.",
                "His excellent form is strongly signaling his readiness to selectors.",
                "His consistent performance is building a strong case for national team selection."
            ]
        }
    ],
    "Science": [
        {
            "headline": "Australia uncovers the world’s largest dinosaur footprints from 130 million years ago",
            "summary": "Scientists in Australia have announced the discovery of the world's largest dinosaur footprints, dating back 130 million years. This monumental find provides unprecedented insights into the size and behavior of ancient dinosaurs.",
            "key_points": [
                "The world's largest dinosaur footprints, 130 million years old, were found in Australia.",
                "The discovery offers new data on the scale and habits of prehistoric dinosaurs.",
                "This represents a significant paleontological breakthrough."
            ]
        },
        {
            "headline": "Explained: Why is a penguin’s 'death march' going viral?",
            "summary": "A phenomenon dubbed the 'penguin death march' has gone viral, sparking widespread curiosity and concern. This article explains the scientific reasons behind this behavior, often linked to environmental factors and the challenges faced by these iconic birds.",
            "key_points": [
                "The 'penguin death march' phenomenon has gained viral attention.",
                "The article explains the scientific basis for this unique behavior.",
                "Environmental factors are often implicated in these penguin movements."
            ]
        },
        {
            "headline": "NASA’s Curiosity finds a Mars rock shaped like coral in a close-up image",
            "summary": "NASA's Curiosity rover on Mars has captured a close-up image of a rock formation remarkably resembling coral. This intriguing discovery provides further evidence of complex geological processes on the Red Planet and fuels research into its past environment.",
            "key_points": [
                "Curiosity rover on Mars photographed a coral-shaped rock.",
                "The discovery suggests complex geological formations exist on Mars.",
                "It contributes to understanding the planet's environmental history."
            ]
        }
    ],
    "Health": [
        {
            "headline": "Night owls face greater risk of heart attacks and strokes",
            "summary": "New research suggests that individuals with 'night owl' tendencies, who prefer late bedtimes and wake-up times, face a higher risk of heart attacks and strokes. The study highlights the potential health consequences of disrupted circadian rhythms on cardiovascular health.",
            "key_points": [
                "Night owls are at an increased risk for heart attacks and strokes.",
                "The findings link late sleep patterns to adverse cardiovascular outcomes.",
                "Disrupted circadian rhythms may play a critical role in these health risks."
            ]
        },
        {
            "headline": "Australian study finds heart cells can regenerate post-heart attack; India’s leading cardiologist calls it a ‘big step’",
            "summary": "An Australian study has made a groundbreaking discovery: heart cells possess the ability to regenerate after a heart attack. India's leading cardiologist hailed this as a 'big step,' offering significant hope for new therapeutic approaches to cardiac repair.",
            "key_points": [
                "Australian research shows heart cells can regenerate after a heart attack.",
                "This discovery offers new hope for cardiac repair treatments.",
                "A leading Indian cardiologist recognized it as a major medical advancement."
            ]
        },
        {
            "headline": "Obesity Rising Among Young Indians: Experts warn of early health risks; prevention is key",
            "summary": "Experts are raising alarms about the escalating rates of obesity among young Indians, warning of associated early health risks. They emphasize that preventive measures and lifestyle changes are crucial to address this growing public health concern.",
            "key_points": [
                "Obesity is increasing among young people in India.",
                "This trend is leading to early onset of various health risks.",
                "Prevention and lifestyle modifications are essential to combat the issue."
            ]
        }
    ]
}