{
    "World": [
        {
            "headline": "Mexico's most wanted drug lord El Mencho killed in major military op; revenge spree ensues",
            "summary": "Mexico's top drug lord, El Mencho, was killed in a military operation in Jalisco, leading to widespread retaliatory violence across several states. Supermarkets, banks, and cars were set ablaze, and transport networks were paralyzed, prompting travel advisories from the US and Canada.",
            "key_points": [
                "El Mencho, leader of Jalisco New Generation Cartel, was killed in a military operation.",
                "His death sparked violent retaliatory attacks, including arson and road blockages.",
                "US and Canada issued travel advisories due to the widespread violence.",
                "The Indian Embassy in Mexico also issued an advisory for its citizens to remain indoors."
            ]
        },
        {
            "headline": "India plans to buy Israel’s advanced drones, missiles, laser defence systems",
            "summary": "India is boosting its defence capabilities by acquiring advanced Israeli drones, missiles, and laser systems to establish a robust defence against potential Pakistani attacks. Discussions are anticipated during PM Modi's visit, with an MoU on security cooperation and technology transfer likely. This initiative seeks to integrate cutting-edge Israeli technology into India's defence strategy.",
            "key_points": [
                "India is acquiring advanced Israeli drones, missiles, and laser systems.",
                "The aim is to create an 'impregnable' defence against future Pakistani attacks.",
                "PM Modi's upcoming visit is expected to finalize deals, including technology transfer.",
                "This integrates Israeli tech with India's indigenous defence plans."
            ]
        },
        {
            "headline": "First ‘dementia village’ with shops, restaurant and theatre set to open in US to transform elderly care",
            "summary": "The US is set to open its first 'dementia village,' a specialized community designed to transform elderly care by providing a more engaging and dignified environment. The village will feature shops, restaurants, and a theatre, creating a familiar and stimulating setting for residents with dementia. This innovative model aims to improve the quality of life for those needing specialized memory care.",
            "key_points": [
                "First dementia village to open in the US.",
                "Designed with shops, restaurants, and a theatre for residents.",
                "Aims to provide a more engaging and dignified elderly care model.",
                "Focuses on improving quality of life for individuals with dementia."
            ]
        },
        {
            "headline": "18 dead, several injured in Nepal after passenger bus plunges into river in Dhading",
            "summary": "An early Monday bus accident in Dhading, Nepal, resulted in at least 18 fatalities and 25 injuries after a passenger bus plunged into the Trishuli River. The bus, traveling from Pokhara to Kathmandu with over 35 passengers, veered off the road. Rescue operations are ongoing amidst challenging nighttime conditions.",
            "key_points": [
                "Passenger bus accident in Nepal killed 18 and injured 25.",
                "The bus plunged into the Trishuli River in Dhading.",
                "It was traveling from Pokhara to Kathmandu with over 35 passengers.",
                "Rescue efforts are underway in difficult conditions."
            ]
        },
        {
            "headline": "‘Ambushed’: ABVP claims late-night attack by Left groups on JNU campus",
            "summary": "Jawaharlal Nehru University (JNU) experienced a violent clash on February 23, with ABVP accusing Left-wing groups of attacking students. ABVP reports that masked individuals disrupted study rooms, assaulted students, and allegedly mob-lynched one, leaving him blinded. The student group has condemned the violence and called for immediate police intervention.",
            "key_points": [
                "Violent clashes occurred at JNU campus on February 23.",
                "ABVP alleges Left-wing groups attacked their students.",
                "One student reportedly suffered severe injuries, including blindness.",
                "ABVP demands immediate police action against the assailants."
            ]
        },
        {
            "headline": "3 women from Arunachal Pradesh allege racial abuse by neighbours in south Delhi",
            "summary": "Three women from Arunachal Pradesh reported racial abuse and threats in Delhi's Malviya Nagar after an argument with neighbors over dirt escalated. The couple allegedly used derogatory remarks and intimidated the women. Police have registered a case under the BNS, and the accused couple has been called for investigation.",
            "key_points": [
                "Three women from Arunachal Pradesh faced racial abuse in Delhi.",
                "The incident occurred during an argument with neighbors over alleged dirt.",
                "Police have registered a case under relevant sections of BNS.",
                "The accused couple is being investigated."
            ]
        },
        {
            "headline": "Indian man killed in targeted firing Canada outside busy Toronto mall, cops clueless about shooters",
            "summary": "An Indian-origin man was killed in a targeted shooting outside a bustling Toronto mall in Canada, with police currently lacking leads on the perpetrators. The incident has raised concerns about safety for the Indian diaspora in the region. Authorities are investigating the circumstances surrounding the attack.",
            "key_points": [
                "An Indian-origin man was fatally shot in targeted firing in Toronto, Canada.",
                "The incident occurred outside a busy mall.",
                "Police have no immediate suspects or leads.",
                "The shooting has raised concerns among the Indian community."
            ]
        },
        {
            "headline": "US Ready to Hold New Nuclear Talks With Iran on Friday If Receives Deal Proposal: Reports",
            "summary": "Reports suggest the US is prepared to engage in new nuclear talks with Iran on Friday, contingent upon receiving a viable deal proposal from Tehran. This development indicates a potential diplomatic push to revive negotiations over Iran's nuclear program. International efforts aim to de-escalate tensions and secure a comprehensive agreement.",
            "key_points": [
                "US is reportedly ready for new nuclear talks with Iran on Friday.",
                "Condition is a viable deal proposal from Iran.",
                "Signals a potential diplomatic effort to revive nuclear negotiations.",
                "Aims to de-escalate tensions and secure a comprehensive agreement."
            ]
        },
        {
            "headline": "Afghanistan Vows Measured Response to Pakistan's Airstrikes: Defense Ministry",
            "summary": "Afghanistan's Defense Ministry has declared its intent to respond with a 'measured' approach to recent airstrikes conducted by Pakistan. This statement indicates rising tensions between the two nations following cross-border military actions. The international community is closely watching the situation for potential escalation.",
            "key_points": [
                "Afghanistan's Defense Ministry vowed a 'measured response' to Pakistani airstrikes.",
                "The announcement highlights rising cross-border tensions.",
                "International community is monitoring for potential escalation.",
                "This follows recent military actions by Pakistan."
            ]
        },
        {
            "headline": "West, Global Corporations Now Control Nearly All Ukrainian Assets: Ex-PM",
            "summary": "A former Ukrainian Prime Minister claims that the West and global corporations have gained control over almost all of Ukraine's assets. This assertion suggests a significant transfer of economic power and influence amidst ongoing geopolitical shifts. The statement raises questions about Ukraine's economic sovereignty and future reconstruction.",
            "key_points": [
                "Ex-Ukrainian PM claims West and global corporations control nearly all Ukrainian assets.",
                "This implies a significant transfer of economic power.",
                "Raises questions about Ukraine's economic sovereignty.",
                "Highlights implications for future reconstruction efforts."
            ]
        },
        {
            "headline": "What New Bangladesh Government Means for India?",
            "summary": "The formation of a new government in Bangladesh holds significant implications for India, particularly concerning bilateral relations, regional stability, and economic cooperation. Analysts are evaluating how the new administration's policies and priorities might influence India's strategic interests and ongoing projects with its eastern neighbor. The dynamic could affect trade, security, and diplomatic ties.",
            "key_points": [
                "New Bangladesh government has significant implications for India.",
                "Impacts bilateral relations, regional stability, and economic cooperation.",
                "Analysts are assessing the new administration's policies.",
                "Could influence India's strategic interests, trade, and security."
            ]
        },
        {
            "headline": "Potential US Intervention in Iran: Implications for India",
            "summary": "The potential for US military intervention in Iran carries serious implications for India, particularly regarding energy security, regional stability, and trade routes. Such a conflict could disrupt global oil supplies, impact Indian expatriates in the Middle East, and necessitate complex diplomatic maneuvers. India would likely face challenges in maintaining its strategic autonomy and economic interests in a volatile region.",
            "key_points": [
                "Potential US intervention in Iran has serious implications for India.",
                "Key concerns include energy security and regional stability.",
                "Could disrupt global oil supplies and impact Indian expatriates.",
                "India would face diplomatic challenges and impact on economic interests."
            ]
        }
    ],
    "Business": [
        {
            "headline": "SCOTUS ruling opens door to better deal? Govt pauses US trade team visit amid Tariff turbulence",
            "summary": "India has postponed its trade deal negotiations with the US following the Supreme Court's invalidation of Trump-era tariffs. This delay allows India to assess the ruling's impact, particularly as similar tariff agreements with nations like South Korea have also been nullified. The government aims to leverage this new legal landscape for potentially more favorable trade terms.",
            "key_points": [
                "India postponed trade talks with the US after the Supreme Court blocked Trump's tariffs.",
                "The move allows India to evaluate the ruling's implications for trade agreements.",
                "Other nations like South Korea have also seen their tariff agreements nullified.",
                "India aims to explore opportunities for a better trade deal."
            ]
        },
        {
            "headline": "IDFC First reports Rs 590cr fraud in Haryana govt a/c; bank suspends 4 employees pending probe",
            "summary": "IDFC First Bank has reported a significant fraud amounting to Rs 590 crore in a Haryana government account, leading to the suspension of four employees. The bank has initiated a thorough investigation into the matter. This incident highlights ongoing concerns regarding financial security and oversight within banking operations involving government funds.",
            "key_points": [
                "IDFC First Bank reported a Rs 590 crore fraud in a Haryana government account.",
                "Four bank employees have been suspended pending an investigation.",
                "The incident raises concerns about financial security and oversight.",
                "A full probe has been launched into the fraudulent activity."
            ]
        },
        {
            "headline": "SBI plans to raise green advances share up to 10% by 2030, launches centre for sunrise sectors",
            "summary": "State Bank of India (SBI) aims to increase its share of green advances to 10% by 2030, demonstrating its commitment to sustainable finance. The bank has also launched a dedicated center for sunrise sectors to foster growth in emerging and environmentally friendly industries. This strategic move aligns with global sustainability goals and India's green economy initiatives.",
            "key_points": [
                "SBI targets 10% green advances by 2030, focusing on sustainable finance.",
                "A new center has been launched to support 'sunrise sectors'.",
                "This initiative aligns with global sustainability and India's green economy.",
                "It aims to foster growth in emerging and environmentally friendly industries."
            ]
        },
        {
            "headline": "India-EU FTA to deepen trade ties and tech cooperation, says Austrian official",
            "summary": "An Austrian official has expressed optimism that the India-EU Free Trade Agreement (FTA) will significantly deepen trade relations and foster greater technological cooperation between the two regions. The FTA is expected to streamline economic exchanges, reduce barriers, and open new avenues for collaboration in various sectors, including advanced technologies.",
            "key_points": [
                "India-EU FTA is expected to deepen trade ties and tech cooperation.",
                "An Austrian official highlighted the positive outlook.",
                "The agreement aims to streamline economic exchanges and reduce trade barriers.",
                "It will open new avenues for collaboration in advanced technologies."
            ]
        },
        {
            "headline": "Top stocks to buy: Stock recommendations for this week - check list",
            "summary": "Motilal Oswal Financial Services Ltd has recommended Max Financial and Delhivery as top stock picks for the trading week starting February 23, 2026. The recommendations are based on detailed analysis of market performance and company fundamentals. Investors are advised to review the comprehensive analysis before making investment decisions.",
            "key_points": [
                "Motilal Oswal recommends Max Financial and Delhivery as top stocks.",
                "Recommendations are for the week starting February 23, 2026.",
                "Analysis is based on market performance and company fundamentals.",
                "Investors should review detailed analysis before investing."
            ]
        },
        {
            "headline": "India, Brazil Sign Deal on Critical Minerals: Modi",
            "summary": "Prime Minister Modi announced that India and Brazil have signed a crucial deal on critical minerals, strengthening bilateral cooperation in a strategic sector. This agreement aims to secure essential resources for India's burgeoning industrial and technological needs. The partnership underscores growing economic ties and a shared vision for resource independence.",
            "key_points": [
                "India and Brazil signed a deal on critical minerals.",
                "Aims to secure essential resources for India's industrial and technological needs.",
                "Strengthens bilateral cooperation in a strategic sector.",
                "Underscores growing economic ties and resource independence vision."
            ]
        },
        {
            "headline": "India Launches $2.98 Bln Export Promotion Mission to Power MSMEs, Boost Global Trade",
            "summary": "India has launched a substantial $2.98 billion Export Promotion Mission aimed at empowering Micro, Small, and Medium Enterprises (MSMEs) and significantly boosting the nation's global trade presence. This initiative seeks to provide financial support, market access, and capacity building for MSMEs. The mission is crucial for diversifying India's export basket and enhancing its competitiveness on the international stage.",
            "key_points": [
                "India launched a $2.98 billion Export Promotion Mission.",
                "Aims to empower MSMEs and boost global trade.",
                "Provides financial support, market access, and capacity building for MSMEs.",
                "Crucial for diversifying India's exports and enhancing global competitiveness."
            ]
        },
        {
            "headline": "Brazil’s Embraer Joins Mahindra for New India-Based MRO Powerhouse",
            "summary": "Brazilian aerospace giant Embraer has partnered with Mahindra to establish a new Maintenance, Repair, and Overhaul (MRO) powerhouse in India. This collaboration signifies a major boost for India's aviation sector, promoting indigenous capabilities and creating high-skilled jobs. The MRO facility will cater to growing demand and enhance India's self-reliance in aerospace maintenance.",
            "key_points": [
                "Embraer and Mahindra partnered to create an India-based MRO facility.",
                "Boosts India's aviation sector and indigenous capabilities.",
                "Will create high-skilled jobs and cater to growing demand.",
                "Enhances India's self-reliance in aerospace maintenance."
            ]
        },
        {
            "headline": "Russia Stays Vital to India’s Oil Supply: Oil Analyst Rejects US Claim",
            "summary": "An oil analyst has refuted US claims, asserting that Russia remains a critical and indispensable supplier of oil to India. This statement highlights India's strategic energy diversification and its continued reliance on Russian crude amidst global geopolitical pressures. The analysis underscores the economic realities shaping India's import policies despite Western attempts to limit Russian energy exports.",
            "key_points": [
                "Oil analyst asserts Russia is vital to India’s oil supply, rejecting US claims.",
                "Highlights India's strategic energy diversification.",
                "Underscores India's continued reliance on Russian crude.",
                "Economic realities shape India's import policies despite Western pressure."
            ]
        }
    ],
    "Technology": [
        {
            "headline": "Can India build AI muscle on a modest public purse?",
            "summary": "India's ambitious tech goals, particularly in AI, face a significant challenge due to the high cost of advanced chips (around $40k each) and an estimated annual electricity bill of ₹800 crore for a single setup. This raises questions about whether the government can adequately fund and efficiently manage the resources needed to build a competitive AI infrastructure with limited public funds.",
            "key_points": [
                "India's AI ambitions require substantial investment in expensive chips ($40k each).",
                "A single AI setup could incur an annual electricity bill of ₹800 crore.",
                "The article questions India's ability to build AI muscle with a modest public purse.",
                "Efficient government funding and resource management are crucial."
            ]
        },
        {
            "headline": "Internet slams Sam Altman over his 'reminder' to everyone that humans use a lot of ...",
            "summary": "Sam Altman, a prominent figure in the tech industry, is facing backlash online for his recent 'reminder' about the significant energy consumption associated with human activity. Critics are questioning the timing and tone of his comments, interpreting them as a distraction from the environmental impact of AI development itself. The controversy highlights growing concerns about tech's ecological footprint.",
            "key_points": [
                "Sam Altman is facing internet backlash.",
                "The criticism stems from his comment on human energy consumption.",
                "Critics see it as a deflection from AI's environmental impact.",
                "The incident highlights growing concerns over tech's ecological footprint."
            ]
        },
        {
            "headline": "From ₹9,000 salary to CEO: How Dadasaheb Bhagat built India’s own Canva-like platform",
            "summary": "Dadasaheb Bhagat's inspiring journey from a ₹9,000 salary to becoming a CEO highlights his success in building India's own Canva-like design platform. His story showcases entrepreneurial spirit and innovation, demonstrating how a visionary can create a significant impact in the tech industry. This achievement provides a home-grown alternative in the competitive design software market.",
            "key_points": [
                "Dadasaheb Bhagat's journey from a ₹9,000 salary to CEO is inspiring.",
                "He successfully built India's own Canva-like design platform.",
                "His story exemplifies entrepreneurial spirit and innovation.",
                "The platform offers a home-grown alternative in design software."
            ]
        },
        {
            "headline": "India creating ‘amazing flywheel’ in open source: Microsoft’s Sharma",
            "summary": "According to Microsoft's Sharma, India is establishing an 'amazing flywheel' in the open-source community, driven by widespread adoption and contribution. This growing engagement positions India as a significant player in collaborative software development. The momentum indicates a vibrant ecosystem that fosters innovation and knowledge sharing.",
            "key_points": [
                "Microsoft's Sharma states India is building an 'amazing flywheel' in open source.",
                "This indicates growing adoption and contribution within the community.",
                "India is becoming a significant player in collaborative software development.",
                "The momentum fosters innovation and knowledge sharing."
            ]
        },
        {
            "headline": "IBM opens AI GovTech centre in Lucknow",
            "summary": "IBM has inaugurated an AI GovTech centre in Lucknow, marking a significant investment in India's public sector technology landscape. This new facility aims to leverage artificial intelligence to enhance government services and drive digital transformation. The initiative reflects a commitment to empowering public administration with cutting-edge technological solutions.",
            "key_points": [
                "IBM opened an AI GovTech centre in Lucknow, India.",
                "The centre aims to enhance government services using AI.",
                "It signifies a major investment in India's public sector technology.",
                "The initiative will drive digital transformation in public administration."
            ]
        },
        {
            "headline": "India Aims For Ethical AI Future as PM Modi Reveals MANAV Vision",
            "summary": "Prime Minister Modi has unveiled the 'MANAV Vision,' outlining India's commitment to fostering an ethical future for Artificial Intelligence. This initiative emphasizes responsible AI development and deployment, focusing on fairness, transparency, and accountability. India aims to lead in creating AI solutions that benefit humanity while upholding strong ethical principles.",
            "key_points": [
                "PM Modi revealed 'MANAV Vision' for India's ethical AI future.",
                "Emphasizes responsible AI development, fairness, transparency, and accountability.",
                "India aims to lead in creating human-benefiting AI solutions.",
                "Commitment to upholding strong ethical principles in AI."
            ]
        },
        {
            "headline": "India Sets Deadline for Indigenous Fighter Jet Engine: Is 5-7 Year Target Achievable?",
            "summary": "India has set an ambitious deadline of 5-7 years to develop an indigenous fighter jet engine, a crucial step towards self-reliance in defence manufacturing. This target, while challenging, reflects India's determination to reduce dependency on foreign suppliers for critical military hardware. Experts are debating the feasibility of achieving this complex technological feat within the stipulated timeframe.",
            "key_points": [
                "India aims for an indigenous fighter jet engine within 5-7 years.",
                "A crucial step towards self-reliance in defence manufacturing.",
                "Reduces dependency on foreign suppliers for military hardware.",
                "Feasibility of the ambitious technological feat is being debated."
            ]
        },
        {
            "headline": "How AI Reshapes Military Capabilities Across New Domains?",
            "summary": "Artificial Intelligence is rapidly transforming military capabilities across various new domains, from autonomous weapon systems to enhanced intelligence gathering and cyber warfare. This reshaping includes faster decision-making, predictive analytics for logistics, and advanced simulation for training. The integration of AI significantly alters the landscape of modern warfare and national security strategies.",
            "key_points": [
                "AI is transforming military capabilities in new domains.",
                "Includes autonomous weapons, intelligence gathering, and cyber warfare.",
                "Enables faster decision-making and predictive analytics.",
                "Significantly alters modern warfare and national security strategies."
            ]
        },
        {
            "headline": "More Than a Plane: SJ-100 is India's Fast Track to Aviation Self-Reliance",
            "summary": "The SJ-100 project is positioned as more than just a new aircraft; it's India's expedited pathway to achieving self-reliance in the aviation sector. This ambitious program aims to foster indigenous design, development, and manufacturing capabilities for commercial aircraft. The success of the SJ-100 is critical for reducing India's dependence on foreign aviation technology and boosting its aerospace industry.",
            "key_points": [
                "SJ-100 project is India's fast track to aviation self-reliance.",
                "Aims to foster indigenous design, development, and manufacturing of aircraft.",
                "Critical for reducing dependence on foreign aviation technology.",
                "Will boost India's domestic aerospace industry."
            ]
        }
    ],
    "Entertainment": [
        {
            "headline": "BAFTAs 2026: Farhan Akhtar on playing Ravi Shankar in 'The Beatles' biopic: 'It's exciting and daunting'",
            "summary": "Farhan Akhtar expressed both excitement and apprehension about portraying the legendary sitarist Ravi Shankar in 'The Beatles' biopic at the BAFTAs 2026. The role is a significant international project for the Indian actor, offering a global platform while presenting the challenge of embodying a musical icon. His comments highlight the pressure and prestige associated with such a role.",
            "key_points": [
                "Farhan Akhtar to play Ravi Shankar in 'The Beatles' biopic.",
                "He described the role as both 'exciting and daunting' at the BAFTAs.",
                "This is a significant international project for the Indian actor.",
                "The role carries the pressure and prestige of portraying a musical icon."
            ]
        },
        {
            "headline": "After Aishwarya Rai Bachchan and Salman Khan, Matthew McConaughey urges Hollywood stars to copyright their likeness",
            "summary": "Following in the footsteps of Indian actors Aishwarya Rai Bachchan and Salman Khan, Hollywood star Matthew McConaughey is advocating for celebrities to copyright their likeness. He argues there's 'too much money to be made' from unauthorized use, highlighting the growing concern among public figures regarding digital reproduction and AI-generated content. This push reflects a broader industry movement for greater control over personal images.",
            "key_points": [
                "Matthew McConaughey urges Hollywood stars to copyright their likeness.",
                "He follows Indian stars Aishwarya Rai Bachchan and Salman Khan in this stance.",
                "The reason cited is 'too much money to be made' from unauthorized use.",
                "This reflects growing concerns about digital reproduction and AI."
            ]
        },
        {
            "headline": "Prakash Raj mocks 'The Kerala Story 2', posts photos of beef and pork dishes, says ‘All of them live in harmony'",
            "summary": "Actor Prakash Raj has publicly mocked the concept of 'The Kerala Story 2' by posting images of beef and pork dishes, claiming they symbolize the harmony in which people of different faiths coexist. His comments and visual protest are seen as a direct critique of the narrative promoted by the film. This act has generated considerable discussion and controversy.",
            "key_points": [
                "Prakash Raj mocked 'The Kerala Story 2'.",
                "He posted photos of beef and pork dishes to symbolize communal harmony.",
                "His act is a critique of the film's narrative.",
                "The comments have sparked significant discussion and controversy."
            ]
        },
        {
            "headline": "Shahid's 'O' Romeo' sails past Rs 83 crore worldwide",
            "summary": "Shahid Kapoor's film 'O' Romeo' has achieved significant box office success, grossing over Rs 83 crore worldwide. This strong performance indicates the film's popularity with audiences globally. The achievement solidifies Shahid Kapoor's position as a commercially viable star in the international market.",
            "key_points": [
                "Shahid Kapoor's film 'O' Romeo' grossed over Rs 83 crore worldwide.",
                "The movie achieved significant box office success.",
                "Its performance indicates strong global popularity.",
                "This solidifies Shahid Kapoor's commercial viability internationally."
            ]
        }
    ],
    "Sports": [
        {
            "headline": "India's T20 World Cup title defence in jeopardy after crushing defeat to South Africa; Miller-Sundar spat",
            "summary": "India's T20 World Cup title hopes suffered a major setback with a 76-run defeat to South Africa, putting their defence in jeopardy. Despite a promising start, India's chase faltered after David Miller's 63-run innings propelled South Africa to a formidable total. The match also saw a heated mid-innings exchange between Miller and Washington Sundar, adding to the drama.",
            "key_points": [
                "India lost to South Africa by 76 runs in the T20 World Cup.",
                "The defeat puts India's title defence in jeopardy.",
                "David Miller's 63 runs helped South Africa set a high target.",
                "A heated exchange occurred between Miller and Washington Sundar."
            ]
        },
        {
            "headline": "Sexual harassment row in Bangladesh cricket: BCB bans ex-women’s selector",
            "summary": "The Bangladesh Cricket Board (BCB) has banned former women’s selector Monjurul Islam from all cricket roles after initial proof of sexual misconduct allegations by ex-captain Jahanara Alam. An inquiry panel found his behavior constituted harassment. The BCB stated further action might be taken and also announced dates for the Women’s Bangladesh Premier League and extended chief selector Gazi Ashraf Hossain’s term.",
            "key_points": [
                "Bangladesh Cricket Board (BCB) banned former women’s selector Monjurul Islam.",
                "Ban follows sexual misconduct allegations by ex-captain Jahanara Alam.",
                "Inquiry found initial proof of harassment.",
                "BCB may take further action and announced Women’s BPL dates."
            ]
        },
        {
            "headline": "NBA legend Kobe Bryant receives powerful tribute from Ryan Garcia after stunning WBC welterweight championship win",
            "summary": "Boxing sensation Ryan Garcia paid a powerful tribute to NBA legend Kobe Bryant following his stunning victory in the WBC welterweight championship. Garcia's dedication highlighted Bryant's enduring influence on athletes across different sports, even years after his passing. The gesture resonated with fans, underscoring the universal impact of Bryant's legacy of dedication and excellence.",
            "key_points": [
                "Ryan Garcia paid tribute to Kobe Bryant after his WBC welterweight win.",
                "The tribute highlighted Bryant's enduring influence on athletes.",
                "It resonated with fans, showcasing Bryant's legacy of excellence.",
                "Garcia's victory was a stunning upset in the boxing world."
            ]
        },
        {
            "headline": "FIDE WC in India: PM Modi says 'Chess is gaining popularity among our youth'",
            "summary": "During the FIDE World Cup in India, Prime Minister Modi remarked that chess is experiencing a surge in popularity among Indian youth. His statement underscores the growing interest in strategic games and the potential for India to emerge as a global chess powerhouse. The event itself serves as a platform to further inspire young talent and promote intellectual sports.",
            "key_points": [
                "PM Modi noted the rising popularity of chess among Indian youth during FIDE World Cup.",
                "His comments highlight India's potential as a global chess powerhouse.",
                "The event promotes strategic games and inspires young talent.",
                "This indicates a growing interest in intellectual sports in India."
            ]
        }
    ],
    "Science": [
        {
            "headline": "Hell heron: 95-million-year-old new dinosaur species found in the Sahara Desert",
            "summary": "Scientists have discovered a new dinosaur species, dubbed 'Hell Heron,' in the Sahara Desert, dating back 95 million years. This significant paleontological find provides new insights into the prehistoric biodiversity of the region and the evolution of avian-like dinosaurs. The discovery challenges existing understandings of dinosaur distribution and characteristics during the Cretaceous period.",
            "key_points": [
                "A new dinosaur species, 'Hell Heron,' was discovered in the Sahara Desert.",
                "The species dates back 95 million years.",
                "It offers new insights into prehistoric biodiversity and avian-like dinosaur evolution.",
                "The discovery may alter understanding of Cretaceous period dinosaur distribution."
            ]
        }
    ],
    "Health": [
        {
            "headline": "70% of Indian women face gynecological problems: Doctor shares 7 ways to protect your health",
            "summary": "A doctor has revealed that a staggering 70% of Indian women suffer from gynecological problems, highlighting a widespread health crisis. The expert shared seven crucial ways women can protect their health, emphasizing awareness, preventative care, and timely medical intervention. This information aims to empower women with knowledge to address and mitigate common gynecological issues.",
            "key_points": [
                "70% of Indian women face gynecological problems.",
                "A doctor shared 7 ways to protect women's health.",
                "Emphasis is on awareness, preventative care, and timely intervention.",
                "Aims to empower women to address common gynecological issues."
            ]
        },
        {
            "headline": "Childhood epilepsy in India: How early care is changing young lives",
            "summary": "Early intervention and comprehensive care are significantly transforming the lives of children with epilepsy in India. Advances in diagnosis and treatment, coupled with increased awareness, are leading to better outcomes and improved quality of life for young patients. This focus on early care helps mitigate long-term complications and supports better integration into society.",
            "key_points": [
                "Early care is transforming lives of children with epilepsy in India.",
                "Advances in diagnosis and treatment are leading to better outcomes.",
                "Increased awareness is crucial for improved quality of life.",
                "Focus on early intervention helps mitigate long-term complications."
            ]
        },
        {
            "headline": "Good fasting sugar but high HbA1c: How is that possible? Doctor clears the confusion around diabetes tests",
            "summary": "Many individuals experience confusion when their fasting blood sugar levels are normal but their HbA1c results are high, indicating diabetes. A doctor clarifies this common discrepancy, explaining that HbA1c provides an average blood sugar level over two to three months, capturing post-meal spikes that fasting tests miss. Understanding both tests is crucial for accurate diabetes diagnosis and management.",
            "key_points": [
                "Confusion arises from normal fasting sugar but high HbA1c results.",
                "A doctor explains the discrepancy in diabetes tests.",
                "HbA1c shows average blood sugar over 2-3 months, including post-meal spikes.",
                "Both tests are crucial for accurate diagnosis and management."
            ]
        }
    ]
}