{
    "World": [
        {
            "headline": "No double standards in global terror fight: PM Modi at G20",
            "summary": "Prime Minister Modi addressed the G20 summit, emphasizing the need for a united and consistent approach against global terrorism. He highlighted that nations must avoid selective application of anti-terror measures, underscoring India's firm stance on global security.",
            "key_points": [
                "PM Modi called for unified global action against terrorism.",
                "He urged G20 nations to reject \"double standards\" in combating terror.",
                "The statement underscores India's firm stance on global security."
            ]
        },
        {
            "headline": "Putin's Upcoming Visit to India Very Important: Kremlin Aide",
            "summary": "A Kremlin aide has underscored the immense importance of Russian President Vladimir Putin's forthcoming visit to India. This high-level visit is expected to bolster bilateral relations, particularly in strategic and economic sectors, between the two nations.",
            "key_points": [
                "Kremlin highlights the significance of Putin's upcoming India visit.",
                "The visit aims to strengthen Russia-India bilateral relations.",
                "Focus is expected on strategic and economic cooperation."
            ]
        },
        {
            "headline": "Indian man visits Canada to see newborn grandchild, harasses teens; faces deportation",
            "summary": "An Indian man traveling to Canada to meet his newborn grandchild is facing deportation after being accused of harassing teenagers. This incident highlights the strict laws and consequences for such behavior in foreign countries.",
            "key_points": [
                "Indian man faces deportation from Canada.",
                "Accused of harassing teenagers during his visit to see his grandchild.",
                "The incident underscores legal repercussions for misconduct abroad."
            ]
        },
        {
            "headline": "US Targets Indian Oil Company Under New Sanctions on Iran",
            "summary": "An Indian oil company has reportedly been targeted by the US under new sanctions against Iran. This move could complicate India's energy trade relations and its strategic autonomy in foreign policy, posing a significant challenge for the Indian government.",
            "key_points": [
                "US sanctions now include an Indian oil company over Iran ties.",
                "This could impact India's energy trade relations.",
                "The move challenges India's strategic autonomy."
            ]
        },
        {
            "headline": "India to Launch Air Cargo Service to Afghanistan: MEA",
            "summary": "India's Ministry of External Affairs has announced plans to launch an air cargo service to Afghanistan. This initiative aims to facilitate trade and humanitarian aid, bypassing traditional land routes and strengthening economic ties with the landlocked nation.",
            "key_points": [
                "India's MEA announces an air cargo service to Afghanistan.",
                "The service will boost trade and humanitarian aid.",
                "It aims to strengthen economic ties and bypass land routes."
            ]
        },
        {
            "headline": "French Navy rubbishes Pakistan's Rafale claim",
            "summary": "The French Navy has publicly refuted Pakistan's assertions regarding the Rafale fighter jets, likely concerning performance or procurement. This dismissal reaffirms France's position on its advanced military aircraft and potentially impacts regional defense narratives.",
            "key_points": [
                "French Navy rejects Pakistan's claims about Rafale jets.",
                "The issue likely pertains to the capabilities or acquisition of the aircraft.",
                "The statement could influence regional defense discussions."
            ]
        }
    ],
    "Business": [
        {
            "headline": "Why your PF earnings are set to go up and your take-home pay down",
            "summary": "Changes in provident fund regulations are poised to increase PF earnings for employees, while simultaneously leading to a reduction in their monthly take-home salary. This shift is part of broader financial policy adjustments aimed at long-term savings and social security.",
            "key_points": [
                "PF earnings are expected to increase for employees.",
                "Monthly take-home pay will likely decrease.",
                "The changes reflect new financial policy adjustments for long-term savings."
            ]
        },
        {
            "headline": "Explained: How India’s labour codes will reshape wage, social security",
            "summary": "India's new labour codes are set to significantly reform the country's wage structure and social security framework. These codes aim to standardize labor practices, potentially affecting worker benefits, payrolls, and compliance requirements for businesses.",
            "key_points": [
                "New labour codes will redefine wage structures.",
                "Major changes are coming to social security provisions.",
                "The reforms impact worker benefits and business compliance."
            ]
        },
        {
            "headline": "M&M, L&T & more: Top stocks on brokers' radar today",
            "summary": "Mahindra & Mahindra, Larsen & Toubro, and other prominent stocks are currently under close observation by brokers due to various market factors. Investors are advised to monitor these equities for potential movements and investment opportunities.",
            "key_points": [
                "Key stocks like M&M and L&T are being watched by brokers.",
                "Market factors are influencing their current status.",
                "The report offers insights for potential investment decisions."
            ]
        },
        {
            "headline": "States must take labour market reforms ahead: 16th Finance Commission head",
            "summary": "The head of the 16th Finance Commission has urged Indian states to prioritize and implement labour market reforms. This push aims to enhance economic efficiency, attract investment, and improve employment conditions across different regions.",
            "key_points": [
                "16th Finance Commission head advocates for state-led labour market reforms.",
                "Reforms are crucial for economic efficiency and investment.",
                "The initiative seeks to improve employment conditions nationwide."
            ]
        },
        {
            "headline": "'First big step': India-Israel partnership gets lift as Piyush Goyal pushes FTA talks; leaders stress tech and innovation ties",
            "summary": "India and Israel are making significant strides in strengthening their partnership, with Commerce Minister Piyush Goyal actively pursuing Free Trade Agreement (FTA) talks. Both nations are emphasizing cooperation in technology and innovation, signaling a deepening of bilateral economic ties.",
            "key_points": [
                "India and Israel are advancing Free Trade Agreement discussions.",
                "Piyush Goyal is championing stronger economic ties.",
                "Key focus areas include technology and innovation collaboration."
            ]
        }
    ],
    "Technology": [
        {
            "headline": "Tech spectrum tussle: US majors push Wi-Fi use for entire 6GHz band as Jio, Vi seek mobile allocation; Airtel, Qualcomm call for deferment",
            "summary": "A battle is brewing over the 6GHz spectrum band, with US tech giants advocating for its full allocation to Wi-Fi use. In India, major telecom players like Jio and Vi are seeking it for mobile services, while Airtel and Qualcomm have called for a deferment to ensure fair and optimal usage.",
            "key_points": [
                "US tech firms want the entire 6GHz spectrum for Wi-Fi.",
                "Indian telcos Jio and Vi are pushing for mobile service allocation.",
                "Airtel and Qualcomm propose deferment for careful consideration."
            ]
        },
        {
            "headline": "India to be Among Global Chipmaking Leaders by 2032: Technology Minister",
            "summary": "India's Technology Minister has stated the country's ambition to become a global leader in chipmaking by 2032. This ambitious target reflects India's focus on boosting domestic manufacturing and reducing reliance on foreign supply chains for critical semiconductor components.",
            "key_points": [
                "India aims to become a top global chipmaking nation by 2032.",
                "The goal emphasizes domestic manufacturing growth.",
                "It seeks to reduce dependence on international semiconductor supply chains."
            ]
        },
        {
            "headline": "The Future of Russo-Indian AI Cooperation",
            "summary": "The article explores the burgeoning prospects for artificial intelligence (AI) cooperation between Russia and India. This collaboration could lead to joint research, development, and deployment of AI technologies across various sectors, benefiting both nations' technological landscapes.",
            "key_points": [
                "Examines potential AI cooperation between Russia and India.",
                "Could foster joint research and development in AI.",
                "Aims to benefit both countries' technological advancement."
            ]
        }
    ],
    "Entertainment": [
        {
            "headline": "Armaan Jain says the Kapoor family stood together like an army during Sunjay Kapur's death, attack on Saif Ali Khan: 'Bouncing back is in our DNA'",
            "summary": "Armaan Jain reflected on the Kapoor family's resilience, stating they united like an army during difficult times such as Sunjay Kapur's death and the attack on Saif Ali Khan. He emphasized that their ability to bounce back is ingrained in their family's DNA, showcasing their strong familial bonds.",
            "key_points": [
                "Armaan Jain highlights the Kapoor family's unity in crises.",
                "The family showed strong support during Sunjay Kapur's death and Saif Ali Khan's attack.",
                "He attributes their resilience to their \"DNA\" of bouncing back."
            ]
        },
        {
            "headline": "AR Rahman opens up on converting to Sufism; his name was Dileep Kumar: 'I have studied Islam, Hinduism, Christianity. I'm a fan of all religions'",
            "summary": "Renowned musician AR Rahman discussed his spiritual journey, revealing his conversion to Sufism from his birth name Dileep Kumar. He stated that he has deeply studied Islam, Hinduism, and Christianity, expressing admiration for all religions.",
            "key_points": [
                "AR Rahman spoke about his conversion to Sufism from Dileep Kumar.",
                "He has studied multiple religions, including Islam, Hinduism, and Christianity.",
                "Rahman expressed being a \"fan of all religions,\" highlighting his spiritual inclusivity."
            ]
        },
        {
            "headline": "Gal Gadot suffered a 'Massive Clot' during her pregnancy with her fourth child, Ori; ‘Wonder Woman’ actress recalls, ‘All I could think, am I going to die?’",
            "summary": "Actress Gal Gadot revealed a terrifying health scare during her pregnancy with her fourth child, Ori, where she developed a \"massive clot.\" The 'Wonder Woman' star candidly shared her fears, admitting she thought she might die during the ordeal.",
            "key_points": [
                "Gal Gadot experienced a \"massive clot\" during her fourth pregnancy.",
                "She feared for her life during the health crisis.",
                "The actress shared her personal struggle with the serious medical condition."
            ]
        },
        {
            "headline": "'De De Pyaar De 2' crosses R 60 cr, dominates over new releases",
            "summary": "The film 'De De Pyaar De 2' has achieved significant box office success, grossing over Rs 60 crore and outperforming recent new releases. This strong performance indicates its popularity among audiences and solidifies its position as a commercial hit.",
            "key_points": [
                "'De De Pyaar De 2' earned over Rs 60 crore at the box office.",
                "The film has dominated compared to other new releases.",
                "Its success highlights strong audience reception and commercial viability."
            ]
        },
        {
            "headline": "Prince Harry’s bold claim: Diana 'lost her life' due to BBC's 1995 'Panorama' interview with Bashir",
            "summary": "Prince Harry has made a strong assertion, claiming that his mother Princess Diana's life was tragically cut short due to the controversial 1995 BBC 'Panorama' interview conducted by Martin Bashir. This statement reignites debate around the interview's ethics and its long-term impact on Diana.",
            "key_points": [
                "Prince Harry links Princess Diana's death to the 1995 BBC 'Panorama' interview.",
                "He blames the interview with Martin Bashir for her tragic fate.",
                "The claim revives ethical discussions about the infamous broadcast."
            ]
        }
    ],
    "Sports": [
        {
            "headline": "IND vs SA 2nd Test Live: Rahul and Jaiswal aim to steer India’s response on Day 3",
            "summary": "In the ongoing 2nd Test between India and South Africa, KL Rahul and Yashasvi Jaiswal are crucial for India's batting response on Day 3. Their partnership will be vital in stabilizing the innings and building a competitive total against the Proteas.",
            "key_points": [
                "KL Rahul and Yashasvi Jaiswal are key for India's batting on Day 3.",
                "Their partnership is essential for a strong response against South Africa.",
                "India aims to stabilize its innings and set a challenging target."
            ]
        },
        {
            "headline": "Smriti Mandhana's wedding postponed after father hospitalised: What’s the new date?",
            "summary": "Indian cricketer Smriti Mandhana's wedding has been postponed due to her father's hospitalization. Fans and well-wishers are now awaiting an update on the new date for her much-anticipated nuptials.",
            "key_points": [
                "Cricketer Smriti Mandhana's wedding is postponed.",
                "The postponement is due to her father's hospitalization.",
                "A new wedding date is yet to be announced."
            ]
        },
        {
            "headline": "Stunning prediction! 'Shreyas Iyer can captain India to a World Cup win'",
            "summary": "A \"stunning prediction\" has emerged suggesting that cricketer Shreyas Iyer has the potential to lead India to a World Cup victory. This forecast highlights his leadership qualities and performance, sparking discussions among cricket enthusiasts about future captaincy roles.",
            "key_points": [
                "Shreyas Iyer is predicted to lead India to a World Cup win.",
                "The prediction emphasizes his leadership potential.",
                "It sparks debate on future Indian cricket captaincy."
            ]
        },
        {
            "headline": "Diamond League Final: Neeraj Chopra's event preview, time and live telecast in India",
            "summary": "Olympic champion Neeraj Chopra is set to compete in the Diamond League Final, with a detailed preview of his event, broadcast times, and live telecast information available for Indian viewers. All eyes will be on Chopra as he aims for another strong performance on the international stage.",
            "key_points": [
                "Neeraj Chopra is participating in the Diamond League Final.",
                "Indian fans can access event preview, timing, and telecast details.",
                "Chopra is expected to deliver another strong performance."
            ]
        },
        {
            "headline": "Unreal! 40 year-old Cristiano Ronaldo scores jaw-dropping bicycle kick goal – Watch",
            "summary": "At 40 years old, football legend Cristiano Ronaldo continues to defy expectations by scoring an incredible, \"jaw-dropping\" bicycle kick goal. The stunning feat has gone viral, showcasing his enduring skill and athletic prowess despite his age.",
            "key_points": [
                "Cristiano Ronaldo, aged 40, scored an extraordinary bicycle kick goal.",
                "The goal has been widely praised as \"jaw-dropping\" and \"unreal.\"",
                "It demonstrates his continued athletic excellence and skill."
            ]
        }
    ],
    "Science": [],
    "Health": [
        {
            "headline": "Six children admitted for blood transfusion. What they got instead – HIV",
            "summary": "A shocking incident has revealed that six children, admitted for blood transfusions, tragically contracted HIV instead. This grave medical negligence raises serious questions about healthcare safety protocols and patient well-being, demanding immediate investigation and accountability.",
            "key_points": [
                "Six children contracted HIV after receiving blood transfusions.",
                "The incident points to severe medical negligence.",
                "Calls for urgent investigation into healthcare safety and accountability."
            ]
        },
        {
            "headline": "Tooth color and health: What different shades reveal about your well-being",
            "summary": "The color of your teeth can offer surprising insights into your overall health and well-being, with different shades potentially indicating underlying medical conditions. Understanding these visual cues can be an early indicator for seeking professional dental or medical advice.",
            "key_points": [
                "Tooth color can signal aspects of overall health.",
                "Different shades may indicate various medical conditions.",
                "It serves as an early warning sign for potential health issues."
            ]
        },
        {
            "headline": "Urologist reveals 4 drinks quietly harming your kidneys and what to choose instead",
            "summary": "A urologist has identified four common beverages that can subtly damage your kidneys over time, providing crucial advice on healthier alternatives. This information is vital for maintaining renal health and preventing long-term kidney issues.",
            "key_points": [
                "A urologist highlights four drinks detrimental to kidney health.",
                "Recommendations for healthier beverage choices are provided.",
                "The advice aims to prevent long-term kidney damage."
            ]
        },
        {
            "headline": "Why blood pressure falls when you stand up: Understanding the causes, symptoms, risks and management",
            "summary": "This article explains the phenomenon of blood pressure dropping upon standing, detailing its causes, common symptoms, associated risks, and effective management strategies. Understanding this condition, known as orthostatic hypotension, is crucial for those experiencing dizziness or lightheadedness.",
            "key_points": [
                "Explains orthostatic hypotension: blood pressure dropping when standing.",
                "Covers causes, symptoms, and associated health risks.",
                "Provides guidance on managing the condition."
            ]
        },
        {
            "headline": "Heart Health: 3 morning drinks that can reduce Blood Pressure",
            "summary": "Discover three beneficial morning drinks that can contribute to lowering blood pressure and improving overall heart health. Incorporating these simple beverages into your daily routine could be an effective, natural way to support cardiovascular well-being.",
            "key_points": [
                "Three morning drinks are identified for reducing blood pressure.",
                "These drinks contribute to better heart health.",
                "They offer a natural approach to cardiovascular well-being."
            ]
        },
        {
            "headline": "Eye implant, high-tech glasses could help restore lost vision",
            "summary": "Advanced medical technologies, specifically innovative eye implants and high-tech glasses, are showing significant potential in restoring lost vision. These breakthroughs offer new hope and improved quality of life for individuals suffering from severe visual impairments.",
            "key_points": [
                "New eye implants and high-tech glasses can restore vision.",
                "These advancements target individuals with lost vision.",
                "They represent a major medical breakthrough in ophthalmology."
            ]
        }
    ]
}