{
    "World": [
        {
            "headline": "US Supreme Court strikes down Trump tariffs",
            "summary": "The US Supreme Court has delivered a major blow to President Donald Trump's trade policy. In a significant 6-3 decision, the court declared his global tariffs illegal, citing Trump's lack of authority under the International Emergency Economic Powers Act. This ruling could lead to billions in tariff refunds and impacts future executive actions on trade.",
            "key_points": [
                "US Supreme Court struck down Trump's global tariffs as illegal.",
                "The decision was 6-3, with Chief Justice Roberts citing a lack of authority.",
                "Ruling could lead to billions in tariff refunds and impacts future trade actions."
            ]
        },
        {
            "headline": "'Effective immediately': After court setback, Trump imposes 10% global tariff on all countries",
            "summary": "Following a significant setback from the US Supreme Court's ruling on his trade policies, former President Trump has announced the immediate imposition of a new 10% global tariff. This move comes as a direct response to the court's decision and signifies a continued aggressive stance on international trade.",
            "key_points": [
                "Trump imposes a new 10% global tariff 'effective immediately'.",
                "The action follows a US Supreme Court ruling against his previous tariffs.",
                "Signifies a continued aggressive stance on international trade."
            ]
        },
        {
            "headline": "Zomato delivery boy killed after speeding car rams bike in Delhi’s Subhash Nagar; driver held",
            "summary": "A Zomato delivery boy tragically lost his life in Subhash Nagar, West Delhi, after being hit by a speeding car around 3 am. Police have taken the accused driver into custody and seized the vehicle. Investigations are ongoing to determine the precise sequence of events leading to the fatal accident.",
            "key_points": [
                "Zomato delivery boy killed in a hit-and-run in Delhi's Subhash Nagar.",
                "Accused driver was apprehended by police and vehicle seized.",
                "Investigations are ongoing into the fatal accident."
            ]
        },
        {
            "headline": "'Shocked': Only daughter of ex-Isro employee who killed wife, refuses to fly from US for funeral",
            "summary": "A shocking incident unfolded in Bengaluru where a 70-year-old former ISRO employee killed his wife, fearing no one would care for her after his demise. The victim's daughter, residing in New Jersey, USA, refused to travel for legal procedures and the funeral. An extended family member completed the formalities and performed the cremation.",
            "key_points": [
                "Ex-ISRO employee in Bengaluru killed his wife out of fear for her future care.",
                "Daughter residing in the US refused to attend the funeral or legal procedures.",
                "Extended family members handled the cremation and formalities."
            ]
        },
        {
            "headline": "Trade deal on track, relations with India 'fantastic': Trump",
            "summary": "Former President Trump expressed strong optimism regarding an imminent trade deal with India, describing relations between the two nations as 'fantastic'. This statement signals ongoing positive diplomatic and economic engagements between the US and India.",
            "key_points": [
                "Trump stated that a US-India trade deal is on track.",
                "He described relations with India as 'fantastic'.",
                "Highlights positive diplomatic and economic engagements."
            ]
        },
        {
            "headline": "US envoy Sergio Gor: India committed to not buying Russian oil",
            "summary": "US Ambassador Sergio Gor stated that India has committed to not buying Russian oil, aligning with President Trump's efforts to end the Russia-Ukraine war. Gor also revealed active negotiations for India to procure Venezuelan oil, with an interim trade deal imminent. India's foreign ministry emphasized its energy policy is driven by national interest.",
            "key_points": [
                "US envoy claims India committed to stop buying Russian oil.",
                "Negotiations are underway for India to procure Venezuelan oil.",
                "India's foreign ministry asserts national interest drives its energy policy."
            ]
        },
        {
            "headline": "Israel launches strike on Lebanon; 10 dead including senior Hezbollah leader —video shows aftermath",
            "summary": "Israeli air strikes in Lebanon's Bekaa Valley killed at least 12 and wounded 50, reportedly targeting Hezbollah command centers. A senior Hezbollah leader was among the dead in these strikes. The attacks, among the deadliest recently, risk further escalating tensions and straining a fragile US-brokered ceasefire.",
            "key_points": [
                "Israeli air strikes in Lebanon's Bekaa Valley resulted in at least 12 dead and 50 wounded.",
                "A senior Hezbollah leader was reportedly among the fatalities.",
                "The strikes targeted Hezbollah command centers and threaten a fragile ceasefire."
            ]
        },
        {
            "headline": "US-sanctioned Iran-linked oil tanker spent 8 days in Pak maritime boundary: FIR",
            "summary": "An Iran-linked oil tanker, under US sanctions and later seized by the Indian Coast Guard, allegedly spent eight days within Pakistan's maritime boundaries with its tracking systems disabled. The vessel, along with two others, was apprehended for illegal oil smuggling and forgery. Investigations revealed ship-to-ship transfers of fuel and bitumen without informing authorities.",
            "key_points": [
                "US-sanctioned Iran-linked oil tanker found in Pakistan's maritime boundary with tracking off.",
                "Seized by Indian Coast Guard for alleged illegal oil smuggling and forgery.",
                "Investigations uncovered unauthorized ship-to-ship fuel transfers."
            ]
        },
        {
            "headline": "Sierra Nevada avalanche leaves 9 skiers missing near Lake Tahoe: After dangerous backcountry snow slide incident",
            "summary": "A dangerous avalanche in the Sierra Nevada mountains near Lake Tahoe has resulted in nine skiers going missing. Emergency services are currently conducting search and rescue operations following the significant backcountry snow slide incident. The challenging conditions are hindering efforts to locate the missing individuals.",
            "key_points": [
                "Nine skiers are missing after an avalanche in the Sierra Nevada near Lake Tahoe.",
                "The incident involved a dangerous backcountry snow slide.",
                "Search and rescue operations are underway in challenging conditions."
            ]
        },
        {
            "headline": "Trump briefed on military strike options against Iran as U.S. forces prepared and tensions with Tehran escalate amid nuclear talks",
            "summary": "Former President Trump has received briefings on potential military strike options against Iran, as US forces maintain a state of preparedness. Tensions with Tehran are escalating, even amidst ongoing nuclear talks. This highlights a complex and volatile geopolitical situation in the region.",
            "key_points": [
                "Trump briefed on military strike options against Iran.",
                "US forces are prepared amidst escalating tensions with Tehran.",
                "The situation is volatile despite ongoing nuclear talks."
            ]
        },
        {
            "headline": "India has emerged as 'shining beacon' of Global South: Report",
            "summary": "A recent report highlights India's growing influence and leadership, positioning it as a 'shining beacon' for the Global South. This recognition underscores India's increasing role in international affairs and its importance for developing nations worldwide.",
            "key_points": [
                "Report identifies India as a 'shining beacon' for the Global South.",
                "Acknowledges India's growing influence and leadership.",
                "Highlights India's increasing role in international affairs."
            ]
        },
        {
            "headline": "AI race is democratic vs autocratic, says OpenAI",
            "summary": "OpenAI has characterized the global competition in artificial intelligence as a fundamental clash between democratic and autocratic systems. This perspective emphasizes the significant geopolitical implications and ideological struggle surrounding the future development and control of AI technologies.",
            "key_points": [
                "OpenAI views the global AI race as a conflict between democratic and autocratic systems.",
                "This highlights the geopolitical implications of AI development.",
                "Underscores the ideological struggle over AI control."
            ]
        },
        {
            "headline": "India joins US initiative to counter China as both 'align in def of liberty'",
            "summary": "India has formally joined a US initiative aimed at countering China, with both nations declaring their alignment in the 'defense of liberty'. This strategic collaboration signifies strengthening ties and a coordinated approach to addressing regional and global challenges posed by China.",
            "key_points": [
                "India joins a US initiative specifically designed to counter China.",
                "Both nations state their alignment in the 'defense of liberty'.",
                "Signifies strengthened strategic ties and a coordinated approach."
            ]
        },
        {
            "headline": "SC deploys judicial officers in Bengal for SIR hearings",
            "summary": "The Supreme Court has deployed judicial officers to West Bengal to oversee hearings related to Special Investigation Reports (SIRs). This intervention aims to ensure fair and timely proceedings in critical cases, addressing concerns about judicial efficiency and transparency in the state.",
            "key_points": [
                "Supreme Court deployed judicial officers to West Bengal.",
                "Purpose is to oversee Special Investigation Report (SIR) hearings.",
                "Aims to ensure fair and timely proceedings in critical cases."
            ]
        },
        {
            "headline": "MHA forms 2nd empowered committee for Bengal to fast-track requests under CAA",
            "summary": "The Ministry of Home Affairs (MHA) has established a second empowered committee specifically for West Bengal, tasked with expediting requests made under the Citizenship Amendment Act (CAA). This initiative aims to streamline the processing of applications and address the numerous concerns related to the controversial law within the state.",
            "key_points": [
                "MHA formed a second empowered committee for West Bengal.",
                "Its purpose is to fast-track requests under the CAA.",
                "Aims to streamline application processing related to the controversial law."
            ]
        },
        {
            "headline": "Indian trucker held in US for fatal crash",
            "summary": "An Indian trucker has been arrested in the United States following his alleged involvement in a fatal road accident. The incident is currently under investigation by local authorities, with details surrounding the crash and potential charges still emerging.",
            "key_points": [
                "An Indian trucker was arrested in the US.",
                "Held in connection with a fatal road crash.",
                "The incident is under investigation by authorities."
            ]
        },
        {
            "headline": "Indian teacher Rouble Nagi, who painted educational murals across slums, wins Global Teacher Prize",
            "summary": "Indian teacher Rouble Nagi has been awarded the prestigious Global Teacher Prize for her groundbreaking work in painting educational murals across various slums. Her innovative approach to using art for education has garnered international acclaim, highlighting her significant impact on underprivileged communities.",
            "key_points": [
                "Indian teacher Rouble Nagi won the Global Teacher Prize.",
                "Awarded for painting educational murals in slums.",
                "Recognized for her innovative use of art for education in underprivileged areas."
            ]
        },
        {
            "headline": "CCTV shocker: Told not to smoke while refuelling, man sparks inferno at petrol pump",
            "summary": "Shocking CCTV footage captured a man igniting a massive inferno at a petrol pump after he was explicitly warned not to smoke while refuelling. The incident highlights an extreme disregard for safety protocols, resulting in a dangerous and preventable blaze.",
            "key_points": [
                "Man sparks inferno at a petrol pump by smoking while refuelling.",
                "Incident was captured on CCTV, showing disregard for safety warnings.",
                "Resulted in a dangerous and preventable fire."
            ]
        },
        {
            "headline": "Missing teen's head found hanging from tree in Varanasi forest",
            "summary": "The head of a missing teenager has been discovered hanging from a tree in a forest near Varanasi, prompting a grim police investigation into a suspected murder. This disturbing find has intensified search efforts for further remains and clues surrounding the gruesome crime.",
            "key_points": [
                "Head of a missing teenager found hanging from a tree in Varanasi forest.",
                "Police have launched a murder investigation.",
                "Search efforts are intensified for further remains and clues."
            ]
        },
        {
            "headline": "'My girl lay soaked in blood. No one helped: 6-year-old dies in hit-and-run in Delhi; grandmother recounts horror",
            "summary": "A 6-year-old girl tragically died in a hit-and-run incident in Delhi, with her grandmother recounting the horror of witnessing her lay in blood without anyone stopping to help. The family, grappling with their immense loss, is now preparing to donate the child's eyes. This incident highlights a distressing lack of public intervention.",
            "key_points": [
                "6-year-old girl died in a hit-and-run in Delhi.",
                "Grandmother claims no one stopped to help the injured child.",
                "The family plans to donate the girl's eyes, highlighting public apathy."
            ]
        },
        {
            "headline": "Massive fire at Hyderabad coaching centre triggers chaos; 80+ students rescued",
            "summary": "A massive fire erupted at a coaching center in Hyderabad, triggering widespread chaos and an urgent rescue operation. Over 80 students were successfully evacuated from the building as emergency services worked to control the blaze. The incident highlights safety concerns in educational facilities.",
            "key_points": [
                "Massive fire broke out at a Hyderabad coaching center.",
                "Over 80 students were successfully rescued amid chaos.",
                "Emergency services worked to control the blaze, raising safety concerns."
            ]
        },
        {
            "headline": "Ukrainian Military Lost 1.5M Since 2022",
            "summary": "Reports indicate that the Ukrainian military has suffered approximately 1.5 million casualties since the conflict began in 2022. This staggering figure highlights the immense human cost and devastating impact of the ongoing war.",
            "key_points": [
                "Ukrainian military reportedly lost 1.5 million personnel since 2022.",
                "The figure highlights the immense human cost of the ongoing conflict."
            ]
        },
        {
            "headline": "Russia–US Tunnel Could Reshape Global Trade, Sidelining Hawkish EU: Experts",
            "summary": "Experts are speculating that a hypothetical Russia-US tunnel could fundamentally alter global trade routes, potentially diminishing the European Union's influence, particularly its more hawkish factions. Such an ambitious infrastructure project, if realized, would carry profound geopolitical and economic consequences on a global scale.",
            "key_points": [
                "A hypothetical Russia-US tunnel could reshape global trade routes.",
                "Experts suggest it could sideline the EU's influence, especially its hawkish elements.",
                "The project would have profound geopolitical and economic consequences."
            ]
        },
        {
            "headline": "Zaporozhye Nuclear Plant Now Only Relies on One Last Power Line: IAEA",
            "summary": "The International Atomic Energy Agency (IAEA) has reported that the Zaporozhye Nuclear Power Plant is now dependent on only one remaining power line for external electricity. This precarious situation raises serious safety concerns regarding the plant's operational stability and the risk of a nuclear incident amidst the ongoing conflict.",
            "key_points": [
                "Zaporozhye Nuclear Plant relies on only one remaining power line.",
                "Reported by the International Atomic Energy Agency (IAEA).",
                "Raises serious safety concerns for operational stability amid conflict."
            ]
        },
        {
            "headline": "Iran Has 15 Days Maximum to Make Deal With US: Trump",
            "summary": "Former President Trump has issued an ultimatum, stating that Iran has a maximum of 15 days to reach a deal with the United States. This declaration underscores the urgency and high stakes involved in ongoing diplomatic efforts to address nuclear and regional tensions with Iran.",
            "key_points": [
                "Trump issued an ultimatum for Iran to make a deal with the US within 15 days.",
                "Highlights the urgency in diplomatic efforts.",
                "Aims to address nuclear and regional tensions with Iran."
            ]
        },
        {
            "headline": "Syria Interested in Russia's Military Presence in Region: Russian FM",
            "summary": "The Russian Foreign Minister has stated that Syria is interested in maintaining and potentially expanding Russia's military presence in the region. This declaration indicates continued geopolitical alignment and strategic cooperation between the two nations, impacting regional power dynamics.",
            "key_points": [
                "Syria expresses interest in Russia's military presence in the region.",
                "Statement made by the Russian Foreign Minister.",
                "Indicates continued geopolitical alignment and strategic cooperation."
            ]
        },
        {
            "headline": "Iran Eyes Russian Energy Giants for New Oil & Gas Projects: Iranian Oil Minister",
            "summary": "The Iranian Oil Minister has announced that Iran is actively seeking to partner with Russian energy giants for new oil and gas projects. This move signifies strengthening energy ties between the two countries, particularly amidst ongoing international sanctions faced by both nations.",
            "key_points": [
                "Iran seeks partnerships with Russian energy giants.",
                "Aims for new oil and gas projects.",
                "Strengthens energy ties between Iran and Russia amid sanctions."
            ]
        },
        {
            "headline": "Ukraine Talks in Geneva Were Difficult, But Businesslike: Russian Delegation Head Medinsky",
            "summary": "The head of the Russian delegation, Medinsky, has described the recent Ukraine talks in Geneva as difficult but ultimately businesslike. This assessment suggests a pragmatic approach despite underlying tensions, indicating that efforts towards a potential resolution are continuing through dialogue.",
            "key_points": [
                "Ukraine talks in Geneva described as difficult but businesslike by Russian delegation head.",
                "Suggests a pragmatic approach despite underlying tensions.",
                "Indicates ongoing efforts towards a resolution through dialogue."
            ]
        },
        {
            "headline": "India's Defence Budget Rises by 15%: What Does it Mean for Indian Military?",
            "summary": "India has announced a significant 15% increase in its defense budget, a move that is expected to bolster the modernization and capabilities of the Indian military. This substantial allocation reflects the nation's strategic priorities and growing national security concerns.",
            "key_points": [
                "India's defense budget increased by 15%.",
                "Aims to bolster military modernization and capabilities.",
                "Reflects strategic priorities and national security concerns."
            ]
        },
        {
            "headline": "Russia Stays Vital to India’s Oil Supply: Oil Analyst Rejects US Claim",
            "summary": "An oil analyst has publicly rejected US claims regarding India's commitment to stop buying Russian oil, asserting that Russia remains a vital supplier for India. This perspective highlights the complex realities of India's energy security and its strategic relationships amidst global geopolitical pressures.",
            "key_points": [
                "Oil analyst rejects US claim about India's commitment to stop Russian oil imports.",
                "States Russia remains a vital oil supplier for India.",
                "Highlights complexities of India's energy security and strategic relationships."
            ]
        },
        {
            "headline": "At Least 20 Canadian Mercenaries Killed in Ukraine Since 2022: Reports",
            "summary": "Reports indicate that at least 20 Canadian mercenaries have been killed in Ukraine since the conflict began in 2022. This figure sheds light on the involvement of foreign combatants in the ongoing war and the human cost beyond official military forces.",
            "key_points": [
                "Reports claim at least 20 Canadian mercenaries killed in Ukraine.",
                "Deaths occurred since the conflict began in 2022.",
                "Highlights foreign combatant involvement in the war."
            ]
        },
        {
            "headline": "Russia Launches Precision Strikes on Ukrainian Military-Energy Sites",
            "summary": "Russia has initiated precision strikes against Ukrainian military and energy sites, escalating its campaign against critical infrastructure. These targeted attacks aim to disrupt military capabilities and energy supply chains across Ukraine, impacting the ongoing conflict.",
            "key_points": [
                "Russia launched precision strikes on Ukrainian military and energy sites.",
                "Escalates campaign against critical infrastructure.",
                "Aims to disrupt military capabilities and energy supply chains."
            ]
        },
        {
            "headline": "Russian Army Liberates Minkovka Settlement in Donetsk People's Republic: MoD",
            "summary": "Russia's Ministry of Defense has announced that the Russian army has 'liberated' the Minkovka settlement in the Donetsk People's Republic. This reported territorial gain is part of ongoing military operations in the region and signifies a tactical advance.",
            "key_points": [
                "Russian army reportedly 'liberated' Minkovka settlement in Donetsk People's Republic.",
                "Announcement made by Russia's Ministry of Defense.",
                "Part of ongoing military operations and signifies a tactical advance."
            ]
        },
        {
            "headline": "Russian Army Liberates Tsvetkovoye Settlement in Zaporozhye Region: MoD",
            "summary": "Russia's Ministry of Defense has announced that its army has 'liberated' the Tsvetkovoye settlement in the Zaporozhye region. This declared territorial gain is part of the continuing military operations in the area, indicating further advancements in the conflict zone.",
            "key_points": [
                "Russian army reportedly 'liberated' Tsvetkovoye settlement in Zaporozhye region.",
                "Announced by Russia's Ministry of Defense.",
                "Part of continuing military operations, indicating further advancements."
            ]
        },
        {
            "headline": "Russian Army Liberates Glushkovka in Kharkov Region: General Staff Chief",
            "summary": "The Chief of the General Staff has announced that the Russian army has 'liberated' Glushkovka in the Kharkov region. This reported territorial gain is part of the ongoing military operations in Ukraine, contributing to the broader strategic objectives.",
            "key_points": [
                "Russian army reportedly 'liberated' Glushkovka in Kharkov region.",
                "Announcement made by the Chief of the General Staff.",
                "Part of ongoing military operations in Ukraine."
            ]
        }
    ],
    "Business": [
        {
            "headline": "Walmart fourth-quarter earnings beat expectations but full-year guidance falls short of forecasts amid cautious consumer spending outlook and economic uncertainty",
            "summary": "Walmart reported stronger-than-expected earnings for its fourth quarter, surpassing market predictions. However, the retail giant's full-year guidance fell short of forecasts, reflecting a cautious outlook on consumer spending and broader economic uncertainties that are influencing future projections.",
            "key_points": [
                "Walmart's Q4 earnings exceeded expectations.",
                "Full-year guidance fell short of forecasts.",
                "Attributed to cautious consumer spending outlook and economic uncertainty."
            ]
        },
        {
            "headline": "From ₹9,000 salary to CEO: How Dadasaheb Bhagat built India’s own Canva-like platform",
            "summary": "Dadasaheb Bhagat, who started with a modest ₹9,000 salary, successfully founded India's own Canva-like platform and eventually became its CEO. His remarkable journey exemplifies entrepreneurial success and the development of indigenous tech solutions within India.",
            "key_points": [
                "Dadasaheb Bhagat, starting with a low salary, became CEO of his own venture.",
                "He built an indigenous 'Canva-like' platform in India.",
                "His story highlights entrepreneurial success and local tech development."
            ]
        },
        {
            "headline": "Govt announces measures to boost exports",
            "summary": "The government has announced a series of new measures specifically aimed at boosting the nation's exports. These initiatives are designed to enhance international trade competitiveness and stimulate overall economic growth by facilitating easier and more extensive global market access.",
            "key_points": [
                "Government announced new measures to boost national exports.",
                "Initiatives aim to enhance international trade competitiveness.",
                "Designed to stimulate economic growth through global market access."
            ]
        },
        {
            "headline": "Trade deals shift sentiment, boost growth prospects: RBI",
            "summary": "The Reserve Bank of India (RBI) has observed that new trade deals are positively impacting economic sentiment and boosting growth prospects across the country. This suggests that international agreements are playing a crucial role in shaping India's economic trajectory and fostering a more optimistic business environment.",
            "key_points": [
                "RBI notes new trade deals positively affect economic sentiment.",
                "These deals are boosting growth prospects.",
                "International agreements are crucial for India's economic trajectory."
            ]
        },
        {
            "headline": "Novartis to exit listed Indian arm in Rs 1,446cr deal",
            "summary": "Pharmaceutical giant Novartis is set to exit its listed Indian arm through a significant deal valued at Rs 1,446 crore. This strategic transaction marks a major shift for Novartis's operations in India and is expected to impact the country's pharmaceutical market landscape.",
            "key_points": [
                "Novartis is exiting its listed Indian arm in a Rs 1,446 crore deal.",
                "The move signifies a major strategic shift for the pharmaceutical giant.",
                "Expected to impact the Indian pharmaceutical market."
            ]
        },
        {
            "headline": "Industry hopes govt can rework US trade pact",
            "summary": "Indian industry stakeholders are expressing strong hopes that the government can successfully renegotiate and rework the existing trade pact with the United States. A revised agreement is anticipated to improve trade conditions, reduce barriers, and foster stronger bilateral economic ties beneficial to both nations.",
            "key_points": [
                "Indian industry hopes the government can rework the US trade pact.",
                "Aims to improve trade conditions and reduce barriers.",
                "Seeks stronger bilateral economic ties between India and the US."
            ]
        },
        {
            "headline": "Embraer seeks 200 jet orders to make in India",
            "summary": "Brazilian aerospace company Embraer is actively seeking orders for 200 jets, with a firm commitment to manufacture them in India. This initiative could significantly boost India's defense and aerospace manufacturing capabilities, contributing to local employment and technological advancement.",
            "key_points": [
                "Embraer is seeking orders for 200 jets.",
                "Committed to manufacturing these jets in India.",
                "Aims to boost India's defense and aerospace manufacturing capabilities."
            ]
        },
        {
            "headline": "India Launches $2.98 Bln Export Promotion Mission to Power MSMEs, Boost Global Trade",
            "summary": "India has initiated a substantial $2.98 billion export promotion mission with the primary aim of empowering Micro, Small, and Medium Enterprises (MSMEs) and significantly boosting global trade. This strategic endeavor seeks to enhance the competitiveness of Indian businesses on the international stage, fostering economic growth and job creation.",
            "key_points": [
                "India launches a $2.98 billion export promotion mission.",
                "Aims to empower MSMEs and boost global trade.",
                "Seeks to enhance competitiveness of Indian businesses internationally."
            ]
        },
        {
            "headline": "Brazil’s Embraer Joins Mahindra for New India-Based MRO Powerhouse",
            "summary": "Brazil's Embraer has officially partnered with Mahindra to establish a new Maintenance, Repair, and Overhaul (MRO) powerhouse to be based in India. This collaboration is set to significantly enhance India's aerospace capabilities, contribute to the country's aviation sector, and create specialized job opportunities.",
            "key_points": [
                "Embraer partners with Mahindra to establish an MRO powerhouse in India.",
                "Aims to enhance India's aerospace capabilities.",
                "Will contribute significantly to the country's aviation sector and create jobs."
            ]
        },
        {
            "headline": "India Set to Begin Permanent Magnet Manufacturing in 2026: India's Mining Minister",
            "summary": "India's Mining Minister has announced that the country is poised to commence permanent magnet manufacturing in 2026. This strategic move is crucial for reducing India's import dependence on critical materials and bolstering its self-reliance in key technological components essential for various industries.",
            "key_points": [
                "India to begin permanent magnet manufacturing in 2026.",
                "Announcement made by India's Mining Minister.",
                "Crucial for reducing import dependence and boosting self-reliance in tech components."
            ]
        }
    ],
    "Technology": [
        {
            "headline": "Meet Asha Sharma: Indian-origin executive named CEO of Microsoft Gaming",
            "summary": "Asha Sharma, an Indian-origin executive, has been named the new CEO of Microsoft Gaming. Her appointment signifies a major leadership change within Microsoft's gaming division and highlights her significant career achievements in the technology sector.",
            "key_points": [
                "Asha Sharma, of Indian origin, appointed CEO of Microsoft Gaming.",
                "Major leadership change within Microsoft's gaming division.",
                "Highlights her significant achievements in the technology sector."
            ]
        },
        {
            "headline": "After layoffs and shutting down studios, Meta is making more changes to the 'team' Mark Zuckerberg changed company's name for",
            "summary": "Following a period of significant layoffs and studio closures, Meta is implementing further internal changes to the teams Mark Zuckerberg prioritized during the company's rebranding. These adjustments indicate a continued restructuring effort as the company navigates its strategic direction and workforce optimization.",
            "key_points": [
                "Meta is implementing more internal team changes.",
                "Follows significant layoffs and studio closures.",
                "Impacts teams prioritized during the company's rebranding under Mark Zuckerberg."
            ]
        },
        {
            "headline": "YouTube's first video was honoured in a London museum exhibit on digital history",
            "summary": "YouTube's inaugural video has been recognized and honored in a London museum exhibit dedicated to digital history. This acknowledgement highlights the pivotal role of the video in the evolution of online content, digital media, and the platform's enduring cultural impact.",
            "key_points": [
                "YouTube's first video was honored in a London museum exhibit.",
                "Recognized for its place in digital history.",
                "Highlights its pivotal role in online content evolution."
            ]
        },
        {
            "headline": "Despite differences, AI summit has set stage for cooperation: Indian officials",
            "summary": "Indian officials have stated that, despite existing differences, a recent AI summit successfully laid the groundwork for future international cooperation on artificial intelligence. This suggests a global recognition of the imperative for collaborative approaches in AI development, governance, and ethical considerations.",
            "key_points": [
                "AI summit established groundwork for cooperation despite existing differences.",
                "Indian officials confirm positive outcomes.",
                "Highlights global recognition for collaborative AI development and governance."
            ]
        },
        {
            "headline": "India bleeding talent to US: Mistral CEO",
            "summary": "The CEO of Mistral has voiced concerns about India experiencing a significant 'brain drain' of skilled talent to the United States. This ongoing migration poses a considerable challenge to India's domestic growth, innovation capabilities, and the development of its burgeoning tech sector.",
            "key_points": [
                "Mistral CEO highlights India's talent migration to the US.",
                "Concerns raised about the 'brain drain' effect.",
                "Poses a challenge to India's domestic growth and tech innovation."
            ]
        },
        {
            "headline": "'AI language models hitting publishers'",
            "summary": "There are growing concerns that the widespread use of AI language models is negatively impacting publishers, potentially affecting their content creation processes, revenue streams, and the broader media landscape. This highlights significant challenges related to intellectual property, fair compensation, and the future of journalism in the age of generative AI.",
            "key_points": [
                "AI language models are negatively impacting publishers.",
                "Concerns revolve around content creation, revenue, and the media landscape.",
                "Raises challenges for intellectual property and compensation in the AI era."
            ]
        },
        {
            "headline": "India Aims For Ethical AI Future as PM Modi Reveals MANAV Vision",
            "summary": "Prime Minister Narendra Modi has unveiled the 'MANAV Vision,' outlining India's comprehensive commitment to developing an ethical future for Artificial Intelligence. This initiative emphasizes responsible AI growth, actively addressing critical concerns about bias, privacy, and its broader societal impact.",
            "key_points": [
                "PM Modi reveals 'MANAV Vision' for ethical AI in India.",
                "Highlights India's commitment to responsible AI future.",
                "Addresses concerns like bias, privacy, and societal impact."
            ]
        },
        {
            "headline": "India Sets Deadline for Indigenous Fighter Jet Engine: Is 5-7 Year Target Achievable?",
            "summary": "India has set an ambitious deadline for developing an indigenous fighter jet engine, with a target timeframe of 5-7 years for completion. This crucial project aims to achieve self-reliance in advanced defense technology, though questions remain regarding the technical and logistical feasibility of meeting such a tight deadline.",
            "key_points": [
                "India sets 5-7 year deadline for developing an indigenous fighter jet engine.",
                "Aims for self-reliance in advanced defense technology.",
                "Feasibility of the ambitious timeline remains a key question."
            ]
        },
        {
            "headline": "More Than a Plane: SJ-100 is India's Fast Track to Aviation Self-Reliance",
            "summary": "The SJ-100 aircraft program is being highlighted as India's crucial pathway to achieving comprehensive self-reliance in the aviation sector. This ambitious initiative extends beyond mere aircraft manufacturing, aiming to foster a robust indigenous aerospace ecosystem, encompassing design, development, and maintenance capabilities.",
            "key_points": [
                "SJ-100 program is touted as India's fast track to aviation self-reliance.",
                "Aims to develop a robust indigenous aerospace ecosystem.",
                "Focus is beyond just manufacturing, including design and development."
            ]
        }
    ],
    "Entertainment": [
        {
            "headline": "'Assi' box office collection Day 1: Taapsee Pannu starrer off to a slow start; opens to Rs 1 crore",
            "summary": "Taapsee Pannu's latest film, 'Assi', has had a slow start at the box office, collecting only Rs 1 crore on its opening day. This initial figure suggests the film is facing challenges in attracting audiences, indicating a lukewarm reception.",
            "key_points": [
                "Taapsee Pannu's 'Assi' had a slow box office start.",
                "Collected only Rs 1 crore on Day 1.",
                "Indicates a lukewarm audience reception."
            ]
        },
        {
            "headline": "New ‘Venom’ animated movie in the works with ‘Final Destination’ filmmakers: What we know so far",
            "summary": "A new 'Venom' animated movie is reportedly in the early stages of development, with the filmmakers behind the 'Final Destination' series attached to the project. Details remain scarce, but the involvement of known creators suggests a unique direction for the popular anti-hero character.",
            "key_points": [
                "New 'Venom' animated movie is in development.",
                "Filmmakers from 'Final Destination' are involved.",
                "Details are scarce, but suggests a unique direction for the character."
            ]
        },
        {
            "headline": "'O' Romeo' box office collection Day 8: Shahid Kapoor starrer begins second weekend by crossing Rs 75 crore worldwide",
            "summary": "Shahid Kapoor's latest film, 'O' Romeo', has successfully crossed the Rs 75 crore mark worldwide by the start of its second weekend. This milestone indicates strong box office performance and positive reception from global audiences for the romantic drama.",
            "key_points": [
                "Shahid Kapoor's 'O' Romeo' crossed Rs 75 crore worldwide.",
                "Achieved the milestone by the start of its second weekend.",
                "Indicates strong box office performance and positive global reception."
            ]
        },
        {
            "headline": "Businessman who filed case against Rajpal Yadav breaks silence, says he cried in front of the actor to return his money, it was a loan",
            "summary": "A businessman who filed a legal case against actor Rajpal Yadav has broken his silence, alleging he had to plead and even cry in front of the actor to return a significant loan. This public statement sheds new light on the long-standing financial dispute between the two individuals.",
            "key_points": [
                "Businessman claims he had to beg Rajpal Yadav for a loan return.",
                "Alleges he 'cried in front of the actor' for his money.",
                "Sheds new light on the long-standing financial dispute."
            ]
        },
        {
            "headline": "Rajpal Yadav and wife Radha Yadav express gratitude amid industry support in cheque bounce case",
            "summary": "Actor Rajpal Yadav and his wife Radha Yadav have publicly expressed their gratitude for the outpouring of support received from the film industry amidst their ongoing cheque bounce case. This solidarity highlights the camaraderie within the industry during their legal challenges.",
            "key_points": [
                "Rajpal Yadav and wife Radha Yadav thank film industry for support.",
                "Support received amid their ongoing cheque bounce case.",
                "Highlights industry camaraderie during legal challenges."
            ]
        }
    ],
    "Sports": [
        {
            "headline": "Is Serena Williams making a comeback? Latest on-court video excites tennis fans worldwide",
            "summary": "A recent on-court video featuring Serena Williams has sparked excitement among tennis fans worldwide, fueling speculation about a potential comeback. The footage shows the legendary player in action, leading many to wonder if she plans to return to professional tennis.",
            "key_points": [
                "New on-court video of Serena Williams sparks comeback speculation.",
                "Excites tennis fans globally.",
                "Shows the legendary player in action."
            ]
        },
        {
            "headline": "Shaheen, Babar dropped after India defeat? Pak coach's verdict on 'paradigm shift'",
            "summary": "Pakistan's head coach Mike Hesson rejected claims that dropping Shaheen Afridi and demoting Babar Azam against Namibia were direct reactions to their loss against India. Hesson clarified these were tactical changes aimed at optimizing player roles and improving powerplay performance, specifically addressing concerns about Babar's strike rate.",
            "key_points": [
                "Pak coach denies Shaheen/Babar dropped due to India defeat.",
                "States changes were tactical to optimize roles and improve powerplay.",
                "Babar Azam's strike rate was a specific concern."
            ]
        },
        {
            "headline": "T20 World Cup: Close calls, big statements: Associates make noise, will ICC listen?",
            "summary": "Associate teams made a significant impact at the T20 World Cup, playing fearless cricket and pushing top sides to their limits in multiple thrillers. Despite costly dropped catches and a lack of big-match experience, their strong performances send a clear message to the ICC: give us more opportunities and results will follow.",
            "key_points": [
                "Associate teams made a significant impact at the T20 World Cup.",
                "Showcased fearless cricket, pushing top sides to the edge.",
                "Called for more ICC opportunities and exposure despite crucial dropped catches."
            ]
        },
        {
            "headline": "Asia Cup 2025: Indian-origin Jatinder Singh to led Oman",
            "summary": "Indian-origin cricketer Jatinder Singh has been named to lead the Oman team in the upcoming Asia Cup 2025. This appointment marks a significant leadership role for Singh on an international stage, highlighting his continued contribution to Oman cricket.",
            "key_points": [
                "Indian-origin Jatinder Singh appointed captain of Oman for Asia Cup 2025.",
                "Marks a significant leadership role on an international stage."
            ]
        },
        {
            "headline": "FIDE WC in India: PM Modi says 'Chess is gaining popularity among our youth'",
            "summary": "Prime Minister Narendra Modi has highlighted the growing popularity of chess among Indian youth, particularly in the context of the FIDE World Cup being hosted in India. This endorsement underscores the sport's increasing appeal and its potential positive impact on younger generations across the nation.",
            "key_points": [
                "PM Modi notes increasing popularity of chess among Indian youth.",
                "Statement made in context of FIDE World Cup in India.",
                "Underscores the sport's growing appeal and positive impact on younger generations."
            ]
        }
    ],
    "Science": [
        {
            "headline": "Scientists finally reveal what’s inside Charles Darwin’s 200-year-old jars",
            "summary": "Scientists have finally unveiled the contents of Charles Darwin's 200-year-old jars, providing a rare glimpse into the specimens he collected during his pioneering research. This discovery offers new insights into Darwin's methods and the biodiversity he studied, deepening understanding of his foundational work in evolutionary biology.",
            "key_points": [
                "Contents of Charles Darwin's 200-year-old jars finally revealed.",
                "Provides insights into Darwin's specimens and research methods.",
                "Deepens understanding of his work in evolutionary biology."
            ]
        },
        {
            "headline": "Kuno National Park: Cheetah population grows to 38 as Gamini gives birth to 3 cubs, boosting Project Cheetah",
            "summary": "Kuno National Park's cheetah population has increased to 38 following the birth of three cubs by Gamini, a female cheetah. This significant event provides a vital boost to the ongoing Project Cheetah, a crucial conservation initiative aimed at reintroducing and establishing a viable cheetah population in India.",
            "key_points": [
                "Kuno National Park's cheetah population grew to 38.",
                "Gamini gave birth to three cubs.",
                "Provides a vital boost to the ongoing Project Cheetah conservation initiative."
            ]
        },
        {
            "headline": "70-million-year-old dinosaur egg found in South America might hold a baby and reveal how dinosaurs raised their young",
            "summary": "A remarkably preserved 70-million-year-old dinosaur egg discovered in South America shows potential to contain an intact embryo. This extraordinary find offers an unprecedented opportunity to gain insights into dinosaur parenting behaviors and how these ancient creatures might have raised their young.",
            "key_points": [
                "A 70-million-year-old dinosaur egg found in South America.",
                "Might contain a preserved embryo, offering rare insights.",
                "Could reveal how dinosaurs raised their young and parenting behaviors."
            ]
        }
    ],
    "Health": [
        {
            "headline": "Hero dog 'Ceto' sniffs out breast and colon cancer, saves couple's life",
            "summary": "A remarkable dog named Ceto has been hailed as a hero for its incredible ability to sniff out early signs of both breast and colon cancer, potentially saving a couple's lives. This extraordinary feat highlights the emerging potential of animal detection in medical diagnostics and early disease intervention.",
            "key_points": [
                "Hero dog 'Ceto' detected breast and colon cancer.",
                "Potentially saved a couple's lives through early detection.",
                "Highlights the potential of animal detection in medical diagnostics."
            ]
        },
        {
            "headline": "Good fasting sugar but high HbA1c: How is that possible? Doctor clears the confusion around diabetes tests",
            "summary": "A doctor explains the apparent contradiction of having good fasting blood sugar levels while simultaneously showing a high HbA1c, clarifying common confusion around diabetes diagnostic tests. This distinction is crucial for understanding the difference between immediate glucose levels and long-term glucose control, offering vital insights for patients.",
            "key_points": [
                "Doctor clarifies paradox of good fasting sugar but high HbA1c.",
                "Explains confusion surrounding diabetes diagnostic tests.",
                "Highlights distinction between immediate and long-term glucose control."
            ]
        },
        {
            "headline": "Diabetes diet alert: Expert reveals these common foods spike your blood sugar more than sugar itself",
            "summary": "An expert has issued a critical diabetes diet alert, revealing that several common foods can unexpectedly spike blood sugar levels more significantly than sugar itself. This crucial information aims to educate individuals on overlooked dietary triggers, enabling better management of blood glucose and overall health.",
            "key_points": [
                "Expert issues diabetes diet alert.",
                "Reveals common foods can spike blood sugar more than pure sugar.",
                "Aims to educate on overlooked dietary triggers for blood glucose management."
            ]
        },
        {
            "headline": "Your urine could signal danger: Doctor explains what to watch for",
            "summary": "A doctor explains key indicators in urine that could signal potential health dangers, advising individuals on what specific changes or characteristics to watch for as early warning signs. Understanding these visual and other traits can prompt timely medical attention and potentially prevent serious health issues.",
            "key_points": [
                "Doctor explains key urine indicators for potential health dangers.",
                "Advises on specific changes to watch for as early warning signs.",
                "Understanding these traits can prompt timely medical attention."
            ]
        }
    ]
}