{
    "World": [
        {
            "headline": "US federal immigration agents kill 2nd Minneapolis man, sparking protests",
            "summary": "Federal immigration agents in Minneapolis fatally shot a second man, leading to widespread protests and calls for an end to ICE raids. The incident has reignited public anger over the use of force by federal agents in the city, raising significant concerns about accountability.",
            "key_points": [
                "Second fatal shooting by US federal immigration agents in Minneapolis.",
                "Incident triggered widespread protests and demands to end ICE raids.",
                "Public outcry is growing over the use of force by federal agents and accountability concerns."
            ]
        },
        {
            "headline": "To understand Trump better, Indian diplomacy must bridge knowledge gap",
            "summary": "Indian diplomacy needs to enhance its understanding of Donald Trump's political strategies and potential foreign policy impacts to effectively navigate future relations. Bridging this knowledge gap is crucial for maintaining a robust and informed diplomatic engagement with the United States.",
            "key_points": [
                "Indian diplomacy needs to improve its understanding of Donald Trump.",
                "Bridging knowledge gaps is crucial for effective future relations.",
                "Focus on understanding Trump's political strategies and potential foreign policy impacts."
            ]
        },
        {
            "headline": "Xi Ousts Closest Military Ally In Stunning PLA Purge That Reshapes China’s Power Structure",
            "summary": "Chinese President Xi Jinping has orchestrated a significant purge within the People's Liberation Army (PLA), removing a close military ally from power. This bold move is seen as a major reshaping of China's power structure and a strategic consolidation of Xi's authority over the armed forces.",
            "key_points": [
                "Xi Jinping purged a close military ally from the PLA.",
                "This action significantly reshapes China's power structure.",
                "Consolidates Xi's control over the military, indicating internal political shifts."
            ]
        },
        {
            "headline": "‘NATO’s War Kicks Off’: EU Heavy-Hitter Makes URGENT Announcement As Russia Goes All-Out",
            "summary": "A prominent EU leader has made an urgent announcement suggesting that \"NATO's war\" is commencing as Russia escalates its military actions, indicating a heightened state of alert. This signals a potential direct involvement in the ongoing conflict and a significant turning point in international relations.",
            "key_points": [
                "A key EU leader announced that 'NATO's war kicks off'.",
                "Statement made in response to Russia's escalated military actions.",
                "Indicates a significant turning point and potential direct involvement in the conflict."
            ]
        },
        {
            "headline": "Further Ukraine, Russia and US talks expected next week in Abu Dhabi",
            "summary": "Additional talks involving Ukraine, Russia, and the US are anticipated next week in Abu Dhabi to discuss potential parameters for ending the conflict. These discussions follow earlier \"constructive\" engagements aimed at de-escalation and finding a peaceful resolution to the ongoing war.",
            "key_points": [
                "Trilateral talks on the Ukraine conflict are set to continue in Abu Dhabi.",
                "Discussions aim to find parameters for a peaceful resolution.",
                "Follows previous 'constructive' engagements between the parties."
            ]
        },
        {
            "headline": "Trump Threatens Canada With 100% Tariff Over China Trade Push After Carney’s Beijing Visit",
            "summary": "Donald Trump has threatened Canada with a 100% tariff if it pursues a trade deal with China, particularly after Mark Carney's visit to Beijing. He stated such a move would 'completely devour' Canada, intensifying trade tensions and highlighting US concerns over China's growing economic influence.",
            "key_points": [
                "Trump threatened Canada with a 100% tariff.",
                "The threat is linked to Canada's potential trade deal with China, following Mark Carney's Beijing visit.",
                "Reflects escalating trade tensions and US concerns over China's economic power."
            ]
        },
        {
            "headline": "India Demands Accountability After Khalistanis Vandalise its Embassy in Croatia",
            "summary": "India has strongly demanded accountability after Khalistani elements vandalized its embassy in Croatia, raising concerns over security and diplomatic protocols. This incident highlights ongoing issues with extremist groups targeting Indian diplomatic missions abroad.",
            "key_points": [
                "India demanded accountability for Khalistani vandalism at its embassy in Croatia.",
                "The incident raises concerns about the security of diplomatic missions.",
                "Highlights ongoing issues with extremist groups targeting Indian interests."
            ]
        },
        {
            "headline": "Russian Air Defenses Shoot Down 75 Ukrainian Drones Overnight: MoD",
            "summary": "The Russian Ministry of Defense reported that its air defenses successfully shot down 75 Ukrainian drones overnight. This incident is part of ongoing hostilities in the region, showcasing persistent aerial attacks and defense operations.",
            "key_points": [
                "Russian air defenses shot down 75 Ukrainian drones overnight.",
                "Reported by the Russian Ministry of Defense.",
                "Indicates ongoing aerial hostilities in the region."
            ]
        },
        {
            "headline": "India votes against UN resolution censuring Iran",
            "summary": "India voted against a UN resolution that sought to censure Iran, signaling its independent foreign policy stance on critical international matters. This decision highlights India's complex diplomatic relations and its efforts to maintain engagement with various global powers, rather than align with specific blocs.",
            "key_points": [
                "India voted against a UN resolution to censure Iran.",
                "Decision reflects India's independent foreign policy stance.",
                "Highlights India's strategy of engaging with diverse global powers."
            ]
        },
        {
            "headline": "EU chief Ursula von der Leyen arrives in Delhi to firm up trade, defence and mobility deals",
            "summary": "EU chief Ursula von der Leyen has arrived in Delhi to finalize significant trade, defense, and mobility agreements with India. Her visit underscores the strengthening strategic partnership between the European Union and India, aiming to boost cooperation across key sectors.",
            "key_points": [
                "EU chief Ursula von der Leyen is in Delhi to finalize trade, defense, and mobility deals.",
                "The visit highlights the strengthening strategic partnership between the EU and India.",
                "Aims to boost cooperation across key sectors."
            ]
        },
        {
            "headline": "Taliban Takes the Helm at Afghan Embassy in Delhi: What India Stands to Gain?",
            "summary": "The Taliban has officially taken control of the Afghan Embassy in Delhi, raising questions about India's diplomatic engagement and potential gains from this development. This move signals a shift in India's policy towards Afghanistan and its evolving regional dynamics.",
            "key_points": [
                "Taliban has taken control of the Afghan Embassy in Delhi.",
                "Raises questions about India's diplomatic engagement with Afghanistan.",
                "Signals a shift in India's regional policy."
            ]
        },
        {
            "headline": "Selective Targeting of India Unfair & Unjustified: Jaishankar Tells Polish Deputy PM",
            "summary": "India's External Affairs Minister S. Jaishankar conveyed to the Polish Deputy Prime Minister that selective targeting of India is unfair and unjustified. This statement emphasizes India's stance against biased international criticism and highlights its demand for equitable treatment on the global stage.",
            "key_points": [
                "Jaishankar told Polish Deputy PM that selective targeting of India is unjustified.",
                "Emphasizes India's stance against biased international criticism.",
                "Highlights India's demand for equitable treatment on the global stage."
            ]
        },
        {
            "headline": "Russia, China Push Back on Western Military Moves in Asia-Pacific: Foreign Ministry",
            "summary": "Russia and China are actively pushing back against what they perceive as Western military moves and expansion in the Asia-Pacific region, as stated by their foreign ministries. This joint stance signals growing geopolitical tension and a strategic alignment between Moscow and Beijing to counter Western influence.",
            "key_points": [
                "Russia and China are pushing back against Western military moves in Asia-Pacific.",
                "Statement from their foreign ministries signals geopolitical tension.",
                "Highlights strategic alignment between Moscow and Beijing to counter Western influence."
            ]
        },
        {
            "headline": "‘No Mercy For Betrayal’: Danish Soldiers Up In Arms As Trump’s Greenland Threat Shakes NATO Trust",
            "summary": "Danish soldiers are reportedly upset and distrustful after former President Trump's threats regarding Greenland, which have profoundly shaken NATO trust. This incident has raised significant concerns about allied solidarity and the reliability of international partnerships.",
            "key_points": [
                "Danish soldiers express outrage over Trump's Greenland threats.",
                "The incident has eroded trust within NATO alliances.",
                "Raises concerns about allied solidarity and reliability of international partnerships."
            ]
        },
        {
            "headline": "How Europeans closed ranks to defend Greenland against Trump",
            "summary": "European nations united to defend Greenland's sovereignty and position against former President Trump's past proposals for a purchase, demonstrating a strong collective front. This swift and coordinated response highlighted European solidarity and commitment to its member states and territories.",
            "key_points": [
                "European nations collectively defended Greenland against Trump's proposals.",
                "Demonstrated a strong collective front and solidarity.",
                "Highlighted Europe's commitment to its member states and territories."
            ]
        }
    ],
    "Business": [
        {
            "headline": "Meet the barbies powering India’s unicorn boom",
            "summary": "This article highlights successful women entrepreneurs who are driving India's rapid growth in the unicorn startup space, affectionately termed \"barbies.\" These women symbolize innovation, leadership, and the changing landscape of Indian business, inspiring a new generation of founders.",
            "key_points": [
                "Focuses on successful women entrepreneurs in India's startup ecosystem.",
                "These women are significantly contributing to India's 'unicorn boom'.",
                "Symbolize innovation, leadership, and the evolving Indian business landscape."
            ]
        },
        {
            "headline": "India’s BPCL Eyes $780M Crude Agreement With Brazil’s Petrobras: Petroleum Minister",
            "summary": "India's Bharat Petroleum Corporation Limited (BPCL) is reportedly pursuing a $780 million crude oil agreement with Brazil's state-owned Petrobras. This strategic move aims to diversify India's energy sources, reduce reliance on traditional suppliers, and strengthen international energy partnerships.",
            "key_points": [
                "BPCL is eyeing a $780 million crude oil deal with Brazil's Petrobras.",
                "The agreement aims to diversify India's crude oil sources.",
                "Strengthens international energy partnerships for India."
            ]
        },
        {
            "headline": "Russia Stays Vital to India’s Oil Supply: Oil Analyst Rejects US Claim",
            "summary": "An oil analyst has refuted US claims that India can easily replace Russian oil, asserting that Russia remains a crucial and indispensable supplier for India's energy needs. This highlights the ongoing geopolitical complexities surrounding global energy markets and India's strategic energy decisions.",
            "key_points": [
                "Oil analyst asserts Russia is vital for India's oil supply.",
                "Rejects US claims that Russian oil can be easily replaced by India.",
                "Underlines geopolitical complexities in global energy markets for India."
            ]
        },
        {
            "headline": "World Bank clears Rs 5,700 crore for 'Jal Sanrakshit' Haryana, canal revival and micro-irrigation at core",
            "summary": "The World Bank has approved a significant Rs 5,700 crore project for Haryana, focusing on comprehensive water conservation initiatives under 'Jal Sanrakshit'. Key components include the revival of canals and the implementation of advanced micro-irrigation systems to ensure sustainable water management and agricultural productivity.",
            "key_points": [
                "World Bank approves Rs 5,700 crore project for Haryana's water conservation.",
                "Project focuses on 'Jal Sanrakshit' initiatives, including canal revival.",
                "Implementation of micro-irrigation systems is a core component for sustainable water management."
            ]
        },
        {
            "headline": "India’s maritime sector seen drawing Rs 80 lakh crore investment; Vizhinjam to emerge as global hub, says Sonowal",
            "summary": "India's maritime sector is projected to attract a massive Rs 80 lakh crore investment, with the Vizhinjam port envisioned to become a global hub, according to Minister Sonowal. This ambitious plan aims to significantly boost India's coastal economy, enhance trade capabilities, and establish a prominent position in international shipping.",
            "key_points": [
                "India's maritime sector is projected to attract Rs 80 lakh crore investment.",
                "Vizhinjam port is envisioned to emerge as a global shipping hub.",
                "The plan aims to boost India's coastal economy and trade capabilities significantly."
            ]
        },
        {
            "headline": "New national electricity policy proposes automatic, annual tariff increase",
            "summary": "A proposed new national electricity policy suggests an automatic, annual increase in tariffs to ensure financial viability for power distribution companies. This aims to cover rising operational costs, reduce regulatory lag, and encourage sustained investment in the power sector for improved service delivery.",
            "key_points": [
                "New electricity policy proposes automatic annual tariff increases.",
                "Aims to ensure financial viability for power distribution companies.",
                "Seeks to cover rising costs and reduce regulatory lag in the power sector."
            ]
        },
        {
            "headline": "Housing market cools after boom year as sales fall 12% in 2025, prices remain resilient: PropTiger report",
            "summary": "India's housing market is showing signs of cooling after a boom year, with sales falling by 12% in 2025, according to a PropTiger report. Despite the dip in sales, property prices have largely remained resilient, indicating a market adjustment rather than a sharp downturn after a period of rapid growth.",
            "key_points": [
                "India's housing market is cooling down after a boom year.",
                "Sales fell by 12% in 2025, according to PropTiger report.",
                "Property prices have largely remained resilient despite the sales dip."
            ]
        },
        {
            "headline": "Investor connect: NSE takes financial literacy drive to Kolkata Book Fair; sets up 14-day awareness pavilion",
            "summary": "The National Stock Exchange (NSE) has launched a comprehensive financial literacy drive at the Kolkata Book Fair, establishing a 14-day awareness pavilion. This initiative aims to educate the public on investing, financial markets, and wealth management, fostering a more informed investor base.",
            "key_points": [
                "NSE launched a financial literacy drive at the Kolkata Book Fair.",
                "A 14-day awareness pavilion has been set up to educate the public.",
                "Aims to inform the public about investing and financial markets."
            ]
        },
        {
            "headline": "25% Tariff On Indian Russian Oil: US signals removal after imports fall; EU faces criticism",
            "summary": "The US is signaling the potential removal of a 25% tariff on Indian imports of Russian oil, following a decline in those imports. Meanwhile, the EU faces criticism regarding the effectiveness of its own energy policies and sanctions against Russia, highlighting global economic and geopolitical complexities.",
            "key_points": [
                "US may remove a 25% tariff on Indian imports of Russian oil.",
                "Decision follows a decrease in India's imports of Russian oil.",
                "EU faces criticism over the effectiveness of its energy policies and sanctions."
            ]
        }
    ],
    "Technology": [
        {
            "headline": "‘An internet connection can end poverty’: Why Elon Musk says the poor need Wi-Fi, not pity",
            "summary": "Elon Musk argues that providing internet access, specifically Wi-Fi, to the impoverished is a more effective solution to poverty than pity. He believes that connectivity empowers individuals with critical opportunities for education, information, and economic advancement, fundamentally changing their life trajectories.",
            "key_points": [
                "Elon Musk advocates for internet access, especially Wi-Fi, as a solution to poverty.",
                "Believes connectivity empowers individuals with opportunities for education and economic advancement.",
                "Suggests practical access is more impactful than mere pity."
            ]
        },
        {
            "headline": "Parents are asking AI about their kids: Here’s why experts say 'pause'",
            "summary": "Parents are increasingly using AI to seek advice about their children, but experts are urging caution, advising a \"pause\" due to concerns. These concerns include data privacy, the accuracy of information, and the potential for biased or inappropriate recommendations generated by AI models when dealing with sensitive child-related matters.",
            "key_points": [
                "Parents are increasingly using AI for child-related advice.",
                "Experts advise caution and a 'pause' due to several concerns.",
                "Concerns include data privacy, accuracy, and potential for biased AI recommendations."
            ]
        },
        {
            "headline": "AI sovereignty should not mean isolation: World Economic Forum AI head",
            "summary": "The head of AI at the World Economic Forum emphasized that national \"AI sovereignty\" should not lead to isolation but rather foster international collaboration. This statement highlights the critical need for a balanced approach to AI development and governance on a global scale, promoting shared innovation and ethical standards.",
            "key_points": [
                "WEF AI head states AI sovereignty should not lead to isolation.",
                "Emphasizes the need for international collaboration in AI development.",
                "Advocates for a balanced approach to global AI governance and innovation."
            ]
        },
        {
            "headline": "Paris Hilton joins the fight against sexually-explicit AI deepfakes",
            "summary": "Paris Hilton has joined the growing movement to combat sexually-explicit AI deepfakes, using her public platform to raise awareness and advocate for stricter regulations. Her involvement highlights the increasing concern over the misuse of AI technology for creating harmful and non-consensual content, prompting calls for legislative action.",
            "key_points": [
                "Paris Hilton is joining the fight against sexually-explicit AI deepfakes.",
                "She is using her platform to raise awareness and advocate for stricter regulations.",
                "Her involvement highlights growing concerns over the harmful misuse of AI technology."
            ]
        },
        {
            "headline": "This robotic hand can detach, grab objects, and attach back to the arm",
            "summary": "Researchers have developed an advanced robotic hand capable of detaching from an arm, independently grabbing objects, and seamlessly reattaching itself. This breakthrough offers significant potential for enhancing prosthetics, enabling complex manipulation tasks in various industries, and advancing human-robot interaction capabilities.",
            "key_points": [
                "New robotic hand can detach, grab objects independently, and reattach to the arm.",
                "This breakthrough offers significant potential for prosthetics.",
                "It also has implications for complex manipulation tasks in various industries."
            ]
        },
        {
            "headline": "\"Stealing isn't innovation\": 800 artists sign letter against AI firms",
            "summary": "Over 800 artists have signed an open letter condemning AI firms for what they describe as \"stealing\" copyrighted material for training their AI models, asserting that such practices are not true innovation. This collective action highlights growing concerns over intellectual property rights and ethical considerations in the rapidly evolving AI era.",
            "key_points": [
                "Over 800 artists signed a letter against AI firms.",
                "They accuse AI firms of 'stealing' copyrighted material for training.",
                "The action highlights growing concerns over intellectual property rights in the AI era."
            ]
        }
    ],
    "Entertainment": [
        {
            "headline": "‘Border 2’ box office collections Day 2",
            "summary": "The film 'Border 2' has shown its box office performance on Day 2, indicating its initial reception and revenue generated across theaters. This news provides an update on the movie's commercial success and audience response in the early stages of its theatrical run.",
            "key_points": [
                "Box office collections for 'Border 2' on Day 2 have been reported.",
                "Indicates the initial commercial success of the film.",
                "Provides an update on the movie's early theatrical run."
            ]
        },
        {
            "headline": "Upasana Singh reacts to rumours of rift with Kapil Sharma",
            "summary": "Actress Upasana Singh has addressed and reacted to circulating rumors about a potential rift with popular comedian Kapil Sharma, clarifying her relationship with him. Her statement aims to put an end to media speculation and provide clarity to fans regarding their professional and personal dynamics.",
            "key_points": [
                "Upasana Singh responded to rumors of a rift with Kapil Sharma.",
                "She clarified her relationship with the comedian.",
                "The statement aims to address media speculation and provide clarity."
            ]
        },
        {
            "headline": "Palash files defamation case of Rs 10 crore on Vidnyan after cheating allegations",
            "summary": "Musician Palash Muchhal has filed a substantial defamation lawsuit seeking Rs 10 crore against Vidnyan Mane following serious allegations of cheating. This legal action comes after public accusations made against Muchhal, intensifying a public dispute between the two individuals.",
            "key_points": [
                "Palash Muchhal filed a Rs 10 crore defamation case.",
                "The case is against Vidnyan Mane over cheating allegations.",
                "The legal action follows public accusations, intensifying the dispute."
            ]
        },
        {
            "headline": "‘Jana Nayagan’ censor row: Thalapathy Vijay refuses cuts",
            "summary": "Actor Thalapathy Vijay has reportedly refused to accept cuts suggested by the censor board for his upcoming film 'Jana Nayagan', leading to a significant dispute. This standoff could potentially lead to delays or further disagreements over the movie's final release version, highlighting creative control issues.",
            "key_points": [
                "Thalapathy Vijay refused censor board's suggested cuts for 'Jana Nayagan'.",
                "The refusal has led to a significant dispute.",
                "This could cause delays or further disagreements over the film's release."
            ]
        },
        {
            "headline": "Mammootty opens up on 'Chatha Pacha' cameo; Says 'I don’t have any responsibility for it'",
            "summary": "Veteran actor Mammootty has spoken about his cameo appearance in the film 'Chatha Pacha', explicitly stating that he holds no responsibility for the movie's content or outcome. His comments clarify his limited involvement in the production amidst discussions about the film's performance or reception.",
            "key_points": [
                "Mammootty spoke about his cameo appearance in 'Chatha Pacha'.",
                "He stated he holds no responsibility for the film.",
                "His comments clarify his limited involvement in the movie's production."
            ]
        },
        {
            "headline": "Mammootty - Khalid Rahman film UPDATE: Announcement posts removed; Future of project unclear",
            "summary": "All official announcement posts for the highly anticipated Mammootty-Khalid Rahman film project have been abruptly removed, rendering the future of the collaboration unclear. This sudden development has sparked widespread speculation among fans and industry insiders regarding the film's status and whether it will proceed as planned.",
            "key_points": [
                "Announcement posts for the Mammootty-Khalid Rahman film have been removed.",
                "The future of the project is now unclear.",
                "The sudden development has sparked widespread speculation among fans and industry insiders."
            ]
        }
    ],
    "Sports": [
        {
            "headline": "'There's a coach at home': SKY reveals how his wife helped him rediscover form",
            "summary": "Indian cricketer Suryakumar Yadav (SKY) shared that his wife played a crucial role in helping him regain his form, jokingly calling her his \"coach at home.\" This heartwarming revelation highlights the significant personal support behind his professional success and his wife's impact on his performance.",
            "key_points": [
                "Suryakumar Yadav (SKY) credited his wife for helping him rediscover form.",
                "He jokingly referred to his wife as his 'coach at home'.",
                "The revelation highlights the personal support behind his professional success."
            ]
        },
        {
            "headline": "'Blackmail cricket world': PCB chief Naqvi under fire over pullout remarks",
            "summary": "PCB chief Naqvi is facing severe criticism for his \"blackmail cricket world\" remarks, which suggest threats of pulling out from international tournaments. These controversial comments have drawn widespread ire and raised concerns about Pakistan's stance and reputation in global cricket circles, particularly regarding future participation.",
            "key_points": [
                "PCB chief Naqvi is criticized for 'blackmail cricket world' remarks.",
                "His comments suggest threats of pulling out from international tournaments.",
                "This has raised concerns about Pakistan's standing in global cricket."
            ]
        },
        {
            "headline": "'Bangladesh overplayed its hand': Former BCB secretary slams T20 World Cup pullout",
            "summary": "A former BCB secretary has strongly criticized Bangladesh's decision to pull out of the T20 World Cup, stating the board \"overplayed its hand\" in negotiations or strategic decisions. This highlights internal disagreements and potential miscalculations regarding the tournament, drawing scrutiny to the BCB's leadership.",
            "key_points": [
                "Former BCB secretary criticized Bangladesh's T20 World Cup pullout.",
                "Stated the board 'overplayed its hand' in its decision-making.",
                "Highlights internal disagreements and potential miscalculations regarding the tournament."
            ]
        },
        {
            "headline": "Stunning prediction! 'Shreyas Iyer can captain India to a World Cup win'",
            "summary": "A bold and stunning prediction has been made that Indian cricketer Shreyas Iyer possesses the leadership qualities and potential to captain India to a World Cup victory. This statement highlights significant confidence in his capabilities and suggests a promising future role in Indian cricket leadership.",
            "key_points": [
                "A stunning prediction states Shreyas Iyer can captain India to a World Cup win.",
                "Highlights confidence in his leadership qualities.",
                "Suggests a potential significant future role for him in Indian cricket."
            ]
        },
        {
            "headline": "Diamond League Final: Neeraj Chopra's event preview, time and live telecast in India",
            "summary": "This article provides a comprehensive preview of Indian javelin thrower Neeraj Chopra's highly anticipated participation in the Diamond League Final. It includes essential event details, timings, and live telecast information specifically for Indian viewers, allowing fans to follow his performance in this prestigious athletic competition.",
            "key_points": [
                "Comprehensive preview of Neeraj Chopra's event at the Diamond League Final.",
                "Includes event details, timings, and live telecast information for India.",
                "Allows Indian fans to follow his performance in the prestigious athletic event."
            ]
        },
        {
            "headline": "FIDE WC in India: PM Modi says 'Chess is gaining popularity among our youth'",
            "summary": "Prime Minister Modi, speaking at the FIDE World Cup in India, highlighted the increasing popularity of chess among Indian youth as a significant development. His remarks underscore the growing interest in intellectual sports in the country and the potential for India to emerge as a chess powerhouse.",
            "key_points": [
                "PM Modi noted that chess is gaining popularity among Indian youth.",
                "Remarks were made at the FIDE World Cup hosted in India.",
                "Highlights the growing interest in intellectual sports across the country."
            ]
        },
        {
            "headline": "Gully To Glory: Ramandeep Singh's journey from Chandigarh to Team India via KKR",
            "summary": "This article chronicles Ramandeep Singh's inspiring journey from playing local gully cricket in Chandigarh to representing Team India on the international stage, with a crucial stepping stone at KKR. It showcases his dedication, perseverance, and remarkable rise through the ranks of Indian cricket.",
            "key_points": [
                "Ramandeep Singh's inspiring journey from Chandigarh's gully cricket to Team India.",
                "His path included a crucial stint with KKR.",
                "Highlights his dedication and rise through the ranks of Indian cricket."
            ]
        }
    ],
    "Science": [
        {
            "headline": "World's biggest camera catches mountain-sized asteroid spinning like crazy",
            "summary": "The world's largest camera has captured unprecedented images of a mountain-sized asteroid rotating at an exceptionally high speed in space. This remarkable observation provides invaluable data for asteroid dynamics, planetary defense research, and understanding the formation of celestial bodies.",
            "key_points": [
                "The world's largest camera observed a mountain-sized asteroid.",
                "The asteroid was seen spinning at an exceptionally high speed.",
                "Provides valuable data for asteroid dynamics and planetary defense research."
            ]
        },
        {
            "headline": "Why trawling is still allowed in protected Scottish waters",
            "summary": "This article investigates the reasons behind the continued allowance of trawling in supposedly protected Scottish waters, despite widespread environmental concerns. It delves into the complex legal, economic, and political factors influencing marine conservation policies and highlights the ongoing debate between industry and environmental groups.",
            "key_points": [
                "Investigates the reasons for continued trawling in protected Scottish waters.",
                "Highlights the complex legal, economic, and political factors involved.",
                "Addresses the ongoing debate between industry and environmental concerns."
            ]
        },
        {
            "headline": "Nature loss is a national security risk, intelligence chiefs warn",
            "summary": "Intelligence chiefs across several nations have issued a stark warning that accelerating nature loss poses a significant national security risk, impacting critical resources and global stability. This unprecedented assessment elevates environmental degradation to a critical security concern, urging immediate international action.",
            "key_points": [
                "Intelligence chiefs warn that accelerating nature loss is a significant national security risk.",
                "It impacts critical resources and global stability.",
                "Elevates environmental degradation to a critical security concern."
            ]
        },
        {
            "headline": "Whales may ‘divide resources’ to cope with climate change - study",
            "summary": "A new study suggests that whales might be adapting to the challenges of climate change by strategically \"dividing resources\" within their populations. This could involve altering their feeding grounds, migration patterns, or social structures, offering crucial insights into marine mammal survival strategies amidst rapidly changing environments.",
            "key_points": [
                "A new study suggests whales may be 'dividing resources' to cope with climate change.",
                "This adaptation could involve changes in feeding grounds or social structures.",
                "Offers insights into marine mammal survival strategies in changing environments."
            ]
        }
    ],
    "Health": [
        {
            "headline": "Silver lining: Woman lives 25 years with a donor heart",
            "summary": "In a remarkable medical achievement, a woman has successfully lived for 25 years with a donor heart, showcasing a significant milestone in transplant medicine. Her longevity offers immense hope and a \"silver lining\" for recipients of organ transplants, demonstrating the potential for long-term survival and quality of life.",
            "key_points": [
                "A woman has remarkably lived 25 years with a donor heart.",
                "This marks a significant milestone in transplant medicine.",
                "Her longevity offers immense hope for organ transplant recipients."
            ]
        },
        {
            "headline": "Kidney disease is a silent killer most Indians don’t see coming",
            "summary": "Kidney disease is identified as a \"silent killer\" that often goes undetected among Indians until it reaches advanced and irreversible stages. The article emphasizes the critical importance of early diagnosis, regular screening, and public awareness campaigns to combat its devastating effects and improve patient outcomes in India.",
            "key_points": [
                "Kidney disease is identified as a 'silent killer' in India.",
                "It often goes undetected until advanced stages.",
                "Highlights the critical need for early diagnosis and public awareness to combat its effects."
            ]
        },
        {
            "headline": "Australian study finds heart cells can regenerate post-heart attack; India’s leading cardiologist calls it a ‘big step’",
            "summary": "An Australian study has made a groundbreaking discovery that heart cells possess the ability to regenerate after a heart attack, a finding hailed as a \"big step\" by India's leading cardiologists. This research offers new and promising avenues for treating heart damage, potentially revolutionizing cardiac care.",
            "key_points": [
                "An Australian study found heart cells can regenerate after a heart attack.",
                "India’s leading cardiologists called this a ‘big step’.",
                "This research offers new avenues for treating heart damage."
            ]
        },
        {
            "headline": "Do alcohol-free ‘only weekend drinking’ habits still damage the liver?",
            "summary": "This article explores whether an \"alcohol-free only weekend drinking\" habit can still cause liver damage, challenging the common perception of moderate, infrequent consumption as harmless. It delves into the nuances of alcohol's impact on liver health and suggests that even patterned drinking can pose risks.",
            "key_points": [
                "Examines if 'alcohol-free only weekend drinking' can still damage the liver.",
                "Challenges the perception of moderate, infrequent consumption as harmless.",
                "Delves into the nuances of alcohol's impact on liver health."
            ]
        }
    ]
}