{
    "World": [
        {
            "headline": "Ukraine Conflict Escalates: Putin's Residence Targeted, Odesa Attacked, and Troop Movements Reported",
            "summary": "The Ukraine conflict saw significant escalation with reports of Ukrainian drones targeting President Putin's residence and a major overnight drone strike on Odesa, injuring six, including children. Meanwhile, Russian forces claimed advances into enemy defenses and control of the Andreyevka settlement, while also reporting the destruction of a large number of Ukrainian drones.",
            "key_points": [
                "Ukrainian drones reportedly attacked President Putin's secret residence, drawing condemnation and expert warnings of potential nuclear war triggers.",
                "A major Russian drone strike on Odesa injured six people, including children, highlighting continued attacks on Ukrainian cities.",
                "Russia claimed territorial gains in Andreyevka and significant success in destroying Ukrainian drones, with numbers ranging up to 141 overnight.",
                "International diplomacy continued with Russia-US consultations on Ukraine, though Moscow insists the broader agenda should not be limited to the conflict."
            ]
        },
        {
            "headline": "Khaleda Zia, Former Bangladesh PM, Dies at 80; Funeral Draws Thousands",
            "summary": "Former Bangladesh Prime Minister Khaleda Zia passed away at the age of 80. Her funeral prayers drew thousands of mourners in Dhaka, marking the end of an era in Bangladeshi politics.",
            "key_points": [
                "Khaleda Zia, a prominent figure in Bangladesh's political landscape, died at 80.",
                "Thousands gathered in Dhaka for her funeral prayers.",
                "Indian External Affairs Minister Jaishankar expressed optimism for strengthening India-Bangladesh ties following the elections, during which he handed a letter from PM Modi to BNP Chief Tarique Rahman."
            ]
        },
        {
            "headline": "Indian Americans' 'American Dream' Shattered Amid Immigration Challenges",
            "summary": "The American dream for many Indian Americans is reportedly being shredded, likely due to a combination of economic, social, and immigration hurdles. This comes as Indian citizens also seek clarity on H-1B visa renewals from countries like the UAE.",
            "key_points": [
                "Indian Americans are reportedly facing severe challenges in achieving their American dream.",
                "The situation highlights broader issues within US immigration policies and economic conditions affecting the diaspora.",
                "Questions arise about the feasibility for Indian citizens to renew H-1B visas from third countries like the UAE."
            ]
        },
        {
            "headline": "Trump Pulls National Guard Troops from Major US Cities After Court Setbacks",
            "summary": "Former President Donald Trump announced the withdrawal of National Guard troops from Chicago, Los Angeles, and Portland. This decision follows various court setbacks for his administration, with Trump stating the troops would return 'when...' implying future conditions.",
            "key_points": [
                "National Guard troops have been withdrawn from Chicago, LA, and Portland.",
                "The decision by Donald Trump comes amidst ongoing legal challenges and court setbacks.",
                "Trump indicated a conditional return of the troops, suggesting future circumstances might warrant their redeployment."
            ]
        },
        {
            "headline": "Undersea Cables Damaged in Gulf of Finland, Authorities Investigate Sabotage",
            "summary": "Authorities are investigating significant damage to undersea telecommunication cables in the Gulf of Finland. The incident has raised concerns about critical infrastructure security and potential sabotage in the region.",
            "key_points": [
                "Multiple undersea cables connecting Finland and Estonia have been damaged.",
                "An investigation is underway, with concerns about deliberate sabotage.",
                "The incident highlights vulnerabilities in critical digital infrastructure in Northern Europe."
            ]
        },
        {
            "headline": "Indian SC Handled 75,000 Cases in 2025, Unmatched by Other Top Courts",
            "summary": "The Indian Supreme Court demonstrated an unparalleled workload in 2025, handling 75,000 cases. This volume is noted as unmatched by any other top court globally, underscoring the scale and efficiency of India's highest judicial body.",
            "key_points": [
                "India's Supreme Court processed 75,000 cases in 2025.",
                "This caseload is reportedly higher than any other top court worldwide.",
                "The statistic highlights the significant demands and capacity of the Indian judicial system."
            ]
        },
        {
            "headline": "CIA Drone Strikes Venezuelan Cartels Amid Tensions with Maduro",
            "summary": "The CIA has launched a high-stakes air campaign involving drone strikes against Venezuelan cartels. This operation unfolds amid growing tensions between the United States and the Maduro regime in Venezuela, signaling an escalation in covert operations against criminal networks.",
            "key_points": [
                "CIA is conducting drone strikes against Venezuelan cartels.",
                "The operation highlights increased US engagement in the region.",
                "Tensions with the Maduro government are a backdrop to these high-stakes interventions."
            ]
        },
        {
            "headline": "'Want 22 of 28 Seats': Amit Shah Sets Ambitious Target for Bengal BJP in Kolkata Region",
            "summary": "Union Home Minister Amit Shah has set an ambitious electoral target for the Bengal BJP, aiming to secure 22 out of 28 seats from Kolkata and its nearby areas. This declaration signals a focused and aggressive campaign strategy for the upcoming elections in the crucial state of West Bengal.",
            "key_points": [
                "Amit Shah has set a target of winning 22 of 28 seats in the Kolkata region for the Bengal BJP.",
                "The announcement indicates a strategic focus on urban and semi-urban constituencies in West Bengal.",
                "This reflects the BJP's intensified efforts to expand its political footprint in the state."
            ]
        },
        {
            "headline": "Trump Slams George Clooney Over French Citizenship, Sparking Celebrity-Political Row",
            "summary": "Donald Trump publicly criticized George Clooney over the actor's French citizenship, adding another dimension to the intersection of celebrity status and political commentary. This outburst reignites debates about public figures' political allegiances and national identity.",
            "key_points": [
                "Donald Trump attacked George Clooney regarding his French citizenship.",
                "The comments highlight the ongoing public feuds between Trump and celebrity figures.",
                "This incident contributes to the broader discussion on celebrity political statements and dual nationality."
            ]
        }
    ],
    "Business": [
        {
            "headline": "Cabinet Freezes Vodafone Idea Dues at Rs 87.7k Crore, Offering Fresh Relief",
            "summary": "The Indian Cabinet has approved a crucial relief package for Vodafone Idea, freezing its accumulated dues at Rs 87,700 crore. This move provides significant financial respite to the struggling telecom operator, aiming to stabilize its operations and competitiveness in the Indian market.",
            "key_points": [
                "Vodafone Idea's dues have been frozen at Rs 87.7k crore by the Cabinet.",
                "The decision offers much-needed financial relief to the telecom company.",
                "This intervention aims to support the viability of Vodafone Idea in India's competitive telecom sector."
            ]
        },
        {
            "headline": "India Poised to Become $26 Trillion Economy by 2047: Report",
            "summary": "A new report projects India's economy to reach a staggering $26 trillion by 2047, coinciding with 100 years of independence. This optimistic forecast underscores India's rapid economic growth trajectory and its potential to become a global economic powerhouse.",
            "key_points": [
                "India's economy is projected to hit $26 trillion by 2047.",
                "This growth trajectory aligns with the country's centenary of independence.",
                "The forecast positions India as a major global economic force in the coming decades."
            ]
        },
        {
            "headline": "Gig Workers Launch Nationwide Strike Demanding Pay Structure Changes",
            "summary": "Gig workers across India launched a nationwide strike on New Year's Eve, primarily demanding the removal of the '10-minute delivery option' and a fundamental change in their pay structure. This collective action highlights growing concerns over working conditions and compensation in the rapidly expanding gig economy.",
            "key_points": [
                "Gig workers in India initiated a nationwide strike on New Year's Eve.",
                "Key demands include abolishing the 10-minute delivery option and revising pay structures.",
                "The strike underscores rising discontent among gig workers regarding their working conditions and earnings."
            ]
        },
        {
            "headline": "RBI Report Shows Indian Banks Healthiest in a Decade, Can Bear Shocks",
            "summary": "A report from the Reserve Bank of India (RBI) indicates that Indian banks are in their healthiest state in a decade, capable of withstanding potential economic shocks. This positive assessment reflects improved asset quality and robust capital buffers within the country's banking sector.",
            "key_points": [
                "Indian banks are currently in their strongest position in the last ten years, according to the RBI.",
                "The banking sector demonstrates resilience against economic shocks.",
                "Improved asset quality and capital adequacy contribute to this robust financial health."
            ]
        },
        {
            "headline": "PM Modi: Pragati-Led Ecosystem Accelerated Projects Worth Rs 85 Lakh Crore in 10 Years",
            "summary": "Prime Minister Narendra Modi announced that the 'Pragati-led ecosystem' has accelerated projects worth Rs 85 lakh crore over the past decade. This initiative, designed for proactive governance and timely implementation, highlights significant progress in India's infrastructure and development projects.",
            "key_points": [
                "Projects worth Rs 85 lakh crore have been accelerated by the Pragati platform in 10 years.",
                "Pragati aims for proactive governance and efficient project implementation.",
                "The announcement signifies substantial progress in India's development and infrastructure sectors."
            ]
        },
        {
            "headline": "Govt Launches Rs 4,531 Crore Market Access Support for Exporters",
            "summary": "The Indian government has rolled out a Rs 4,531 crore market access support scheme for exporters, with a particular focus on MSMEs and priority sectors. This initiative aims to boost India's export performance and help domestic businesses expand their global footprint.",
            "key_points": [
                "Indian government allocates Rs 4,531 crore for market access support to exporters.",
                "The scheme prioritizes MSMEs and key export sectors.",
                "The objective is to enhance India's export capabilities and global trade presence."
            ]
        },
        {
            "headline": "Broadband User Base Exceeds 100 Crore in November, Jio Leads Market",
            "summary": "India's broadband subscriber base crossed the significant milestone of 100 crore in November, with Jio maintaining its leadership position in the market. This exponential growth reflects the widespread digital adoption and expanding internet connectivity across the country.",
            "key_points": [
                "India's broadband user base reached over 100 crore subscribers in November.",
                "Reliance Jio continues to dominate the Indian broadband market.",
                "This milestone highlights the massive digital penetration and connectivity expansion in India."
            ]
        },
        {
            "headline": "AI Not a Threat, Can Raise Worker Value: Anand Mahindra",
            "summary": "Prominent Indian industrialist Anand Mahindra has voiced his perspective on Artificial Intelligence, stating that AI is not a threat to jobs but rather has the potential to enhance and raise the value of workers. His comments offer a positive outlook on AI's integration into the workforce.",
            "key_points": [
                "Anand Mahindra views AI as an opportunity rather than a job threat.",
                "He believes AI can increase the value and capabilities of human workers.",
                "This perspective encourages embracing AI for economic and workforce development."
            ]
        }
    ],
    "Technology": [
        {
            "headline": "HAL Unveils India's Next-Gen Civil Helicopter, Boosting Indigenous Aviation",
            "summary": "Hindustan Aeronautics Limited (HAL) has unveiled India's next-generation civil helicopter, marking a significant stride in the country's indigenous aviation capabilities. This development aims to cater to both domestic and international markets, reducing reliance on foreign imports.",
            "key_points": [
                "HAL introduced India's advanced civil helicopter model.",
                "The project emphasizes self-reliance and technological advancement in aviation.",
                "It aims to serve civilian purposes domestically and potentially for export."
            ]
        },
        {
            "headline": "Elon Musk's Chilling Comment on AI's 'Real Purpose' Resurfaces",
            "summary": "Elon Musk's previous chilling remark about the 'real purpose' of Artificial Intelligence, suggesting it aims to create a 'lifeform that would understand everything,' has resurfaced. His comment sparks renewed debate on the existential implications and ultimate goals of advanced AI development.",
            "key_points": [
                "Elon Musk's comment on AI's purpose as creating a 'lifeform that would understand everything' has gained attention.",
                "The remark fuels discussion on AI's long-term implications.",
                "It highlights ongoing concerns about the future trajectory and control of advanced AI systems."
            ]
        },
        {
            "headline": "AI-Made Videos Promote Poland's EU Exit, Raising Disinformation Concerns",
            "summary": "AI-generated videos, often featuring attractive young women, are being used to promote Poland's exit from the European Union. This development raises significant concerns about the growing use of artificial intelligence in political disinformation campaigns and its potential to influence public opinion.",
            "key_points": [
                "AI-generated videos are spreading pro-Poland exit messages within the EU.",
                "The use of AI in political campaigns raises disinformation alarms.",
                "This trend highlights the evolving challenges of combating online propaganda."
            ]
        },
        {
            "headline": "Meta Acquires AI Startup Manus in Deal Valued Over $2 Billion",
            "summary": "Meta Platforms has announced its acquisition of AI startup Manus in a deal reportedly valued at over $2 billion. This strategic move signifies Meta's continued investment and expansion in artificial intelligence capabilities, particularly in areas like advanced haptics and interaction for immersive experiences.",
            "key_points": [
                "Meta is acquiring AI startup Manus for over $2 billion.",
                "The acquisition underscores Meta's commitment to advancing its AI research and development.",
                "Manus's expertise is expected to bolster Meta's efforts in areas like VR/AR and haptic feedback."
            ]
        },
        {
            "headline": "Energy Efficiency Push: Star Ratings Mandatory for Appliances from Jan 1",
            "summary": "As part of an energy efficiency push, star ratings have become mandatory for several household appliances, including refrigerators, televisions, and LPG stoves, starting January 1. This regulatory change aims to encourage consumers to opt for more energy-efficient products and reduce overall energy consumption.",
            "key_points": [
                "Star ratings are now compulsory for refrigerators, TVs, and LPG stoves.",
                "The measure is effective from January 1, promoting energy efficiency.",
                "This initiative targets reduced energy consumption and encourages sustainable choices among consumers."
            ]
        }
    ],
    "Entertainment": [
        {
            "headline": "Bollywood's 'Dhurandhar' Crosses Rs 1,100 Crore, Chasing 'Jawan's Record",
            "summary": "Ranveer Singh's 'Dhurandhar' has soared past the Rs 1,100 crore mark at the box office, becoming a monumental success. The film is now chasing Shah Rukh Khan's 'Jawan' record to become the highest-earning Bollywood film, while also facing challenges like a $10 million loss due to a Gulf ban.",
            "key_points": [
                "Ranveer Singh's 'Dhurandhar' achieved over Rs 1,100 crore at the box office.",
                "The film is aiming to surpass 'Jawan' to become the highest-grossing Bollywood film.",
                "It faced an international setback with a $10 million loss due to a Gulf ban."
            ]
        },
        {
            "headline": "Avatar 3 Box Office Surpasses Rs 150 Crore Amidst Bollywood Fever",
            "summary": "James Cameron's sci-fi epic 'Avatar 3' has continued its strong run at the Indian box office, crossing Rs 150 crore on Day 13. The film's performance remains robust even amidst the 'Dhurandhar' fever, showcasing the sustained appeal of Hollywood blockbusters in India.",
            "key_points": [
                "'Avatar 3' has collected over Rs 150 crore at the Indian box office by Day 13.",
                "The film demonstrates strong performance despite competition from major Bollywood releases.",
                "It reaffirms the significant market for Hollywood films in India."
            ]
        },
        {
            "headline": "Actor Isiah Whitlock Jr. of 'The Wire' and 'Veep' Dies at 71",
            "summary": "Acclaimed actor Isiah Whitlock Jr., known for his memorable roles in 'The Wire' and 'Veep,' has passed away at the age of 71. His death marks the loss of a distinctive talent celebrated for his character portrayals across television and film.",
            "key_points": [
                "Isiah Whitlock Jr., famed for 'The Wire' and 'Veep,' died at 71.",
                "He was a celebrated actor with distinctive character portrayals.",
                "His passing is a loss to the acting community and fans."
            ]
        },
        {
            "headline": "KBC17: Biplab Biswas Wins Rs 1 Crore, Kumar Mangalam Birla Shares Family Ties",
            "summary": "On Kaun Banega Crorepati Season 17, Biplab Biswas won Rs 1 crore, astonishing host Amitabh Bachchan with his knowledge. In another segment, industrialist Kumar Mangalam Birla discussed his close family ties with Ratan Tata, offering a rare glimpse into the personal lives of prominent business figures on the popular game show.",
            "key_points": [
                "Biplab Biswas won Rs 1 crore on KBC17, making headlines with his achievement.",
                "Kumar Mangalam Birla appeared on the show, discussing his family connections with Ratan Tata.",
                "KBC continues to generate interest with big winners and insights from celebrity guests."
            ]
        }
    ],
    "Sports": [
        {
            "headline": "Indian Cricket Stars in Focus: Tendulkar's Pick, Dhoni's Promotion, and Sarfaraz's Performance",
            "summary": "Indian cricket remains a hot topic with Sachin Tendulkar revealing his favorite out of 201 wickets, and shedding light on why MS Dhoni was promoted over Yuvraj Singh. Meanwhile, Sarfaraz Khan has been consistently performing, smashing back-to-back tons and sending a strong message to national selectors.",
            "key_points": [
                "Sachin Tendulkar shared his preferred wicket out of his 201 career dismissals.",
                "The legendary batsman also explained the tactical decision to promote MS Dhoni over Yuvraj Singh.",
                "Sarfaraz Khan has impressed with consecutive centuries, pushing for national team selection.",
                "Other updates include Hanuma Vihari joining Tripura and KCL thrillers featuring Sanju Samson's century."
            ]
        },
        {
            "headline": "Neeraj Chopra's Diamond League Final Preview, PM Modi on Chess Growth",
            "summary": "Indian athletics star Neeraj Chopra's event preview for the Diamond League Final is highly anticipated, with details on broadcast in India. Concurrently, Prime Minister Narendra Modi has highlighted the growing popularity of chess among Indian youth during the FIDE World Cup in India, underscoring the sport's rising profile.",
            "key_points": [
                "Neeraj Chopra is set to compete in the Diamond League Final, with high expectations from India.",
                "PM Modi commented on chess's increasing popularity among Indian youth during the FIDE World Cup.",
                "These events highlight India's presence and growing interest in global sports arenas."
            ]
        },
        {
            "headline": "NBA Injury Update: Damian Lillard Optimistic on Achilles Recovery",
            "summary": "NBA fans received encouraging news regarding Damian Lillard's Achilles recovery, with the star player expressing optimism about his return to play. His potential availability for the upcoming game against the Oklahoma City Thunder is eagerly awaited, signaling a positive turn for his team.",
            "key_points": [
                "Damian Lillard shows encouraging signs of recovery from his Achilles injury.",
                "The NBA star is optimistic about playing against the Oklahoma City Thunder.",
                "His potential return is a significant boost for his team's performance."
            ]
        },
        {
            "headline": "AFCON 2025: Nigeria Achieves Perfect Run as Knockout Picture Sharpens",
            "summary": "Nigeria has demonstrated a perfect performance in the AFCON 2025 tournament, solidifying its position as a strong contender. As the group stages conclude, the knockout picture is rapidly sharpening, with teams vying for advancement in the prestigious African football competition.",
            "key_points": [
                "Nigeria has maintained an unbeaten record in AFCON 2025.",
                "The tournament is progressing to the knockout stages.",
                "Teams are intensifying their efforts to secure their spots in the next round."
            ]
        }
    ],
    "Science": [
        {
            "headline": "India Successfully Saves Tigers, Now Confronts Habitat Crunch",
            "summary": "India has achieved significant success in tiger conservation efforts, leading to a substantial increase in their population. However, this success now presents a new challenge: big cats are rapidly running out of room, necessitating innovative strategies for habitat expansion and human-wildlife coexistence.",
            "key_points": [
                "India has successfully boosted its tiger population through conservation programs.",
                "The increased tiger numbers are now facing a shortage of habitat space.",
                "New strategies are required to manage growing tiger populations and prevent human-wildlife conflict."
            ]
        },
        {
            "headline": "Rosatom Delivers First Fuel Batch for Kudankulam Nuclear Power Plant Unit 3",
            "summary": "Rosatom, Russia's state nuclear energy corporation, has completed the delivery of the first batch of nuclear fuel for Unit 3 of the Kudankulam Nuclear Power Plant in India. This marks a critical step forward in the operational readiness and expansion of India's nuclear energy program, ensuring future power generation capacity.",
            "key_points": [
                "Rosatom supplied the initial fuel batch for Kudankulam Nuclear Power Plant's Unit 3.",
                "This delivery is crucial for advancing India's nuclear energy capabilities.",
                "It supports the ongoing expansion and operational readiness of the power plant."
            ]
        },
        {
            "headline": "AI Study Shows Promise in Transforming Multiple Sclerosis Treatment",
            "summary": "A new AI-powered study holds significant promise for changing the landscape of multiple sclerosis (MS) treatment. Researchers believe this breakthrough could lead to more personalized and effective therapeutic approaches, potentially improving outcomes for patients worldwide.",
            "key_points": [
                "An AI-driven study offers a potential breakthrough in treating multiple sclerosis.",
                "The research could lead to more tailored and effective treatment options.",
                "This development highlights AI's growing impact in medical science and patient care."
            ]
        },
        {
            "headline": "Space Missions in 2026 Target Moon, Mercury, and Earth's Magnetosphere",
            "summary": "The year 2026 is set to be a busy one for space exploration, with several ambitious missions targeting key celestial bodies and phenomena. Upcoming endeavors include probes aimed at the Moon, Mercury, and detailed studies of Earth's magnetosphere, promising new insights into our solar system and planetary science.",
            "key_points": [
                "Multiple space missions are planned for 2026.",
                "Key targets include the Moon, Mercury, and Earth's magnetosphere.",
                "These missions aim to expand our understanding of the solar system and fundamental planetary science."
            ]
        }
    ],
    "Health": [
        {
            "headline": "Delhi Starts 2026 with 'Very Poor' AQI at 372, Anand Vihar Worst Hit",
            "summary": "Delhi ushered in 2026 with 'very poor' air quality, recording an Air Quality Index (AQI) of 372, with Anand Vihar being the worst-hit area. This persistent issue raises serious health concerns for residents, highlighting the ongoing challenge of air pollution in the capital.",
            "key_points": [
                "Delhi recorded a 'very poor' AQI of 372 on January 1, 2026.",
                "Anand Vihar was identified as the most polluted area.",
                "The ongoing high pollution levels pose significant health risks to the city's inhabitants."
            ]
        },
        {
            "headline": "Contaminated Indore Tap Water Kills Seven, Hospitalizes 162",
            "summary": "Tragedy struck Indore as contaminated tap water led to the deaths of seven individuals and the hospitalization of 162 others. The incident underscores critical public health infrastructure failures and the urgent need for improved water safety measures to prevent such outbreaks.",
            "key_points": [
                "Seven people died due to contaminated tap water in Indore.",
                "An additional 162 individuals were hospitalized as a result.",
                "The incident highlights severe public health and water safety concerns."
            ]
        },
        {
            "headline": "Govt Bans High-Dose Nimesulide Painkiller Pills Citing Health Risk",
            "summary": "The Indian government has banned high-dose nimesulide painkiller pills, citing significant health risks associated with their use. This regulatory action is aimed at protecting public health by removing potentially harmful pharmaceutical products from the market.",
            "key_points": [
                "High-dose nimesulide painkiller pills have been banned by the government.",
                "The decision was made due to identified health risks.",
                "This measure aims to safeguard public health and ensure drug safety."
            ]
        },
        {
            "headline": "India's Salt Addiction Fuels Stroke Vulnerability, Demands Stronger Iron-Deficiency Response",
            "summary": "India's prevalent salt addiction is significantly contributing to increased vulnerability to strokes across the population. Concurrently, experts highlight the urgent need for a stronger national response to combat iron-deficiency, a widespread health issue impacting millions.",
            "key_points": [
                "High salt consumption in India is increasing the risk of strokes.",
                "There is a critical need for enhanced national strategies to address iron-deficiency.",
                "Both issues represent major public health challenges requiring immediate intervention and awareness."
            ]
        },
        {
            "headline": "Heart Attacks Aren’t Always Sudden – The Heart Warns You Days Before",
            "summary": "Contrary to popular belief, heart attacks are not always sudden events, with the heart often providing warning signs days or even weeks in advance. Recognizing these subtle symptoms can be crucial for early intervention and potentially life-saving medical attention.",
            "key_points": [
                "Heart attacks frequently present warning signs before a major event.",
                "Symptoms can appear days or weeks in advance.",
                "Early recognition of these signs is vital for timely medical intervention."
            ]
        },
        {
            "headline": "Canadian Physician Criticizes Blame on Doctors for Indian-Origin Patient Death",
            "summary": "A Canadian physician has criticized the tendency to blame duty doctors for the death of an Indian-origin man who died waiting at the ER, describing it as 'fighting forest fires with a garden hose.' This highlights systemic issues within the healthcare system rather than individual fault.",
            "key_points": [
                "A Canadian physician defended duty doctors after an Indian-origin man died in the ER.",
                "The doctor likened the situation to 'fighting forest fires with a garden hose,' pointing to systemic healthcare issues.",
                "The incident underscores challenges in emergency care access and resource allocation in Canada."
            ]
        }
    ]
}