{
    "World": [
        {
            "headline": "'Merry Christmas to all': US releases footage of strikes against ISIS in Nigeria - watch",
            "summary": "The US military released footage of recent airstrikes against ISIS targets in Nigeria, framing it as a \"Merry Christmas\" message to the terrorist group. These strikes are part of ongoing efforts to combat extremist groups in the region, aiming to degrade their capabilities and protect civilian populations.",
            "key_points": [
                "US military conducted airstrikes against ISIS in Nigeria.",
                "Footage was released with a \"Merry Christmas\" message.",
                "Part of broader efforts to counter terrorism."
            ]
        },
        {
            "headline": "Putin’s ‘Xmas Hellfire’ Pounds Ukraine: 130+ Russian Drones DESTROY Kharkiv Market; Oil Refinery Hit",
            "summary": "Russia launched over 130 drones in a major Christmas assault on Ukraine, targeting a market in Kharkiv and an oil refinery. This extensive drone attack signifies a significant escalation in hostilities, causing widespread destruction and disruption in key Ukrainian areas.",
            "key_points": [
                "Russia launched over 130 drones against Ukraine on Christmas.",
                "Targets included Kharkiv market and an oil refinery.",
                "The attacks caused significant destruction."
            ]
        },
        {
            "headline": "Yemen War Implodes: Saudi Turns On UAE-Backed Forces; MBS Orders Withdrawal, Warns Of Consequences",
            "summary": "The Yemen conflict is reportedly imploding as Saudi Arabia has turned against UAE-backed forces, with Crown Prince Mohammed bin Salman ordering a withdrawal and issuing warnings. This development indicates a significant shift in alliances and strategies within the protracted civil war, potentially reshaping the regional power dynamics.",
            "key_points": [
                "Saudi Arabia has turned against UAE-backed forces in Yemen.",
                "Crown Prince MBS ordered a withdrawal of Saudi forces.",
                "This marks a major shift in the Yemen conflict's dynamics."
            ]
        },
        {
            "headline": "US Vs Venezuela Oil War Heats Up: Putin's Chilling Warning To 'PIRATE' Trump | 'Don't Threaten...'",
            "summary": "The oil conflict between the US and Venezuela is intensifying, with Russian President Putin issuing a stark warning to former US President Trump. Putin's comments underscore rising geopolitical tensions over oil resources and the potential for international confrontation.",
            "key_points": [
                "US-Venezuela oil conflict is escalating.",
                "Putin issued a warning to Trump regarding Venezuela.",
                "Highlights growing geopolitical tensions over oil."
            ]
        },
        {
            "headline": "Epstein Recorded Trump & Clinton’s Compromising Videos? Epstein Files Reveal Disturbing Claims",
            "summary": "Newly revealed Epstein files contain disturbing claims that Jeffrey Epstein recorded compromising videos of prominent figures including Donald Trump and Bill Clinton. These revelations add a new layer of scandal to the ongoing Epstein saga, raising questions about potential blackmail and the involvement of powerful individuals.",
            "key_points": [
                "Epstein files suggest compromising videos of Trump and Clinton.",
                "Revelations point to potential blackmail and powerful involvement.",
                "Adds new dimensions to the Epstein scandal."
            ]
        },
        {
            "headline": "Labelled Bangladeshi, youth lynched in Odisha, claim kin; police cite monetary dispute",
            "summary": "A youth was lynched in Odisha, with his kin alleging he was targeted after being labelled Bangladeshi. Police, however, claim the incident stemmed from a monetary dispute, initiating an investigation into the conflicting narratives. The case highlights tensions around identity and potential xenophobia.",
            "key_points": [
                "Youth lynched in Odisha, allegedly due to being labelled Bangladeshi.",
                "Police are investigating, citing a monetary dispute as a possible cause.",
                "The incident raises concerns about identity-based violence."
            ]
        },
        {
            "headline": "US visa holders face new uncertainty as ‘prudential’ revocations spike; anxiety looms large across Indian diaspora",
            "summary": "US visa holders, particularly within the Indian diaspora, are experiencing heightened anxiety due to a surge in 'prudential' visa revocations. This policy, allowing revocations based on vague security concerns, creates significant uncertainty and disrupts lives, despite holders having valid visas.",
            "key_points": [
                "US visa revocations are increasing under 'prudential' policy.",
                "Indian diaspora is particularly affected by this uncertainty.",
                "The policy allows revocations based on broad security concerns."
            ]
        },
        {
            "headline": "US Nervous About Growing India-China Ties, Hints Pentagon Report",
            "summary": "A recent Pentagon report suggests US unease regarding the strengthening relationship between India and China. This indicates a perceived shift in regional power dynamics and potential challenges to US strategic interests in Asia.",
            "key_points": [
                "Pentagon report highlights US concern over India-China ties.",
                "Suggests a shift in Asian power dynamics.",
                "Points to potential challenges to US strategic interests."
            ]
        },
        {
            "headline": "‘Conflict Benefits No Side’: Taliban Seek Peace Amid Tensions With Pakistan",
            "summary": "Amid escalating tensions, the Taliban have expressed a desire for peace with Pakistan, stating that conflict benefits no party. This comes after recent border clashes and diplomatic strains, signaling a potential de-escalation effort from the Afghan side.",
            "key_points": [
                "Taliban are seeking peace with Pakistan.",
                "They emphasize that ongoing conflict is detrimental to both sides.",
                "Follows a period of heightened tensions and border clashes."
            ]
        }
    ],
    "Business": [
        {
            "headline": "India’s petrol pump count crosses 1 lakh, doubles in 10 years",
            "summary": "India has achieved a significant milestone, with the number of petrol pumps nationwide surpassing 100,000, effectively doubling in the past decade. This expansion reflects robust growth in the automotive sector and increasing energy demands across the country.",
            "key_points": [
                "India now has over 100,000 petrol pumps.",
                "The number has doubled in the last ten years.",
                "Indicates growth in the automotive sector and energy demand."
            ]
        },
        {
            "headline": "India faces lower job risks from AI than West: IT secretary",
            "summary": "India's IT Secretary stated that the country is less susceptible to job displacement from artificial intelligence compared to Western nations. This assessment is based on factors like a large workforce in sectors less immediately affected by automation and a different economic structure.",
            "key_points": [
                "India's IT Secretary believes India has lower AI-related job risks.",
                "Compared to Western countries, India's workforce is less vulnerable.",
                "Factors include workforce composition and economic structure."
            ]
        },
        {
            "headline": "Weight-loss therapy set to push pharma growth",
            "summary": "The burgeoning market for weight-loss therapies is projected to be a significant driver of growth in the pharmaceutical industry. New drugs and treatments are creating a substantial demand, indicating a shift in healthcare focus towards obesity management.",
            "key_points": [
                "Weight-loss therapies are a major growth driver for pharma.",
                "New drugs are creating substantial market demand.",
                "Healthcare is shifting towards obesity management."
            ]
        },
        {
            "headline": "An IPO a day in 2025, Dalal-Street mop-up at record Rs 2 lakh crore",
            "summary": "India's Dalal Street is experiencing an unprecedented surge in initial public offerings (IPOs), with a daily average of one IPO in 2025 leading to a record mop-up of Rs 2 lakh crore. This highlights a booming capital market and strong investor confidence in the Indian economy.",
            "key_points": [
                "Indian stock market saw an average of one IPO per day in 2025.",
                "Dalal Street raised a record Rs 2 lakh crore through IPOs.",
                "Reflects a booming capital market and strong investor confidence."
            ]
        },
        {
            "headline": "Ruble Roars Past the ‘Weaponized’ Dollar as Russia’s Stewardship Wins Global Confidence",
            "summary": "The Russian Ruble has demonstrated strong performance, outpacing the US dollar amidst global economic shifts, a phenomenon attributed to Russia's economic management. This strength is seen as a sign of growing global confidence in Russia's economic policies, despite international sanctions.",
            "key_points": [
                "Russian Ruble has shown strong growth against the US dollar.",
                "This performance is linked to Russia's economic stewardship.",
                "Suggests growing global confidence in Russia's economic policies."
            ]
        },
        {
            "headline": "India Gears Up for Chip Independence and Global Push: Amit Shah",
            "summary": "Home Minister Amit Shah announced India's ambitious plans to achieve independence in semiconductor manufacturing and to become a global player in chip production. This initiative is crucial for national security and economic growth, aiming to reduce reliance on foreign supply chains.",
            "key_points": [
                "India aims for self-sufficiency in semiconductor manufacturing.",
                "Goal is to become a global hub for chip production.",
                "Crucial for national security and economic independence."
            ]
        },
        {
            "headline": "Russian Economic Growth Outpaces Eurozone by Three Times: Kremlin Aide",
            "summary": "A Kremlin aide stated that Russia's economic growth rate has tripled that of the Eurozone, indicating robust performance despite international sanctions. This claim suggests a resilient Russian economy adapting to geopolitical challenges.",
            "key_points": [
                "Russia's economy grew three times faster than the Eurozone.",
                "Highlights Russia's economic resilience amidst sanctions.",
                "Challenges conventional views on the impact of international restrictions."
            ]
        }
    ],
    "Technology": [
        {
            "headline": "Consider Australia-like law to ban children under 16 from accessing social media: Madras HC",
            "summary": "The Madras High Court has suggested that the government consider implementing a law similar to Australia's, which bans children under 16 from accessing social media. This recommendation reflects growing concerns over the impact of social media on minors and calls for stricter digital protection.",
            "key_points": [
                "Madras HC suggests banning social media for under-16s.",
                "Cites Australia's law as a potential model.",
                "Aims to address concerns over social media's impact on minors."
            ]
        },
        {
            "headline": "Lost job to AI, stole Rs 16 lakh jewellery: Graphic designer, NEET-aspirant friend inspired by ‘Bunty Aur Babli’ held in Indore",
            "summary": "A graphic designer who lost his job to AI resorted to stealing Rs 16 lakh worth of jewellery with a NEET-aspirant friend, drawing inspiration from the film 'Bunty Aur Babli'. This incident highlights the socio-economic pressures of job displacement due to AI and the allure of quick wealth.",
            "key_points": [
                "Graphic designer lost job due to AI, turned to crime.",
                "Stole jewellery with a friend, inspired by a movie.",
                "Highlights potential societal impacts of AI job displacement."
            ]
        },
        {
            "headline": "Su-57's Next-Gen Engine: Should India Acquire the Stealth Fighter Now?",
            "summary": "With Russia's Su-57 stealth fighter progressing with its next-generation engine, discussions are emerging on whether India should acquire this advanced aircraft. The potential acquisition could significantly bolster India's air power and strategic capabilities, given its ongoing defense modernization.",
            "key_points": [
                "Russia's Su-57 stealth fighter is developing a new engine.",
                "Debate arises on India acquiring the advanced aircraft.",
                "Acquisition could enhance India's air power significantly."
            ]
        },
        {
            "headline": "Russia to Build High-Powered Power Plant on Moon",
            "summary": "Russia has announced ambitious plans to construct a high-powered nuclear power plant on the Moon, a move that would significantly advance lunar exploration and resource utilization. This project aims to provide sustainable energy for future lunar missions and potential settlements.",
            "key_points": [
                "Russia plans to build a high-powered nuclear power plant on the Moon.",
                "Aims to provide sustainable energy for lunar missions.",
                "Represents a significant step in lunar exploration."
            ]
        },
        {
            "headline": "ISRO Launches Heaviest Communication Satellite Yet: Bluebird Block-2",
            "summary": "The Indian Space Research Organisation (ISRO) has successfully launched its heaviest communication satellite to date, the Bluebird Block-2. This mission marks a significant achievement in India's space program, enhancing national communication capabilities and contributing to global space infrastructure.",
            "key_points": [
                "ISRO launched its heaviest communication satellite, Bluebird Block-2.",
                "Significant milestone for India's space program.",
                "Boosts national communication infrastructure."
            ]
        }
    ],
    "Entertainment": [
        {
            "headline": "'Dhurandhar' BO collection Day 21: Ranveer Singh's film gets massive boost on Christmas",
            "summary": "Ranveer Singh's film 'Dhurandhar' saw a significant jump in its box office collection on Christmas, marking a strong performance on its 21st day. The holiday season provided a massive boost, indicating continued audience interest in the movie.",
            "key_points": [
                "Ranveer Singh's 'Dhurandhar' had a strong Christmas box office performance.",
                "Film received a massive boost on its 21st day.",
                "Holiday season contributed to its sustained success."
            ]
        },
        {
            "headline": "Kaun Banega Crorepati 17: Amitabh Bachchan recalls father Shri Harivansh Rai Bachchan being questioned over Madhushala",
            "summary": "On 'Kaun Banega Crorepati 17', Amitabh Bachchan shared a personal anecdote, recalling how his father, the renowned poet Harivansh Rai Bachchan, faced questions about writing 'Madhushala' despite not drinking. This moment offered a rare glimpse into the literary and personal life of the legendary poet.",
            "key_points": [
                "Amitabh Bachchan shared a story about his father on KBC 17.",
                "Harivansh Rai Bachchan was questioned about 'Madhushala' (a poem about wine).",
                "The anecdote highlighted the poet's unique perspective."
            ]
        },
        {
            "headline": "'Akhanda 2' BO day 14: Movie earns Rs 1.65 crore",
            "summary": "Nandamuri Balakrishna's 'Akhanda 2' collected Rs 1.65 crore on its 14th day at the box office, indicating a steady performance. The film continues to draw audiences, contributing to its overall commercial run.",
            "key_points": [
                "Akhanda 2' earned Rs 1.65 crore on day 14.",
                "The film shows steady box office performance.",
                "Continues to attract viewers."
            ]
        },
        {
            "headline": "Avatar 3 BO collection Day 7: Film BENEFITS from Xmas holiday",
            "summary": "James Cameron's 'Avatar 3' saw a significant boost in its box office collections on its seventh day, largely benefiting from the Christmas holiday period. The film capitalized on the festive season, drawing in large crowds and solidifying its commercial success.",
            "key_points": [
                "Avatar 3' box office surged on its 7th day.",
                "The increase is attributed to the Christmas holiday.",
                "Film demonstrated strong commercial performance during the festive season."
            ]
        },
        {
            "headline": "Mumbai tower fire: Mary Kom producer among 40 others rescued",
            "summary": "In a fire incident at a Mumbai tower, the producer of the film 'Mary Kom' was among 40 individuals successfully rescued. Firefighters conducted a swift operation, preventing further casualties and bringing the situation under control.",
            "key_points": [
                "Fire broke out in a Mumbai residential tower.",
                "'Mary Kom' film producer was among 40 rescued.",
                "Emergency services successfully contained the fire and rescued residents."
            ]
        }
    ],
    "Sports": [
        {
            "headline": "Record! 14-year-old Vaibhav Sooryavanshi scripts history",
            "summary": "14-year-old Vaibhav Sooryavanshi has made history in the Vijay Hazare Trophy, becoming the youngest player to achieve a significant record. His remarkable performance has garnered widespread attention, marking him as a rising star in Indian cricket.",
            "key_points": [
                "Vaibhav Sooryavanshi, 14, created a new record in Vijay Hazare Trophy.",
                "He is the youngest player to achieve this feat.",
                "His performance highlights his potential in Indian cricket."
            ]
        },
        {
            "headline": "Stunning prediction! 'Shreyas Iyer can captain India to a World Cup win'",
            "summary": "A prominent cricket expert has made a bold prediction, stating that Shreyas Iyer has the potential to lead India to a World Cup victory. This forecast fuels discussions about future leadership roles and Iyer's strategic capabilities within the Indian cricket team.",
            "key_points": [
                "An expert predicts Shreyas Iyer could lead India to a World Cup win.",
                "The prediction highlights Iyer's leadership potential.",
                "Sparks debate on future captaincy for the Indian team."
            ]
        },
        {
            "headline": "Diamond League Final: Neeraj Chopra's event preview, time and live telecast in India",
            "summary": "An event preview for Neeraj Chopra's appearance at the Diamond League Final provides details on his competition, schedule, and live telecast information for Indian viewers. All eyes will be on the Olympic gold medalist as he competes on the international stage.",
            "key_points": [
                "Preview released for Neeraj Chopra's Diamond League Final event.",
                "Includes competition details, schedule, and telecast info for India.",
                "Indian viewers eagerly anticipate his performance."
            ]
        },
        {
            "headline": "FIDE WC in India: PM Modi says 'Chess is gaining popularity among our youth'",
            "summary": "During the FIDE World Cup in India, Prime Minister Modi remarked on the increasing popularity of chess among Indian youth. His statement underscores the growing interest in intellectual sports and India's rising prominence in the global chess arena.",
            "key_points": [
                "PM Modi noted the rising popularity of chess among Indian youth.",
                "Statement made during the FIDE World Cup in India.",
                "Highlights India's growing interest in intellectual sports."
            ]
        },
        {
            "headline": "Sarfaraz on fire! Back-to-back tons send strong message to selectors",
            "summary": "Sarfaraz Khan has delivered stellar performances with consecutive centuries, sending a strong message to national cricket selectors. His consistent high scores are making a compelling case for his inclusion in the senior team.",
            "key_points": [
                "Sarfaraz Khan scored back-to-back centuries.",
                "His performance sends a strong message to selectors.",
                "He is building a strong case for national team selection."
            ]
        }
    ],
    "Science": [
        {
            "headline": "MoEF told Survey of India to map Aravali hills by 100m rule",
            "summary": "The Ministry of Environment, Forest and Climate Change (MoEF) has instructed the Survey of India to map the ecologically sensitive Aravali hills, adhering to a 100-meter buffer rule. This initiative aims to better protect the crucial biodiversity and geological features of the mountain range.",
            "key_points": [
                "MoEF ordered Survey of India to map Aravali hills.",
                "Mapping must follow a 100-meter buffer rule.",
                "Aims to protect the hills' biodiversity and geology."
            ]
        },
        {
            "headline": "5 Reasons Every Bedroom Needs a Snake Plant in 2026",
            "summary": "Snake plants are gaining popularity for bedrooms in 2026 due to their numerous benefits, including air purification and low maintenance. They are lauded for improving indoor air quality, making them an ideal choice for a healthier sleeping environment.",
            "key_points": [
                "Snake plants are popular for bedrooms in 2026.",
                "Benefits include air purification and easy care.",
                "Contributes to a healthier indoor sleeping environment."
            ]
        },
        {
            "headline": "Common snakes found in Japan: Species, habitats, venomous risks, and how to stay safe",
            "summary": "An article details common snake species found in Japan, outlining their habitats, venomous risks, and safety precautions. It serves as a guide for residents and visitors to understand and avoid potential encounters with these reptiles.",
            "key_points": [
                "Guide details common snake species in Japan.",
                "Covers their habitats and venomous risks.",
                "Provides safety tips for avoiding encounters."
            ]
        }
    ],
    "Health": [
        {
            "headline": "Why so many Indians are running low on butyrate — the gut’s most important fuel",
            "summary": "Many Indians are reportedly experiencing low levels of butyrate, a crucial short-chain fatty acid essential for gut health. This deficiency can impact overall well-being, highlighting the need for dietary adjustments or supplements to maintain a healthy gut microbiome.",
            "key_points": [
                "Many Indians have low levels of butyrate, vital for gut health.",
                "Deficiency can impact overall well-being.",
                "Suggests need for dietary changes or supplements."
            ]
        },
        {
            "headline": "Are severe lung conditions in newborns always fatal? Doctors weigh in, debunk myths and share case studies",
            "summary": "Medical experts are debunking myths surrounding severe lung conditions in newborns, emphasizing that such diagnoses are not always fatal. Through case studies, doctors provide insights into advancements in neonatal care, offering hope for affected families.",
            "key_points": [
                "Doctors clarify that severe newborn lung conditions are not always fatal.",
                "They debunk common myths with case studies.",
                "Highlights advancements in neonatal care."
            ]
        },
        {
            "headline": "Why a stiffer colon is raising alarms as colorectal cancer appears earlier: How to identify it",
            "summary": "Medical professionals are expressing concern over an increasing trend of colon stiffness, which is being linked to earlier onset of colorectal cancer. Understanding how to identify symptoms early is crucial for timely diagnosis and improved treatment outcomes.",
            "key_points": [
                "Colon stiffness is increasingly linked to earlier colorectal cancer.",
                "Medical community is raising alarms about this trend.",
                "Early identification of symptoms is crucial for diagnosis."
            ]
        },
        {
            "headline": "Weight-loss drugs killed their sex life. Is there a chance it could bounce back?",
            "summary": "A significant number of individuals using weight-loss drugs are reporting a decline in their sex life, raising concerns about the side effects of these medications. Experts are exploring whether these effects are reversible and offering guidance on managing them.",
            "key_points": [
                "Weight-loss drugs are linked to a decline in sex life for some users.",
                "Concerns are growing over these side effects.",
                "Experts are researching reversibility and management strategies."
            ]
        },
        {
            "headline": "Is the water on your flight actually safe to drink? Flying, hygiene and health",
            "summary": "Concerns about the safety of drinking water on flights have emerged, prompting discussions on airline hygiene practices and passenger health. The article delves into the source and treatment of onboard water, advising travelers on precautions.",
            "key_points": [
                "Safety of drinking water on flights is a growing concern.",
                "Discussion includes airline hygiene practices and health implications.",
                "Advises passengers on precautions regarding onboard water."
            ]
        }
    ]
}