{
    "World": [
        {
            "headline": "All 7 passengers killed in Ranchi-Delhi air ambulance crash near Jharkhand’s Chatra",
            "summary": "An air ambulance carrying seven passengers from Ranchi to Delhi crashed near Chatra, Jharkhand, killing everyone on board. The aircraft lost contact with ATC 20 minutes after takeoff, and the incident is the second air ambulance crash in the region within a month.",
            "key_points": [
                "7 passengers killed in Ranchi-Delhi air ambulance crash.",
                "Crash occurred near Chatra, Jharkhand.",
                "Aircraft lost contact with ATC 20 minutes after takeoff.",
                "Second air ambulance crash in the region within a month."
            ]
        },
        {
            "headline": "‘Pressure to crack NEET’: UP teen shoots father, chops body parts in front of sister",
            "summary": "A 19-year-old in Lucknow allegedly shot and dismembered his father after a dispute over NEET pressure. He initially filed a missing person report but was caught by police while attempting to dispose of body parts, with the investigation ongoing.",
            "key_points": [
                "Lucknow teen shot and dismembered his father.",
                "Motive linked to pressure over NEET exams.",
                "Police apprehended the teen while disposing of body parts.",
                "Investigation is ongoing, searching for missing remains."
            ]
        },
        {
            "headline": "Mosque at Bhojshala built using parts of ancient temples: ASI",
            "summary": "An Archaeological Survey of India (ASI) report, submitted to the MP High Court, concludes that the Kamal Maula Mosque at Bhojshala was constructed using components from ancient temples. Scientific investigations show the Paramara dynasty structure incorporates dismantled temple remains.",
            "key_points": [
                "ASI report states Kamal Maula Mosque at Bhojshala was built using ancient temple parts.",
                "Report submitted to MP High Court.",
                "Scientific investigations support the finding.",
                "Court has directed parties to file objections."
            ]
        },
        {
            "headline": "Tyson: 4-legged hero who led anti-terror op in J&K despite taking bullet",
            "summary": "An Army dog named Tyson played a heroic role in an anti-terror operation in J&K's Kishtwar, sustaining a leg injury but enabling security forces to neutralize three Jaish-e-Mohammed militants. 'Operation Trashi-1' was a culmination of months of planning and inter-agency coordination.",
            "key_points": [
                "Army dog Tyson injured during anti-terror operation in J&K.",
                "Led forces to neutralize three Jaish-e-Mohammed militants.",
                "Operation 'Trashi-1' involved extensive planning and coordination."
            ]
        },
        {
            "headline": "Ukraine's envoy writes: 'Russia choked off its own future. So it went to war'",
            "summary": "On the 4th anniversary of the war, Ukraine's envoy asserts that Russia's actions have 'embittered hearts for generations.' This statement reflects the deep-seated resentment and long-term impact of the conflict.",
            "key_points": [
                "Ukrainian envoy states Russia 'choked off its own future' by going to war.",
                "Statement made on the 4th anniversary of the conflict.",
                "Highlights the long-lasting bitterness caused by Russia's actions."
            ]
        },
        {
            "headline": "'Prahaar': India unveils its first-ever counter-terrorism policy",
            "summary": "India has launched 'Prahaar', its inaugural anti-terror policy, adopting a proactive and intelligence-led approach. This doctrine addresses threats from hostile neighbors and modern challenges, emphasizing prevention, swift response, capacity building, international cooperation, and human rights.",
            "key_points": [
                "India launches 'Prahaar', its first anti-terror policy.",
                "Adopts proactive, intelligence-led strategy.",
                "Addresses threats from hostile neighbors and modern challenges like encrypted communication.",
                "Emphasizes prevention, swift response, capacity building, and international cooperation."
            ]
        },
        {
            "headline": "Taking cue from Devji, more cadres may shun Maoist ideology, join mainstream",
            "summary": "Several top CPI(Maoist) leaders, including Devji and Sangram, are expected to surrender, dealing a significant blow to the organization. This trend follows other key surrenders and suggests a pragmatic shift away from ideology, potentially encouraging more cadres to follow suit.",
            "key_points": [
                "Top CPI(Maoist) leaders, including Devji, expected to surrender.",
                "Signals a significant blow to the Maoist organization.",
                "Part of a trend of key figures joining the mainstream.",
                "Suggests a pragmatic shift away from Maoist ideology."
            ]
        },
        {
            "headline": "India tells citizens to leave Iran by all available means",
            "summary": "India has advised its citizens to leave Iran immediately using all available transportation methods. This advisory comes amid rising tensions and potential instability in the region.",
            "key_points": [
                "India issued an advisory for its citizens to leave Iran.",
                "Citizens urged to use all available means for departure.",
                "Comes amidst rising tensions in the region."
            ]
        },
        {
            "headline": "After 33-hour Mumbai-Pune expressway chaos, 1 lakh motorists to get Rs 5.16 crore toll refund",
            "summary": "Following 33 hours of chaos on the Mumbai-Pune expressway, approximately 1 lakh motorists are eligible for a Rs 5.16 crore toll refund. This compensation addresses the significant inconvenience caused by the prolonged disruption.",
            "key_points": [
                "1 lakh motorists to receive Rs 5.16 crore toll refund.",
                "Follows 33 hours of chaos on Mumbai-Pune expressway.",
                "Compensation for prolonged disruption."
            ]
        },
        {
            "headline": "She vanished before Christmas 24 years ago: North Carolina mother of three found alive living a secret new life",
            "summary": "A North Carolina mother of three, who disappeared 24 years ago before Christmas, has been found alive. She had been living a secret new life, the details of which are still emerging.",
            "key_points": [
                "North Carolina mother missing for 24 years found alive.",
                "She had vanished before Christmas.",
                "Found living a secret new life."
            ]
        },
        {
            "headline": "Indian-origin man jailed in US over false kidnapping charges files lawsuit",
            "summary": "An Indian-origin man, unjustly jailed in the US on false kidnapping charges, has filed a lawsuit seeking redress. His legal action aims to challenge the wrongful incarceration and seek justice for the ordeal.",
            "key_points": [
                "Indian-origin man jailed in US on false kidnapping charges.",
                "Files lawsuit seeking redress.",
                "Aims to challenge wrongful incarceration and seek justice."
            ]
        },
        {
            "headline": "Indian man killed in targeted firing Canada outside busy Toronto mall, cops clueless about shooters",
            "summary": "An Indian man was killed in a targeted shooting outside a busy Toronto mall in Canada, with police currently having no leads on the assailants. The incident has raised concerns about safety and ongoing investigations are underway.",
            "key_points": [
                "Indian man killed in targeted shooting in Toronto, Canada.",
                "Incident occurred outside a busy mall.",
                "Police currently have no leads on the shooters.",
                "Raises concerns about safety and ongoing investigations."
            ]
        },
        {
            "headline": "Jobless Indian-origin woman fined over Rs 2 lakh for feeding pigeons in Singapore",
            "summary": "A jobless Indian-origin woman in Singapore has been fined over Rs 2 lakh for feeding pigeons, an offense under local regulations. The incident highlights strict environmental rules and the consequences of non-compliance.",
            "key_points": [
                "Jobless Indian-origin woman fined over Rs 2 lakh in Singapore.",
                "Fined for feeding pigeons, an offense under local rules.",
                "Highlights strict environmental regulations and consequences."
            ]
        },
        {
            "headline": "'15 of my cousins came here on H-1B': Indian-origin CEO shuts down troll, says his family paid millions in taxes in US",
            "summary": "An Indian-origin CEO publicly responded to a troll, stating that 15 of his cousins came to the US on H-1B visas and his family has paid millions in taxes. His response defends the contributions of immigrants and counters negative stereotypes.",
            "key_points": [
                "Indian-origin CEO responded to a troll about H-1B visas.",
                "Stated 15 of his cousins came on H-1B.",
                "Highlighted his family paid millions in US taxes.",
                "Defends immigrant contributions against negative stereotypes."
            ]
        },
        {
            "headline": "Russia Drones, Ballistic Missiles Burn Ukraine’s Energy Infrastructure In Kyiv, Other Cities",
            "summary": "Russian forces have launched drone and ballistic missile attacks, severely damaging Ukraine's energy infrastructure in Kyiv and other cities. These strikes aim to cripple Ukraine's ability to sustain operations and civilian life.",
            "key_points": [
                "Russian forces attacked Ukraine's energy infrastructure.",
                "Used drones and ballistic missiles.",
                "Caused damage in Kyiv and other cities.",
                "Aims to cripple Ukraine's sustainability."
            ]
        },
        {
            "headline": "Inquiry into Tirupati laddu: Supreme Court declines Subramanian Swamy's plea",
            "summary": "The Supreme Court has declined Subramanian Swamy's plea for an inquiry into the Tirupati laddu. This decision concludes a legal attempt to investigate matters related to the popular temple offering.",
            "key_points": [
                "Supreme Court declined Subramanian Swamy's plea.",
                "Plea was for an inquiry into Tirupati laddu.",
                "Concludes legal attempt to investigate the temple offering."
            ]
        },
        {
            "headline": "Eye on boosting ties, Canada PM to embark on India visit from Feb 26",
            "summary": "The Canadian Prime Minister is scheduled to visit India starting February 26, with an aim to strengthen bilateral ties. This visit is expected to involve discussions on various areas of cooperation between the two nations.",
            "key_points": [
                "Canadian PM to visit India from Feb 26.",
                "Aims to boost bilateral ties.",
                "Discussions expected on various cooperation areas."
            ]
        },
        {
            "headline": "No crash of LCA, just a minor incident, analysing issue: HAL",
            "summary": "Hindustan Aeronautics Limited (HAL) clarified that there was no crash of an LCA, but rather a minor incident, which is currently under analysis. This statement seeks to allay concerns and provides an update on the status of the aircraft.",
            "key_points": [
                "HAL clarified no LCA crash, but a minor incident.",
                "Issue is currently under analysis.",
                "Statement aims to allay concerns."
            ]
        },
        {
            "headline": "Political messaging behind timing of installation of Rajaji’s bust?",
            "summary": "The article questions whether there is political messaging behind the timing of the installation of Rajaji’s bust. This inquiry delves into potential political motivations and symbolic significance.",
            "key_points": [
                "Questions political messaging behind timing of Rajaji’s bust installation.",
                "Inquires into potential political motivations.",
                "Explores symbolic significance."
            ]
        },
        {
            "headline": "IMD weather update: Which Indian states will see rain and thunderstorms this week?",
            "summary": "The Indian Meteorological Department (IMD) has provided a weather update, detailing which Indian states are expected to experience rain and thunderstorms this week. This forecast is crucial for regional planning and public awareness.",
            "key_points": [
                "IMD provided weather update for Indian states.",
                "Details expected rain and thunderstorms this week.",
                "Crucial for regional planning and public awareness."
            ]
        },
        {
            "headline": "Indian Navy to Commission Third Anti-Submarine Warfare Shallow Water Craft",
            "summary": "The Indian Navy is set to commission its third Anti-Submarine Warfare Shallow Water Craft, enhancing its coastal defense capabilities. This addition reinforces India's naval strength and surveillance in shallow waters.",
            "key_points": [
                "Indian Navy to commission its third Anti-Submarine Warfare Shallow Water Craft.",
                "Enhances coastal defense capabilities.",
                "Reinforces naval strength and shallow water surveillance."
            ]
        },
        {
            "headline": "Russia’s Advanced Military Equipment Will Remain Secure and Well Managed: Putin",
            "summary": "President Putin stated that Russia's advanced military equipment will be securely managed and maintained. This assurance comes amidst ongoing geopolitical tensions, reaffirming Russia's military preparedness.",
            "key_points": [
                "Putin assures secure management of Russia's advanced military equipment.",
                "Statement amidst geopolitical tensions.",
                "Reaffirms Russia's military preparedness."
            ]
        },
        {
            "headline": "The New START Treaty: The US-Russia Path to Nuclear Limits",
            "summary": "The New START Treaty outlines the path for the US and Russia to limit their nuclear arsenals, serving as a cornerstone of international arms control. Its principles guide efforts to prevent nuclear proliferation and maintain strategic stability.",
            "key_points": [
                "New START Treaty guides US-Russia nuclear limits.",
                "Cornerstone of international arms control.",
                "Aims to prevent nuclear proliferation and maintain stability."
            ]
        },
        {
            "headline": "Russian Air Defenses Destroy 152 Ukrainian Drones",
            "summary": "Russian air defenses reportedly destroyed 152 Ukrainian drones, indicating continued aerial engagements in the ongoing conflict. This report highlights the intensity of the drone warfare and Russia's defensive capabilities.",
            "key_points": [
                "Russian air defenses destroyed 152 Ukrainian drones.",
                "Indicates continued aerial engagements in conflict.",
                "Highlights intensity of drone warfare."
            ]
        },
        {
            "headline": "US Ready to Hold New Nuclear Talks With Iran on Friday If Receives Deal Proposal: Reports",
            "summary": "Reports indicate that the US is prepared to engage in new nuclear talks with Iran on Friday, provided a deal proposal is received. This development signals a potential diplomatic pathway to address nuclear concerns.",
            "key_points": [
                "US ready for new nuclear talks with Iran on Friday.",
                "Conditioned on receiving a deal proposal.",
                "Signals potential diplomatic pathway to address nuclear concerns."
            ]
        },
        {
            "headline": "Afghanistan Vows Measured Response to Pakistan's Airstrikes: Defense Ministry",
            "summary": "Afghanistan's Defense Ministry has pledged a 'measured response' to recent Pakistani airstrikes, signaling rising cross-border tensions. This development could escalate regional instability if not handled carefully.",
            "key_points": [
                "Afghanistan vows 'measured response' to Pakistan's airstrikes.",
                "Signals rising cross-border tensions.",
                "Could escalate regional instability."
            ]
        },
        {
            "headline": "Witkoff Promises Good News on Ukrainian Settlement in Coming Weeks",
            "summary": "Witkoff has promised positive developments regarding a Ukrainian settlement in the coming weeks. This statement suggests potential progress toward resolving the conflict through negotiations.",
            "key_points": [
                "Witkoff promises good news on Ukrainian settlement.",
                "Expected in the coming weeks.",
                "Suggests potential progress towards resolving conflict."
            ]
        },
        {
            "headline": "West, Global Corporations Now Control Nearly All Ukrainian Assets: Ex-PM",
            "summary": "A former Ukrainian Prime Minister claims that Western nations and global corporations now control almost all of Ukraine's assets. This assertion raises concerns about national sovereignty and economic influence.",
            "key_points": [
                "Ex-Ukrainian PM claims West and global corporations control nearly all Ukrainian assets.",
                "Raises concerns about national sovereignty.",
                "Highlights economic influence."
            ]
        },
        {
            "headline": "Indian PM Modi Meets Brazil's President Lula da Silva in Delhi",
            "summary": "Indian Prime Minister Modi held a meeting with Brazil's President Lula da Silva in Delhi. This bilateral engagement aims to strengthen ties and discuss areas of mutual cooperation between the two nations.",
            "key_points": [
                "Indian PM Modi met Brazil's President Lula da Silva in Delhi.",
                "Aims to strengthen bilateral ties.",
                "Discussed areas of mutual cooperation."
            ]
        },
        {
            "headline": "Russia, China, Iran Stressed Importance of Political Solution to Iran Issue",
            "summary": "Russia, China, and Iran collectively emphasized the necessity of a political resolution to the ongoing issues concerning Iran. Their joint stance highlights diplomatic efforts to de-escalate tensions and promote regional stability.",
            "key_points": [
                "Russia, China, Iran stressed political solution for Iran issue.",
                "Highlights diplomatic efforts to de-escalate tensions.",
                "Aims to promote regional stability."
            ]
        },
        {
            "headline": "At Least 11 People Injured in Ukrainian Drone Attack in Russia's Udmurtia: Regional Health Ministry",
            "summary": "The Regional Health Ministry reported that at least 11 people were injured in a Ukrainian drone attack in Russia's Udmurtia. This incident underscores the continued human cost and territorial reach of the conflict.",
            "key_points": [
                "11 people injured in Ukrainian drone attack in Russia's Udmurtia.",
                "Reported by Regional Health Ministry.",
                "Highlights human cost and territorial reach of conflict."
            ]
        },
        {
            "headline": "What New Bangladesh Government Means for India?",
            "summary": "This article analyzes the potential implications of the new Bangladesh government for India, exploring how diplomatic relations, economic ties, and regional stability might be affected. It examines the strategic outlook for bilateral engagements.",
            "key_points": [
                "Analyzes implications of new Bangladesh government for India.",
                "Explores impact on diplomatic relations, economic ties, and regional stability.",
                "Examines strategic outlook for bilateral engagements."
            ]
        },
        {
            "headline": "Russian Forces Hit Ukrainian Military Facilities With Precision Weapons Seven Times This Week",
            "summary": "Russian forces have reportedly struck Ukrainian military facilities with precision weapons seven times this week, according to official reports. These targeted attacks continue to degrade Ukraine's military infrastructure.",
            "key_points": [
                "Russian forces hit Ukrainian military facilities seven times this week.",
                "Used precision weapons.",
                "Continues to degrade Ukraine's military infrastructure."
            ]
        },
        {
            "headline": "Ukrainian Military Lost 1.5M Since 2022",
            "summary": "This report claims the Ukrainian military has suffered 1.5 million casualties since 2022. The staggering figure highlights the severe human cost of the ongoing conflict, though specific verification may be required.",
            "key_points": [
                "Ukrainian military reportedly lost 1.5 million personnel since 2022.",
                "Highlights severe human cost of ongoing conflict.",
                "Verification of figures may be required."
            ]
        },
        {
            "headline": "Russia's Latest Weapons That Put World on Edge",
            "summary": "This article explores Russia's latest weapon systems, detailing advancements that have garnered international attention and raised global concerns. It highlights their strategic implications and impact on military balances.",
            "key_points": [
                "Explores Russia's latest weapon systems.",
                "Details advancements that cause global concern.",
                "Highlights strategic implications and impact on military balances."
            ]
        },
        {
            "headline": "Cuba Faces Growing Pressure as US Escalates Blockade and Oil Seizures",
            "summary": "Cuba is experiencing increased pressure as the US intensifies its blockade and expands oil seizures. These actions exacerbate Cuba's economic challenges and further strain international relations.",
            "key_points": [
                "Cuba under growing pressure from intensified US blockade.",
                "US escalating oil seizures.",
                "Exacerbates Cuba's economic challenges.",
                "Further strains international relations."
            ]
        },
        {
            "headline": "Attack on Russian General is Ukrainian Attempt to Sabotage Negotiations: Expert",
            "summary": "An expert suggests that an attack on a Russian General was a Ukrainian attempt to derail ongoing negotiations. This interpretation highlights the complex and often contentious dynamics of peace talks amidst conflict.",
            "key_points": [
                "Expert claims attack on Russian General was Ukrainian attempt to sabotage negotiations.",
                "Highlights complex dynamics of peace talks amidst conflict."
            ]
        },
        {
            "headline": "France, UK Should Be Included if Russia-US Arms Control Extends to China: Expert",
            "summary": "An expert argues that France and the UK should be included in arms control discussions if Russia-US agreements are extended to include China. This suggests a need for a broader multilateral approach to global arms control.",
            "key_points": [
                "Expert argues for inclusion of France and UK in arms control talks.",
                "If Russia-US agreements extend to China.",
                "Suggests broader multilateral approach."
            ]
        },
        {
            "headline": "Potential US Intervention in Iran: Implications for India",
            "summary": "This article explores the potential implications for India of a hypothetical US intervention in Iran. It analyzes the possible impacts on India's energy security, regional stability, and geopolitical standing.",
            "key_points": [
                "Explores implications for India of potential US intervention in Iran.",
                "Analyzes impacts on India's energy security.",
                "Considers regional stability and geopolitical standing."
            ]
        },
        {
            "headline": "India's Defence Budget Rises by 15%: What Does it Mean for Indian Military?",
            "summary": "India's defense budget has increased by 15%, prompting analysis of its implications for the Indian military. This rise is expected to boost modernization efforts, enhance procurement, and strengthen national security capabilities.",
            "key_points": [
                "India's defense budget increased by 15%.",
                "Analyzes implications for the Indian military.",
                "Expected to boost modernization, procurement, and national security."
            ]
        },
        {
            "headline": "Is the Future of NATO in Jeopardy?",
            "summary": "This article debates whether the future of NATO is currently at risk, examining internal divisions, geopolitical shifts, and challenges to its collective defense mandate. It explores various perspectives on the alliance's durability.",
            "key_points": [
                "Debates future of NATO.",
                "Examines internal divisions and geopolitical shifts.",
                "Challenges to collective defense mandate."
            ]
        },
        {
            "headline": "Macron Has Lost His Influence Over France: Expert",
            "summary": "An expert suggests that President Macron's influence over France has waned, analyzing factors contributing to a decline in his political authority. This assessment provides insight into the current political landscape of France.",
            "key_points": [
                "Expert suggests Macron lost influence over France.",
                "Analyzes factors for decline in political authority.",
                "Provides insight into France's political landscape."
            ]
        },
        {
            "headline": "Russian Air Defense Destroys 113 Ukrainian Drones Last Night: MoD",
            "summary": "Russia's Ministry of Defense reported that its air defense systems destroyed 113 Ukrainian drones overnight. This signifies ongoing aerial combat and Russia's active defense against drone attacks.",
            "key_points": [
                "Russian MoD reports destruction of 113 Ukrainian drones overnight.",
                "Signifies ongoing aerial combat.",
                "Highlights active defense against drone attacks."
            ]
        },
        {
            "headline": "Ukraine Talks in Geneva Were Difficult, But Businesslike: Russian Delegation Head Medinsky",
            "summary": "The head of the Russian delegation, Medinsky, described the Ukraine talks in Geneva as difficult but businesslike, indicating a pragmatic approach despite challenges. This suggests a willingness to engage in dialogue, albeit with firm positions.",
            "key_points": [
                "Russian delegation head described Ukraine talks in Geneva as difficult but businesslike.",
                "Indicates pragmatic approach despite challenges.",
                "Suggests willingness for dialogue with firm positions."
            ]
        },
        {
            "headline": "Russia Repeatedly Proved It Seeks Peace: Russian FM Spox on Geneva Talks",
            "summary": "Russia's Foreign Ministry Spokesperson asserted that Russia has consistently demonstrated its commitment to peace during the Geneva talks. This statement aims to project a diplomatic image amidst the ongoing conflict.",
            "key_points": [
                "Russian FM Spox claims Russia seeks peace during Geneva talks.",
                "Aims to project a diplomatic image.",
                "Amidst ongoing conflict."
            ]
        },
        {
            "headline": "At Least 20 Canadian Mercenaries Killed in Ukraine Since 2022: Reports",
            "summary": "Reports indicate that at least 20 Canadian mercenaries have been killed in Ukraine since 2022. This figure highlights the international involvement in the conflict and the risks faced by foreign combatants.",
            "key_points": [
                "Reports claim 20+ Canadian mercenaries killed in Ukraine since 2022.",
                "Highlights international involvement in the conflict.",
                "Shows risks faced by foreign combatants."
            ]
        },
        {
            "headline": "Why Zelensky's War of Words With Orban Won’t Boost Ukraine's EU Ambitions",
            "summary": "This analysis explains why President Zelensky's public disagreements with Hungarian Prime Minister Orban are unlikely to advance Ukraine's ambitions for EU membership. The ongoing friction highlights political obstacles within the bloc.",
            "key_points": [
                "Explains why Zelensky-Orban disputes hinder Ukraine's EU ambitions.",
                "Highlights political obstacles within the EU bloc."
            ]
        },
        {
            "headline": "'Ukraine Better Come to Table Fast': Trump on Geneva Talks",
            "summary": "Donald Trump has urged Ukraine to 'come to the table fast' for negotiations during the Geneva talks. His statement emphasizes a push for a swift resolution to the conflict.",
            "key_points": [
                "Donald Trump urged Ukraine to 'come to the table fast' for Geneva talks.",
                "Emphasizes push for swift conflict resolution."
            ]
        },
        {
            "headline": "Return of Kursk Residents on Agenda of Russia-Ukraine-US Talks: Russian Ombudswoman",
            "summary": "The Russian Ombudswoman confirmed that the return of Kursk residents is on the agenda for upcoming Russia-Ukraine-US talks. This highlights humanitarian aspects of the discussions amidst diplomatic efforts.",
            "key_points": [
                "Russian Ombudswoman confirms return of Kursk residents on talks agenda.",
                "For Russia-Ukraine-US talks.",
                "Highlights humanitarian aspect of discussions."
            ]
        },
        {
            "headline": "Russian Army Liberates Minkovka Settlement in Donetsk People's Republic: MoD",
            "summary": "Russia's Ministry of Defense announced that the Russian Army has 'liberated' the Minkovka settlement in the Donetsk People's Republic. This claim indicates an advance in Russian military operations in the region.",
            "key_points": [
                "Russian MoD announces 'liberation' of Minkovka settlement.",
                "Located in Donetsk People's Republic.",
                "Indicates advance in Russian military operations."
            ]
        },
        {
            "headline": "Russia Expands Delegation for Ukraine Talks in Geneva: Kremlin",
            "summary": "The Kremlin announced that Russia has expanded its delegation for the Ukraine talks in Geneva. This move could signal increased diplomatic engagement or a more comprehensive approach to negotiations.",
            "key_points": [
                "Kremlin announced Russia expanded delegation for Ukraine talks in Geneva.",
                "Could signal increased diplomatic engagement.",
                "Suggests more comprehensive approach to negotiations."
            ]
        },
        {
            "headline": "Russian Army Liberates Tsvetkovoye Settlement in Zaporozhye Region: MoD",
            "summary": "Russia's Ministry of Defense announced that the Russian Army has 'liberated' the Tsvetkovoye settlement in the Zaporozhye Region. This signifies ongoing military advances in the conflict zone.",
            "key_points": [
                "Russian MoD announces 'liberation' of Tsvetkovoye settlement.",
                "Located in Zaporozhye Region.",
                "Signifies ongoing military advances."
            ]
        }
    ],
    "Business": [
        {
            "headline": "The missing $533mn at the centre of Byju’s billion-dollar default",
            "summary": "Edtech major Byju's faces a new inflection point with a US court issuing a $1.07 billion default judgment tied to disputed $533 million Alpha funds. Founder Byju Raveendran denies wrongdoing while battling insolvency and creditor claims globally.",
            "key_points": [
                "Byju's faces a $1.07 billion default judgment in a US court.",
                "Judgment is tied to $533 million in disputed Alpha funds.",
                "Founder Byju Raveendran denies wrongdoing amid insolvency and creditor claims."
            ]
        },
        {
            "headline": "'Bad outcomes': Indian-origin billionaire Vinod Khosla blasts Ro Khanna, Bernie Sanders over Silicon Valley intentions",
            "summary": "Indian-origin billionaire Vinod Khosla criticized Ro Khanna and Bernie Sanders, accusing them of having 'bad outcomes' for Silicon Valley. His comments highlight concerns among some industry leaders regarding political figures' approaches to the tech sector.",
            "key_points": [
                "Indian-origin billionaire Vinod Khosla criticized Ro Khanna and Bernie Sanders.",
                "Accused them of having 'bad outcomes' for Silicon Valley.",
                "Reflects industry concerns over political intentions for tech."
            ]
        },
        {
            "headline": "Top stocks to buy today: Stock market recommendations for February 24, 2026 - check list",
            "summary": "This article provides stock market recommendations for February 24, 2026, listing top stocks to consider buying. It serves as a guide for investors looking for potential opportunities in the market.",
            "key_points": [
                "Stock market recommendations for Feb 24, 2026.",
                "Lists top stocks for potential investment.",
                "A guide for investors."
            ]
        },
        {
            "headline": "India amends tax treaty with France, cuts dividend tax",
            "summary": "India has amended its tax treaty with France, resulting in a reduction in dividend tax. This revision aims to facilitate smoother economic interactions and investment flows between the two nations.",
            "key_points": [
                "India amends tax treaty with France.",
                "Reduces dividend tax.",
                "Aims to facilitate economic interactions and investment."
            ]
        },
        {
            "headline": "Revised PMS regulations by mid-2026: Sebi chief",
            "summary": "The Sebi chief announced that revised Portfolio Management Services (PMS) regulations are expected by mid-2026. These updates aim to enhance investor protection and streamline operations within the PMS sector.",
            "key_points": [
                "Sebi chief announced revised PMS regulations by mid-2026.",
                "Aims to enhance investor protection.",
                "Will streamline operations in the PMS sector."
            ]
        },
        {
            "headline": "Appraisal season 2026: What India Inc is planning for salary hikes and where pay may rise faster",
            "summary": "As appraisal season 2026 approaches, India Inc is formulating plans for salary hikes, with certain sectors expected to see faster pay increases. This article outlines the industry's strategies and potential hotspots for higher compensation.",
            "key_points": [
                "India Inc planning salary hikes for appraisal season 2026.",
                "Certain sectors projected to have faster pay increases.",
                "Outlines industry strategies and potential hotspots for compensation."
            ]
        },
        {
            "headline": "Wall Street falls as Trump ramps up tariffs; Dow drops over 600 points",
            "summary": "Wall Street experienced a significant decline, with the Dow dropping over 600 points, as former President Trump intensified his rhetoric on tariffs. The market reacted negatively to the renewed focus on protectionist trade policies, signaling investor concern.",
            "key_points": [
                "Wall Street experienced significant decline; Dow dropped over 600 points.",
                "Triggered by Trump ramping up tariff rhetoric.",
                "Market reacted negatively to protectionist trade policies."
            ]
        },
        {
            "headline": "FM cautions lenders against mis-selling, calls it an offence",
            "summary": "The Finance Minister has warned lenders against mis-selling financial products, declaring such practices an offense. This move aims to protect consumers and uphold ethical standards within the financial sector.",
            "key_points": [
                "Finance Minister cautioned lenders against mis-selling.",
                "Declared mis-selling an offense.",
                "Aims to protect consumers and uphold ethical financial standards."
            ]
        },
        {
            "headline": "IDFC shares slump 16% on Rs 590 crore fraud",
            "summary": "IDFC shares plummeted by 16% following the revelation of a Rs 590 crore fraud. This significant drop reflects investor reaction to the financial misconduct and its potential impact on the company.",
            "key_points": [
                "IDFC shares dropped 16%.",
                "Due to a Rs 590 crore fraud revelation.",
                "Reflects investor reaction to financial misconduct."
            ]
        },
        {
            "headline": "Govt eyes Rs 16.7 lakh crore from asset monetisation over FY26-30",
            "summary": "The Indian government aims to generate Rs 16.7 lakh crore through asset monetisation over the fiscal years 2026-2030. This ambitious plan seeks to unlock value from public assets and fund infrastructure development.",
            "key_points": [
                "Indian government aims for Rs 16.7 lakh crore from asset monetisation.",
                "Targeted over FY26-30.",
                "Aims to unlock value from public assets.",
                "Funds infrastructure development."
            ]
        },
        {
            "headline": "FM Sitharaman rules out roadmap for PSU bank mergers, panel to review sector reforms",
            "summary": "Finance Minister Nirmala Sitharaman has dismissed the idea of a roadmap for Public Sector Undertaking (PSU) bank mergers, stating that a panel will instead review sector reforms. This approach suggests a focus on broader reforms rather than immediate consolidation.",
            "key_points": [
                "FM Sitharaman rules out immediate roadmap for PSU bank mergers.",
                "A panel will review broader sector reforms.",
                "Suggests a focus on reforms over immediate consolidation."
            ]
        },
        {
            "headline": "Trump’s 15% global tariffs & US Supreme Court ruling: How India, China & other major economies are reacting to the new trade dynamics",
            "summary": "This article explores how India, China, and other major economies are responding to the new trade dynamics influenced by Trump’s proposed 15% global tariffs and a recent US Supreme Court ruling. It analyzes the international reactions and potential impacts on global trade.",
            "key_points": [
                "Examines reactions of major economies to Trump's 15% global tariffs.",
                "Also considers impact of US Supreme Court ruling on trade.",
                "Analyzes international responses and potential global trade impacts."
            ]
        },
        {
            "headline": "Supreme Court Strikes Down Trump Tariffs, $175 Billion At Stake As U.S. Halts Collections",
            "summary": "The US Supreme Court has struck down Trump-era tariffs, putting $175 billion at stake as the US government halts collections. This ruling could significantly impact trade relations and the American economy.",
            "key_points": [
                "US Supreme Court struck down Trump-era tariffs.",
                "175 billion is at stake as US halts collections.",
                "Ruling has significant implications for trade and economy."
            ]
        },
        {
            "headline": "Tensions rising between Iran and US: India explores ways to secure crude, LNG supplies",
            "summary": "As tensions escalate between Iran and the US, India is actively seeking alternative strategies to secure its crude oil and LNG supplies. This proactive measure aims to mitigate potential disruptions to its energy security.",
            "key_points": [
                "India exploring ways to secure crude, LNG supplies.",
                "Due to rising tensions between Iran and the US.",
                "Aims to mitigate potential energy supply disruptions."
            ]
        },
        {
            "headline": "Inoperative EPF accounts with up to Rs 1,000 to settle automatically",
            "summary": "The government has announced that inoperative Employees' Provident Fund (EPF) accounts with balances up to Rs 1,000 will be settled automatically. This measure aims to streamline the process for small, dormant accounts.",
            "key_points": [
                "Inoperative EPF accounts with up to Rs 1,000 to settle automatically.",
                "Government announcement.",
                "Aims to streamline process for small, dormant accounts."
            ]
        },
        {
            "headline": "Bharat Taxi won't let drivers earn below base rate: Shah",
            "summary": "Bharat Taxi has pledged that its drivers will not earn below a specified base rate, according to a statement by Shah. This commitment aims to ensure fair compensation and improve working conditions for its drivers.",
            "key_points": [
                "Bharat Taxi drivers guaranteed earnings above base rate.",
                "Statement by Shah.",
                "Aims to ensure fair compensation and improve working conditions."
            ]
        },
        {
            "headline": "IDFC First Bank, Dixon tech & more: Top stocks to watch on February 24",
            "summary": "This article lists top stocks, including IDFC First Bank and Dixon Technologies, that are recommended for investors to watch on February 24. It provides market insights and potential trading opportunities for the day.",
            "key_points": [
                "Lists top stocks like IDFC First Bank and Dixon Technologies to watch.",
                "Provides market insights for February 24.",
                "Suggests potential trading opportunities."
            ]
        },
        {
            "headline": "Why the Critical Minerals Pact With Brazil Carries Deep Strategic Weight for India?",
            "summary": "The critical minerals pact signed with Brazil is strategically significant for India, ensuring access to vital resources for its burgeoning industrial and technological needs. This deal strengthens India's resource security and reduces dependence on other nations.",
            "key_points": [
                "Critical minerals pact with Brazil is strategically important for India.",
                "Ensures access to vital resources for industrial and technological needs.",
                "Strengthens India's resource security.",
                "Reduces dependence on other nations."
            ]
        },
        {
            "headline": "China Urges US to Lift Unilateral Tariffs on Trading Partners",
            "summary": "China has called on the US to remove its unilateral tariffs on trading partners, arguing that such measures disrupt global trade and economic stability. This appeal reflects ongoing trade disputes and China's stance on free trade.",
            "key_points": [
                "China urges US to lift unilateral tariffs.",
                "Argues tariffs disrupt global trade and stability.",
                "Reflects ongoing trade disputes and China's free trade stance."
            ]
        },
        {
            "headline": "India Launches $2.98 Bln Export Promotion Mission to Power MSMEs, Boost Global Trade",
            "summary": "India has initiated a $2.98 billion Export Promotion Mission aimed at empowering MSMEs and bolstering global trade. This initiative seeks to enhance India's export capabilities and integrate small and medium enterprises into international markets.",
            "key_points": [
                "India launches $2.98 billion Export Promotion Mission.",
                "Aims to empower MSMEs and boost global trade.",
                "Enhance India's export capabilities.",
                "Integrate small and medium enterprises into international markets."
            ]
        },
        {
            "headline": "Russia Stays Vital to India’s Oil Supply: Oil Analyst Rejects US Claim",
            "summary": "An oil analyst asserts that Russia remains crucial to India’s oil supply, rejecting US claims of diminishing reliance. This perspective highlights the strategic energy relationship between India and Russia.",
            "key_points": [
                "Oil analyst states Russia is vital to India’s oil supply.",
                "Rejects US claims of diminishing reliance.",
                "Highlights strategic energy relationship between India and Russia."
            ]
        }
    ],
    "Technology": [
        {
            "headline": "AI reshapes IT talent's pyramid model",
            "summary": "Artificial Intelligence is fundamentally altering the traditional pyramid model for IT talent, necessitating a shift in skills and organizational structures. This transformation impacts workforce development and strategic planning within the technology sector.",
            "key_points": [
                "AI is changing the traditional IT talent pyramid model.",
                "Requires a shift in skills and organizational structures.",
                "Impacts workforce development and strategic planning in tech."
            ]
        },
        {
            "headline": "Network security alert: Unusual activity triggers “not a robot” verification process to safeguard users against potential suspicious online threats",
            "summary": "A network security alert has been issued due to unusual online activity, prompting a 'not a robot' verification process for users. This measure aims to protect against suspicious online threats and ensure user safety.",
            "key_points": [
                "Network security alert triggered by unusual online activity.",
                "\"Not a robot\" verification initiated for user safety.",
                "Aims to safeguard users against suspicious online threats."
            ]
        },
        {
            "headline": "Meet Asha Sharma: Indian-origin executive named CEO of Microsoft Gaming",
            "summary": "Asha Sharma, an executive of Indian origin, has been appointed CEO of Microsoft Gaming. This significant leadership role highlights her career achievements and represents a notable appointment within the global tech industry.",
            "key_points": [
                "Asha Sharma, Indian-origin executive, named CEO of Microsoft Gaming.",
                "Significant leadership appointment in global tech.",
                "Highlights her career achievements."
            ]
        },
        {
            "headline": "Complying with NCLAT directions on privacy: Meta and WhatsApp",
            "summary": "Meta and WhatsApp have stated their compliance with the National Company Law Appellate Tribunal (NCLAT) directions regarding user privacy. This indicates an adherence to regulatory requirements concerning data protection and user rights.",
            "key_points": [
                "Meta and WhatsApp complying with NCLAT privacy directions.",
                "Adhering to regulatory requirements.",
                "Relates to data protection and user rights."
            ]
        },
        {
            "headline": "How AI Reshapes Military Capabilities Across New Domains?",
            "summary": "This analysis delves into how Artificial Intelligence is transforming military capabilities across various new domains, from autonomous systems to advanced intelligence gathering. It examines the profound impact of AI on modern warfare strategies and defense technologies.",
            "key_points": [
                "Analyzes AI's transformation of military capabilities.",
                "Covers autonomous systems and advanced intelligence gathering.",
                "Examines profound impact on modern warfare strategies."
            ]
        },
        {
            "headline": "India Sets Deadline for Indigenous Fighter Jet Engine: Is 5-7 Year Target Achievable?",
            "summary": "India has set an ambitious deadline for developing an indigenous fighter jet engine, raising questions about the feasibility of achieving the 5-7 year target. This endeavor is crucial for national defense self-reliance and technological advancement.",
            "key_points": [
                "India set deadline for indigenous fighter jet engine.",
                "Questions feasibility of 5-7 year target.",
                "Crucial for national defense self-reliance and tech advancement."
            ]
        },
        {
            "headline": "More Than a Plane: SJ-100 is India's Fast Track to Aviation Self-Reliance",
            "summary": "The SJ-100 aircraft is presented as a key component of India's rapid advancement towards aviation self-reliance. This project signifies a major step in indigenous aerospace development and reducing dependence on foreign technology.",
            "key_points": [
                "SJ-100 aircraft key to India's aviation self-reliance.",
                "Major step in indigenous aerospace development.",
                "Aims to reduce dependence on foreign technology."
            ]
        }
    ],
    "Entertainment": [
        {
            "headline": "Boong Wins Best Children’s & Family Film: Lakshmipriya Devi’s film claims BAFTA; Manipur’s resilience shines",
            "summary": "Lakshmipriya Devi's film 'Boong' has won the BAFTA for Best Children’s & Family Film, a significant achievement that also highlights Manipur’s resilience. This recognition brings international acclaim and draws attention to the region's cultural strength.",
            "key_points": [
                "Lakshmipriya Devi's film 'Boong' wins BAFTA.",
                "Awarded Best Children’s & Family Film.",
                "Highlights Manipur’s resilience.",
                "Brings international acclaim and cultural attention."
            ]
        },
        {
            "headline": "Kriti Sanon stuns at London event alongside Daisy Edgar-Jones, Simone Ashley and other global stars - PICS",
            "summary": "Indian actress Kriti Sanon captivated attendees at a London event, appearing alongside international celebrities like Daisy Edgar-Jones and Simone Ashley. Her presence marked a notable moment for Indian representation on a global stage.",
            "key_points": [
                "Kriti Sanon attended a London event.",
                "Appeared with international stars like Daisy Edgar-Jones and Simone Ashley.",
                "Marked a significant moment for Indian representation."
            ]
        }
    ],
    "Sports": [
        {
            "headline": "T20 World Cup: How Babar Azam went from 'King' to 'match ka mujrim'",
            "summary": "Babar Azam, once Pakistan's batting star, is now heavily scrutinized due to his poor strike rate and inability to adapt to modern T20 demands. Despite impressive career stats, his aura has diminished, raising questions about his future role in the format.",
            "key_points": [
                "Babar Azam's performance in T20 World Cup under intense scrutiny.",
                "Criticism for poor strike rate and inability to adapt to modern T20s.",
                "His future role in Pakistan's T20 squad is uncertain."
            ]
        },
        {
            "headline": "'It's not all about Usman Tariq': England fire warning ahead of Pakistan Super 8s clash",
            "summary": "England spinner Liam Dawson emphasized that the team will focus on Pakistan's entire spin attack, not just Usman Tariq, for their T20 World Cup Super Eights match. Dawson highlighted England's diverse spin options and experience as key strengths.",
            "key_points": [
                "England to focus on Pakistan's full spin attack, not just Usman Tariq.",
                "Ahead of crucial T20 World Cup Super Eights match.",
                "England relying on its diverse spin options and experience."
            ]
        },
        {
            "headline": "'It’s not as if they are Malcolm Marshall': Akhtar slams Pandya, Dube",
            "summary": "Former Pakistan pacer Shoaib Akhtar criticized India’s bowling attack as fragile after their loss to South Africa, specifically targeting Hardik Pandya and Shivam Dube for conceding 67 runs. He urged India to include Kuldeep Yadav, calling him a 'missing link' and match-winner.",
            "key_points": [
                "Shoaib Akhtar criticized India's bowling attack after loss to South Africa.",
                "Slammed Hardik Pandya and Shivam Dube for expensive spell.",
                "Recommended including Kuldeep Yadav as a 'missing link' and match-winner."
            ]
        },
        {
            "headline": "Kara Braxton’s cause of death: Two-time WNBA champion passes away at 43 in a tragic incident",
            "summary": "Two-time WNBA champion Kara Braxton has passed away at the age of 43 due to a tragic incident. The basketball community mourns the loss of a celebrated athlete.",
            "key_points": [
                "Two-time WNBA champion Kara Braxton passed away at 43.",
                "Death was due to a tragic incident.",
                "Basketball community mourns her loss."
            ]
        },
        {
            "headline": "From knee troubles to doubles force: Yuki Bhambri’s long road to ATP success and belief",
            "summary": "Yuki Bhambri's journey to ATP success has been marked by overcoming significant knee troubles to become a formidable force in doubles tennis. His perseverance and belief highlight a remarkable comeback story in professional sports.",
            "key_points": [
                "Yuki Bhambri overcame significant knee injuries.",
                "Achieved ATP success as a doubles player.",
                "His journey showcases remarkable perseverance."
            ]
        }
    ],
    "Science": [
        {
            "headline": "Kuno National Park: Cheetah population grows to 38 as Gamini gives birth to 3 cubs, boosting Project Cheetah",
            "summary": "The cheetah population at Kuno National Park has increased to 38 after Gamini gave birth to three cubs. This development marks a significant boost for Project Cheetah, aiming to re-establish a viable cheetah population in India.",
            "key_points": [
                "Cheetah population at Kuno National Park reaches 38.",
                "Gamini gave birth to three new cubs.",
                "Significant boost for Project Cheetah.",
                "Aims to re-establish a viable cheetah population in India."
            ]
        }
    ],
    "Health": [
        {
            "headline": "Why so many office-goers are being told they have fatty liver",
            "summary": "Fatty liver disease (MASLD) is increasingly common among office workers, even young non-drinkers, due to sedentary jobs, stress, and poor diet. This silent condition is linked to obesity, high cholesterol, and heart disease, with experts recommending early screening and lifestyle changes.",
            "key_points": [
                "Fatty liver disease (MASLD) is on the rise among office workers.",
                "Caused by sedentary lifestyles, stress, and poor diet, not just alcohol.",
                "Linked to obesity, high cholesterol, and heart disease.",
                "Early screening and lifestyle changes are crucial for prevention."
            ]
        },
        {
            "headline": "Women's Heart Health: Understanding Cardiovascular Disease Symptoms and Prevention",
            "summary": "This article focuses on women's heart health, explaining key symptoms of cardiovascular disease and effective prevention strategies. It aims to raise awareness and provide essential information for maintaining cardiac well-being.",
            "key_points": [
                "Focuses on women's heart health.",
                "Explains symptoms of cardiovascular disease.",
                "Provides effective prevention strategies.",
                "Aims to raise awareness for cardiac well-being."
            ]
        },
        {
            "headline": "Good fasting sugar but high HbA1c: How is that possible? Doctor clears the confusion around diabetes tests",
            "summary": "This article addresses the confusion when fasting sugar levels are normal but HbA1c is high, explaining the discrepancies in diabetes test results. A doctor clarifies how such a situation can occur and what it indicates for diagnosis and management.",
            "key_points": [
                "Explains discrepancy between normal fasting sugar and high HbA1c.",
                "Clarifies how this occurs in diabetes tests.",
                "Aids in understanding diagnosis and management implications."
            ]
        },
        {
            "headline": "Diabetes diet alert: Expert reveals these common foods spike your blood sugar more than sugar itself",
            "summary": "An expert warns that certain common foods can elevate blood sugar levels more significantly than sugar itself, crucial information for individuals managing diabetes. The article highlights overlooked dietary culprits that impact glycemic control.",
            "key_points": [
                "Expert reveals common foods spike blood sugar more than sugar.",
                "Crucial information for diabetes management.",
                "Highlights overlooked dietary culprits impacting glycemic control."
            ]
        },
        {
            "headline": "Your urine could signal danger: Doctor explains what to watch for",
            "summary": "A doctor explains key indicators in urine that could signal underlying health dangers, guiding readers on what to observe. This information empowers individuals to recognize potential warning signs and seek medical attention if necessary.",
            "key_points": [
                "Doctor explains urine indicators of potential health dangers.",
                "Guides readers on what to observe.",
                "Empowers recognition of warning signs for medical attention."
            ]
        }
    ]
}