{
    "World": [
        {
            "headline": "Republic Day: PM Modi greets nation; security intensified across Delhi-NCR and LoC",
            "summary": "Prime Minister Narendra Modi extended greetings to the nation on Republic Day, as heightened security measures were implemented across Delhi-NCR and along the Line of Control. The intensified security aims to ensure a peaceful celebration of the national holiday, with forces on high alert.",
            "key_points": [
                "PM Modi greeted the nation on Republic Day.",
                "Security was significantly increased in Delhi-NCR and along the LoC.",
                "Measures were put in place for a peaceful celebration."
            ]
        },
        {
            "headline": "Rajasthan cops seize 10,000 kg of ammonium nitrate on Republic Day eve; 1 held",
            "summary": "Rajasthan police made a significant seizure of 10,000 kg of ammonium nitrate on the eve of Republic Day, apprehending one individual. The large quantity of explosive material raises concerns about potential threats, prompting an investigation into its intended use.",
            "key_points": [
                "10,000 kg of ammonium nitrate was seized in Rajasthan.",
                "The seizure occurred on the eve of Republic Day.",
                "One person has been arrested in connection with the incident."
            ]
        },
        {
            "headline": "An argument that ended in four deaths: What happened inside the Indian home in Georgia right before the massacre",
            "summary": "A tragic incident in Georgia resulted in the deaths of four members of an Indian family following a domestic dispute. Three children survived the massacre by hiding, as authorities investigate the circumstances leading to the fatal shooting.",
            "key_points": [
                "Four members of an Indian family were killed in Georgia, US.",
                "The incident stemmed from a family dispute.",
                "Three children survived by hiding during the attack."
            ]
        },
        {
            "headline": "Bangladesh: Hindu mechanic burnt to death in his workshop",
            "summary": "A Hindu mechanic was tragically burnt to death inside his workshop in Bangladesh, sparking an investigation into the cause. The incident has raised concerns and prompted calls for justice and protection for minority communities in the region.",
            "key_points": [
                "A Hindu mechanic died from burns in his Bangladesh workshop.",
                "An investigation is underway into the cause of death.",
                "The incident highlights concerns for minority communities."
            ]
        },
        {
            "headline": "Military Revolt in China? Xi Jinping’s Purge Targets Top General In Latest Clampdown | WATCH",
            "summary": "Reports suggest a potential military revolt in China, as President Xi Jinping continues his clampdown by purging a top general. This development signifies ongoing internal power struggles within the People's Liberation Army and the Communist Party leadership.",
            "key_points": [
                "China's President Xi Jinping has purged another top general.",
                "The move hints at internal power struggles and a possible military revolt.",
                "This is part of an ongoing clampdown by Xi Jinping."
            ]
        },
        {
            "headline": "Iran Threatens US Carrier With Drone Strike Video As IRGC Claims ‘Finger On The Trigger’",
            "summary": "Iran's Revolutionary Guard Corps (IRGC) has issued a stern warning to a US aircraft carrier, threatening a drone strike and claiming to have their \"finger on the trigger.\" This aggressive rhetoric escalates tensions in the region, particularly around key maritime routes.",
            "key_points": [
                "Iran's IRGC threatened a US aircraft carrier with a drone strike.",
                "They claimed to have their \"finger on the trigger.\"",
                "The threat increases geopolitical tensions in the region."
            ]
        },
        {
            "headline": "First Training Squadron of Indian Navy Strengthens Maritime Bonds with Indonesia",
            "summary": "The Indian Navy's First Training Squadron has successfully strengthened maritime bonds with Indonesia through a series of joint exercises and engagements. This initiative underscores India's commitment to enhancing regional cooperation and ensuring maritime security in the Indo-Pacific.",
            "key_points": [
                "Indian Navy's First Training Squadron engaged with Indonesia.",
                "The initiative aims to strengthen maritime cooperation.",
                "It emphasizes India's commitment to Indo-Pacific security."
            ]
        },
        {
            "headline": "Russian Air Defenses Destroy 92 Ukrainian Drones Over Russia Overnight: MoD",
            "summary": "The Russian Ministry of Defense reported that its air defense systems successfully destroyed 92 Ukrainian drones targeting Russian territory overnight. This incident marks a significant number of interceptions in ongoing aerial engagements between the two nations.",
            "key_points": [
                "Russian air defenses destroyed 92 Ukrainian drones overnight.",
                "The drones were targeting Russian territory.",
                "This reflects ongoing aerial warfare in the conflict."
            ]
        },
        {
            "headline": "Ferry carrying over 350 people sinks off southern Philippines leaving at least 13 dead",
            "summary": "A ferry carrying over 350 passengers and crew has tragically sunk off the southern Philippines, resulting in at least 13 fatalities. Rescue operations are underway, with concerns mounting over the fate of those still missing in the maritime disaster.",
            "key_points": [
                "A ferry sank off the southern Philippines with over 350 people aboard.",
                "At least 13 people have been confirmed dead.",
                "Rescue operations are ongoing for the missing."
            ]
        },
        {
            "headline": "Srinagar-Jammu highway shut for third consecutive day amid heavy snowfall; hundreds of vehicles stranded",
            "summary": "The crucial Srinagar-Jammu National Highway has remained closed for a third consecutive day due to heavy snowfall, stranding hundreds of vehicles. Adverse weather conditions have severely disrupted travel and supply lines to the Kashmir Valley.",
            "key_points": [
                "Srinagar-Jammu highway closed for third day due to heavy snow.",
                "Hundreds of vehicles are stranded on the route.",
                "Travel and supply lines to Kashmir are severely disrupted."
            ]
        },
        {
            "headline": "UGC issues new rules to curb caste bias as plaints up 118%",
            "summary": "The University Grants Commission (UGC) has introduced new regulations aimed at curbing caste-based discrimination in higher education institutions, following a significant 118% increase in reported complaints. These rules seek to foster inclusive environments and address systemic biases on campuses nationwide.",
            "key_points": [
                "UGC introduced new rules against caste bias in higher education.",
                "Complaints of discrimination increased by 118%.",
                "The aim is to promote inclusivity in campuses."
            ]
        },
        {
            "headline": "Lalu in back seat, Tejashwi is RJD's working president",
            "summary": "In a significant political development, Lalu Prasad Yadav has stepped back, with his son Tejashwi Yadav now appointed as the working president of the Rashtriya Janata Dal (RJD). This move signals a generational shift in the leadership of the prominent regional party.",
            "key_points": [
                "Lalu Prasad Yadav has ceded leadership role.",
                "Tejashwi Yadav is now the RJD's working president.",
                "The appointment marks a generational shift in the party."
            ]
        },
        {
            "headline": "Selective Targeting of India Unfair & Unjustified: Jaishankar Tells Polish Deputy PM",
            "summary": "India's External Affairs Minister Jaishankar conveyed to the Polish Deputy Prime Minister that selective targeting of India is unfair and unjustified. His remarks come amidst discussions on international relations and challenges faced by various nations.",
            "key_points": [
                "EAM Jaishankar criticized selective targeting of India.",
                "Remarks were made to the Polish Deputy PM.",
                "The statement pertains to international relations and fairness."
            ]
        }
    ],
    "Business": [
        {
            "headline": "H-1B visa interview slots unavailable across India; new dates pushed to 2027",
            "summary": "H-1B visa interview slots for Indian applicants are currently unavailable, with new appointment dates being pushed to as late as 2027. This significant backlog and scarcity of slots pose considerable challenges for Indian professionals aspiring to work in the United States.",
            "key_points": [
                "H-1B visa interview slots are unavailable in India.",
                "New appointment dates are pushed to 2027.",
                "This creates major hurdles for Indian professionals."
            ]
        },
        {
            "headline": "Rupee sinks to 92 against US dollar: What's impacted as India's currency keeps sliding — explained",
            "summary": "The Indian Rupee has depreciated significantly, reaching 92 against the US dollar, raising concerns across various economic sectors. Experts are analyzing the factors contributing to its continuous slide and the potential impacts on imports, exports, and inflation.",
            "key_points": [
                "Indian Rupee reached 92 against the US dollar.",
                "The depreciation is causing economic concerns.",
                "Impacts on trade and inflation are being analyzed."
            ]
        },
        {
            "headline": "Union Budget 2026: Will you pay less tax this year? Middle class eyes fresh relief on Feb 1",
            "summary": "As the Union Budget 2026 approaches, the Indian middle class is eagerly anticipating potential tax reliefs and incentives to be announced on February 1. Expectations are high for measures that could alleviate financial burdens and stimulate consumer spending.",
            "key_points": [
                "Middle class expects tax relief in Union Budget 2026.",
                "Budget to be announced on February 1.",
                "Anticipation for measures to ease financial burdens."
            ]
        },
        {
            "headline": "India Inc cuts volume hiring: Companies go selective on STEM freshers - here's why",
            "summary": "Indian companies are reportedly cutting down on volume hiring and becoming more selective, particularly with STEM freshers, due to prevailing economic conditions. This shift indicates a cautious approach to recruitment, focusing on specialized skills and immediate needs rather than mass recruitment.",
            "key_points": [
                "Indian companies are reducing volume hiring.",
                "Hiring is more selective, especially for STEM freshers.",
                "Economic conditions are driving this cautious recruitment trend."
            ]
        },
        {
            "headline": "India’s BPCL Eyes $780M Crude Agreement With Brazil’s Petrobras: Petroleum Minister",
            "summary": "Bharat Petroleum Corporation Limited (BPCL) is exploring a crude oil agreement worth $780 million with Brazil's state-owned Petrobras, as announced by India's Petroleum Minister. This potential deal highlights India's efforts to diversify its energy sources and strengthen international energy partnerships.",
            "key_points": [
                "BPCL is pursuing a $780 million crude agreement with Petrobras.",
                "India's Petroleum Minister confirmed the exploration of the deal.",
                "It signifies India's strategy to diversify energy sources."
            ]
        },
        {
            "headline": "RBI’s Digital Currency Plan to Challenge Dollar-Centric Payment Systems: Expert",
            "summary": "An expert suggests that the Reserve Bank of India's (RBI) digital currency initiative has the potential to challenge dollar-centric global payment systems. The move could foster greater financial autonomy and offer an alternative in international transactions.",
            "key_points": [
                "RBI's digital currency could challenge dollar-centric payments.",
                "It aims to boost financial autonomy.",
                "The initiative may offer alternatives for international transactions."
            ]
        },
        {
            "headline": "Russia Stays Vital to India’s Oil Supply: Oil Analyst Rejects US Claim",
            "summary": "An oil analyst has refuted US claims, asserting that Russia remains a crucial and vital supplier of oil to India despite international pressures. This analysis underscores the ongoing strategic energy partnership between India and Russia.",
            "key_points": [
                "Analyst says Russia is vital for India's oil supply.",
                "This contradicts US claims regarding India's energy sources.",
                "It highlights the strategic energy ties between the two nations."
            ]
        },
        {
            "headline": "Why Does Indo-Russian Tech Cooperation Matter More Than Ever Just Now?",
            "summary": "Indo-Russian technological cooperation is gaining unprecedented importance amidst evolving global geopolitical landscapes and sanctions. Experts argue that this partnership is critical for both nations to achieve strategic autonomy and innovation in key technological sectors.",
            "key_points": [
                "Indo-Russian tech cooperation is highly significant now.",
                "It's crucial due to global geopolitical changes and sanctions.",
                "The partnership supports strategic autonomy and innovation."
            ]
        }
    ],
    "Technology": [
        {
            "headline": "I took an EV on a highway trip — and discovered how unprepared we are",
            "summary": "An individual's recent highway trip in an electric vehicle (EV) revealed significant unpreparedness in terms of charging infrastructure and range anxiety. This personal account highlights the challenges and limitations that still exist for widespread EV adoption in the current scenario.",
            "key_points": [
                "An EV highway trip exposed infrastructure gaps.",
                "Issues included limited charging stations and range anxiety.",
                "The experience underscores challenges for widespread EV adoption."
            ]
        }
    ],
    "Entertainment": [
        {
            "headline": "‘Unsung heroes’: Padma awards 2026 for Dharmendra, Shibu Soren, cricketers Harmanpreet Kaur, Rohit Sharma",
            "summary": "The Padma Awards 2026 honored a diverse group of \"unsung heroes,\" including veteran actor Dharmendra, politician Shibu Soren, and cricketers Harmanpreet Kaur and Rohit Sharma. These accolades celebrate significant contributions across various fields, bringing national recognition to their achievements.",
            "key_points": [
                "Padma Awards 2026 recognized \"unsung heroes.\"",
                "Notable recipients include Dharmendra, Shibu Soren, Harmanpreet Kaur, and Rohit Sharma.",
                "Awards celebrate contributions in entertainment, politics, and sports."
            ]
        },
        {
            "headline": "'Border 2' box office collections Day 3",
            "summary": "The film 'Border 2' has shown robust performance at the box office, with its collections on Day 3 indicating a strong audience reception. The movie continues to draw viewers, solidifying its position as a successful release.",
            "key_points": [
                "'Border 2' showed strong box office collections on Day 3.",
                "The film is performing well.",
                "It indicates a positive audience reception."
            ]
        },
        {
            "headline": "Mammootty wins Padma Bhushan: 'Sathosham, athi santhosham'",
            "summary": "Veteran Malayalam actor Mammootty has been honored with the prestigious Padma Bhushan, expressing his immense joy with \"Sathosham, athi santhosham\" (Happiness, extreme happiness). This award recognizes his profound contributions and long-standing impact on Indian cinema.",
            "key_points": [
                "Mammootty received the Padma Bhushan award.",
                "He expressed great happiness over the recognition.",
                "The award acknowledges his significant contributions to Indian cinema."
            ]
        },
        {
            "headline": "'Shah Rukh Khan, Salman Khan, Aamir Khan they are all stars,' says 'Ramayan' actor Arun Govil as he disagrees with AR Rahman's 'communal' remark",
            "summary": "'Ramayan' actor Arun Govil disagreed with AR Rahman's \"communal\" remark, asserting that Shah Rukh Khan, Salman Khan, and Aamir Khan are all stars. His statement emphasizes a collective appreciation for their stardom across the industry, transcending any perceived divisions.",
            "key_points": [
                "Arun Govil disagreed with AR Rahman's \"communal\" remark.",
                "He stated Shah Rukh, Salman, and Aamir Khan are all stars.",
                "His comments emphasize unity in the film industry."
            ]
        }
    ],
    "Sports": [
        {
            "headline": "Sarfaraz on fire! Back-to-back tons send strong message to selectors",
            "summary": "Cricketer Sarfaraz Khan has delivered back-to-back centuries, sending a powerful message to national selectors with his exceptional form. His consistent high-scoring performances are making a strong case for his inclusion in higher-level teams.",
            "key_points": [
                "Sarfaraz Khan scored back-to-back centuries.",
                "His performance sends a strong message to selectors.",
                "He is making a strong case for national team inclusion."
            ]
        },
        {
            "headline": "FIDE WC in India: PM Modi says 'Chess is gaining popularity among our youth'",
            "summary": "Prime Minister Narendra Modi noted the growing popularity of chess among Indian youth during the FIDE World Cup event held in India. His remarks highlight the increasing engagement of young people with strategic games and India's potential as a chess hub.",
            "key_points": [
                "PM Modi commented on chess's rising popularity in India.",
                "Remarks were made during the FIDE World Cup.",
                "He emphasized youth engagement and India's chess potential."
            ]
        },
        {
            "headline": "Diamond League Final: Neeraj Chopra's event preview, time and live telecast in India",
            "summary": "The Diamond League Final is set to feature India's Olympic gold medalist Neeraj Chopra, with details on his event, timing, and live telecast available for Indian audiences. Fans eagerly await his performance, hoping for another strong showing on the global stage.",
            "key_points": [
                "Neeraj Chopra is participating in the Diamond League Final.",
                "Event details and live telecast information for India are available.",
                "Fans are anticipating his performance on the global stage."
            ]
        },
        {
            "headline": "'Two reasons': Why was Dhoni promoted over Yuvraj? Sachin breaks silence",
            "summary": "Sachin Tendulkar has finally broken his silence, explaining the \"two reasons\" behind MS Dhoni's promotion over Yuvraj Singh in a crucial match. His revelation sheds light on the strategic decisions made during a pivotal moment in Indian cricket history.",
            "key_points": [
                "Sachin Tendulkar revealed reasons for Dhoni's promotion over Yuvraj.",
                "His explanation clarifies a key strategic decision.",
                "The revelation pertains to a pivotal moment in Indian cricket."
            ]
        }
    ],
    "Science": [
        {
            "headline": "Archaeologists uncover 800,000-year-old human footprints beneath the sands of eastern England",
            "summary": "Archaeologists in eastern England have made a remarkable discovery, uncovering 800,000-year-old human footprints preserved beneath ancient sands. This rare find provides invaluable insights into early human presence and behavior in the region.",
            "key_points": [
                "800,000-year-old human footprints found in eastern England.",
                "The discovery was made by archaeologists.",
                "It offers insights into early human presence."
            ]
        }
    ],
    "Health": [
        {
            "headline": "'Suicide Saviour Fan': Thane 15-year-old girl’s innovation offers hope amid India’s student mental health crisis",
            "summary": "A 15-year-old girl from Thane has developed an innovative \"Suicide Saviour Fan\" designed to prevent suicides, offering a beacon of hope amidst India's student mental health crisis. Her creation exemplifies a proactive approach to addressing a critical societal challenge.",
            "key_points": [
                "A 15-year-old created a \"Suicide Saviour Fan.\"",
                "The invention aims to prevent suicides.",
                "It addresses India's student mental health crisis."
            ]
        },
        {
            "headline": "Australian study finds heart cells can regenerate post-heart attack; India’s leading cardiologist calls it a ‘big step’",
            "summary": "An Australian study has made a groundbreaking discovery, finding that heart cells can regenerate after a heart attack, a development hailed as a \"big step\" by India's leading cardiologist. This research offers new hope for cardiac treatment and recovery.",
            "key_points": [
                "Australian study shows heart cell regeneration after heart attacks.",
                "India's leading cardiologist calls it a \"big step.\"",
                "The discovery offers new hope for cardiac treatment."
            ]
        }
    ]
}