{
    "World": [
        {
            "headline": "US-Russia nuclear treaty nears expiry, Kremlin warns of 'dangerous' moment: Why New START matters for global security",
            "summary": "The New START treaty, the last remaining arms control agreement between the US and Russia, is approaching its expiration. The Kremlin has issued a warning about a 'dangerous moment' if the treaty is not extended or replaced, highlighting its importance for global strategic stability.",
            "key_points": [
                "New START is the final arms control treaty between US and Russia.",
                "Kremlin warns of danger if it expires without replacement.",
                "Crucial for global security and preventing an unrestricted nuclear arms race."
            ]
        },
        {
            "headline": "Was Jeffrey Epstein a Russian spy? Poland's PM makes bombshell claim amid DOJ’s release of millions of files",
            "summary": "Poland's Prime Minister has made a surprising claim, suggesting that the late financier Jeffrey Epstein might have been a Russian spy. This assertion comes amidst the US Department of Justice's release of millions of files related to Epstein, adding a new geopolitical dimension to the ongoing revelations.",
            "key_points": [
                "Poland's PM claims Jeffrey Epstein was a Russian spy.",
                "Claim made during the release of millions of DOJ files on Epstein.",
                "Adds a geopolitical angle to the Epstein scandal."
            ]
        },
        {
            "headline": "US Navy shoots down ‘aggressively approaching’ Iranian drone in Arabian Sea",
            "summary": "A US F-35C fighter jet, operating from the USS Abraham Lincoln, successfully shot down an Iranian Shahed-139 drone in the Arabian Sea, which was deemed 'aggressively approaching.' This incident occurred within hours of Iranian forces harassing a US merchant vessel in the Strait of Hormuz, further escalating regional tensions.",
            "key_points": [
                "US Navy F-35C shot down an Iranian Shahed-139 drone in Arabian Sea.",
                "The drone was considered 'aggressively approaching' US forces.",
                "Incident followed harassment of a US merchant vessel by Iranian forces."
            ]
        },
        {
            "headline": "Four masked gunmen, disabled security cameras: How Gaddafi's son was assassinated in Libya",
            "summary": "Saif al-Islam Gaddafi, son of the late Libyan dictator Moammar Gaddafi, was reportedly assassinated in Libya by four masked gunmen. The perpetrators disabled security cameras, suggesting a premeditated and organized attack.",
            "key_points": [
                "Saif al-Islam Gaddafi was assassinated in Libya.",
                "Four masked gunmen were responsible for the attack.",
                "Security cameras were disabled, indicating a planned operation."
            ]
        },
        {
            "headline": "Operation Kiya: Security forces establish contact with terrorists in J&K's Udhampur, firefight on",
            "summary": "A joint operation, dubbed 'Operation Kiya', is underway in Jammu and Kashmir's Udhampur district after security forces established contact with terrorists. A firefight erupted Tuesday afternoon following specific intelligence inputs, with reinforcements deployed and all exit routes sealed as the encounter continues.",
            "key_points": [
                "Joint operation 'Kiya' initiated against terrorists in J&K's Udhampur.",
                "Firefight is ongoing after security forces made contact.",
                "Reinforcements deployed and exit routes sealed in the area."
            ]
        },
        {
            "headline": "Shocking revelations: Epstein files uncover high-profile connections",
            "summary": "Newly released files related to Jeffrey Epstein's case have brought to light shocking revelations, detailing high-profile connections and associates. These disclosures are part of ongoing investigations into Epstein's vast network and are expected to shed more light on his activities.",
            "key_points": [
                "Epstein files reveal shocking high-profile connections.",
                "Disclosures are part of ongoing investigations into Epstein's network.",
                "Expected to shed further light on his activities and associates."
            ]
        },
        {
            "headline": "Bill and Hillary Clinton agree to testify in Epstein investigation",
            "summary": "Former President Bill Clinton and former Secretary of State Hillary Clinton have reportedly agreed to testify in the ongoing Jeffrey Epstein investigation. Their agreement comes as more details emerge from the recently released Epstein files, further expanding the scope of the inquiry.",
            "key_points": [
                "Bill and Hillary Clinton to testify in the Epstein investigation.",
                "Agreement follows new revelations from recently released Epstein files.",
                "Testimony expands the scope of the ongoing inquiry."
            ]
        },
        {
            "headline": "Hyderabad techie files plaint against MNC over 16-hour workdays",
            "summary": "A tech professional in Hyderabad has filed a complaint against a multinational corporation, alleging that 16-hour workdays have become an 'unwritten norm,' significantly exceeding the stipulated 40-hour workweek. This complaint highlights growing concerns about employee exploitation and work-life balance in the tech industry.",
            "key_points": [
                "Hyderabad techie files complaint against MNC for 16-hour workdays.",
                "Claims extended hours became an 'unwritten norm' beyond 40-hour week.",
                "Raises concerns about employee exploitation and work-life balance."
            ]
        },
        {
            "headline": "Firing at Rohit Shetty’s residence in Mumbai: Lawrence Bishnoi aide gave Rs 40k for 2-wheeler",
            "summary": "A firing incident occurred at the Mumbai residence of filmmaker Rohit Shetty, with investigations revealing that an aide of gangster Lawrence Bishnoi provided Rs 40,000 for a two-wheeler used in the crime. This suggests a potential link to organized crime.",
            "key_points": [
                "Firing reported at filmmaker Rohit Shetty's Mumbai residence.",
                "An aide of gangster Lawrence Bishnoi funded a two-wheeler for the crime.",
                "Investigation suggests a potential link to organized crime."
            ]
        },
        {
            "headline": "Mumbai-Pune eway traffic stalls for 7+ hours after gas tanker overturns; thousands stranded",
            "summary": "Traffic on the Mumbai-Pune Expressway has been stalled for over seven hours following the overturning of a gas tanker near the Adoshi tunnel, leaving thousands of commuters stranded. Emergency services are on site, but the significant disruption highlights infrastructure challenges.",
            "key_points": [
                "Mumbai-Pune Expressway traffic stalled for over seven hours.",
                "Caused by an overturned gas tanker near Adoshi tunnel.",
                "Thousands of commuters are stranded due to the disruption."
            ]
        },
        {
            "headline": "Fine can’t exceed twice the value of bounced cheque, says Karnataka HC",
            "summary": "The Karnataka High Court has ruled that a fine imposed in a bounced cheque case cannot exceed twice the value of the cheque amount. This decision sets a legal precedent, limiting the financial penalty for such offenses and providing clarity for litigants.",
            "key_points": [
                "Karnataka HC limits fine for bounced cheque cases.",
                "Fine cannot exceed twice the value of the cheque amount.",
                "Decision sets a legal precedent for financial penalties."
            ]
        },
        {
            "headline": "Digital Trail Leads To Arrest: Delhi Police crack murder case; blood-stained clothes, weapons found",
            "summary": "Delhi Police have successfully cracked a murder case, with a digital trail playing a crucial role in leading to an arrest. Investigators recovered blood-stained clothes and weapons, securing significant evidence in the ongoing investigation.",
            "key_points": [
                "Delhi Police cracked a murder case, aided by a digital trail.",
                "An arrest has been made in connection to the crime.",
                "Blood-stained clothes and weapons were recovered as evidence."
            ]
        },
        {
            "headline": "57,538 Metro commuters in Bengaluru caught playing loud music in 1 year",
            "summary": "A staggering 57,538 Metro commuters in Bengaluru have been penalized for playing loud music over the past year. This statistic highlights a persistent issue of noise pollution on public transport and the enforcement challenges faced by authorities.",
            "key_points": [
                "Over 57,000 Bengaluru Metro commuters penalized for loud music in one year.",
                "Highlights persistent issue of noise pollution on public transport.",
                "Indicates ongoing enforcement challenges for authorities."
            ]
        },
        {
            "headline": "Indian among four killed in US shooting after argument in Georgia home; 3 children survive by hiding",
            "summary": "An Indian national was among four people killed in a shooting incident in a Georgia home, which reportedly stemmed from an argument. Three children miraculously survived the massacre by hiding, and the suspect has been arrested.",
            "key_points": [
                "Four people, including an Indian national, killed in Georgia shooting.",
                "The incident reportedly stemmed from an argument in an Indian home.",
                "Three children survived by hiding; a suspect has been arrested."
            ]
        },
        {
            "headline": "Africa's lone penguin species nears starvation amid urgent conservation push",
            "summary": "Africa's only native penguin species is facing the critical threat of starvation, prompting an urgent push for conservation efforts. The species is experiencing severe food shortages, putting its survival at extreme risk and necessitating immediate intervention.",
            "key_points": [
                "Africa's lone penguin species is nearing starvation.",
                "Urgent conservation efforts are being undertaken to save the species.",
                "Severe food shortages are putting its survival at extreme risk."
            ]
        },
        {
            "headline": "Odisha girl survives night in jungle after kidnapping, attempted rape",
            "summary": "A young girl from Odisha courageously survived a night alone in the jungle after enduring a harrowing experience of kidnapping and attempted rape. The incident highlights significant safety concerns in the region and the girl's extraordinary resilience.",
            "key_points": [
                "Odisha girl survived a night in the jungle after being kidnapped.",
                "She was also a victim of attempted rape.",
                "Incident highlights safety concerns and the girl's resilience."
            ]
        },
        {
            "headline": "‘Chained, beaten, starved’: British couple reveal horror inside Taliban's 'hell' prison",
            "summary": "A British couple has shared a harrowing account of their ordeal inside a Taliban prison, describing conditions of being chained, beaten, and starved. Their testimony offers a grim look into human rights abuses under Taliban rule and the severe challenges faced by detainees.",
            "key_points": [
                "British couple recount horrific experience in a Taliban prison.",
                "Described being chained, beaten, and starved.",
                "Testimony highlights alleged human rights abuses under Taliban rule."
            ]
        },
        {
            "headline": "Indian-origin restaurant owner caught spiking woman’s drink at UK club; staff swap glass before calling police",
            "summary": "An Indian-origin restaurant owner in the UK was apprehended after being caught spiking a woman's drink at a club. Alert staff members intervened by swapping the glass before alerting the police, preventing a potentially harmful incident.",
            "key_points": [
                "Indian-origin restaurant owner caught spiking a woman's drink in UK.",
                "Club staff intervened by swapping the glass.",
                "Police were called, preventing potential harm to the woman."
            ]
        },
        {
            "headline": "Indian-origin Gurmeet Singh to be stripped of US citizenship over rape; hid crime during naturalisation",
            "summary": "Indian-origin Gurmeet Singh faces the revocation of his US citizenship after it was revealed he concealed a rape crime during his naturalization process. This legal action highlights the consequences of fraudulent naturalization applications and past criminal activities.",
            "key_points": [
                "Indian-origin Gurmeet Singh to be stripped of US citizenship.",
                "He hid a rape crime during his naturalization process.",
                "Action highlights consequences of fraudulent citizenship applications."
            ]
        },
        {
            "headline": "Indian-origin race discrimination commissioner calls Australia 'stolen land', faces backlash",
            "summary": "An Indian-origin race discrimination commissioner in Australia has sparked controversy by referring to Australia as 'stolen land,' leading to significant backlash. The statement reignited debates surrounding Indigenous land rights and colonial history in the country.",
            "key_points": [
                "Indian-origin commissioner calls Australia 'stolen land'.",
                "Statement led to significant public backlash.",
                "Reignited debates on Indigenous land rights and colonial history."
            ]
        },
        {
            "headline": "Indian-origin man arrested in Canada for setting his own restaurant on fire for insurance money",
            "summary": "An Indian-origin man has been arrested in Canada on suspicion of deliberately setting his own restaurant on fire to claim insurance money. The incident is being investigated as a case of arson and insurance fraud.",
            "key_points": [
                "Indian-origin man arrested in Canada for arson.",
                "Allegedly set his restaurant on fire for insurance money.",
                "Incident being investigated as arson and insurance fraud."
            ]
        },
        {
            "headline": "$55 million scam targeting seniors: Two Indian jewelry stores raided in Texas, victims were told to buy gold to evade arrest",
            "summary": "Two Indian jewelry stores in Texas have been raided in connection with a $55 million scam that defrauded senior citizens. Victims were allegedly coerced into buying gold under false pretenses, being told it would help them evade arrest.",
            "key_points": [
                "Two Indian jewelry stores in Texas raided for $55 million scam.",
                "Scam targeted senior citizens.",
                "Victims were coerced into buying gold to 'evade arrest'."
            ]
        },
        {
            "headline": "Indian driver on student visa jailed in Australia for $200,000 real estate scam, impersonated law firm to defraud homebuyer",
            "summary": "An Indian student visa holder working as a driver in Australia has been sentenced to jail for his involvement in a $200,000 real estate scam. He impersonated a law firm to defraud a homebuyer, highlighting fraudulent activities by some international students.",
            "key_points": [
                "Indian student driver jailed in Australia for $200,000 real estate scam.",
                "Impersonated a law firm to defraud a homebuyer.",
                "Highlights fraudulent activities by some international students."
            ]
        },
        {
            "headline": "Indonesia Affirms Russia as Key Partner And Friendly Nation: Foreign Ministry",
            "summary": "Indonesia's Foreign Ministry has reiterated its stance, affirming Russia as a key partner and a friendly nation. This statement underscores the strong bilateral relations between the two countries amid global geopolitical shifts.",
            "key_points": [
                "Indonesia affirms Russia as a key partner.",
                "Foreign Ministry labels Russia as a friendly nation.",
                "Highlights strong bilateral ties amid global shifts."
            ]
        },
        {
            "headline": "Russia, China Align on BRICS Cooperation and Strategic Security: Foreign Ministry",
            "summary": "Russia and China have aligned their positions on cooperation within the BRICS framework and issues of strategic security, as stated by their respective foreign ministries. This collaboration emphasizes their shared vision for a multipolar world order and enhanced security coordination.",
            "key_points": [
                "Russia and China align on BRICS cooperation.",
                "Agreement on strategic security issues.",
                "Emphasizes shared vision for a multipolar world."
            ]
        },
        {
            "headline": "No Official Signal from India on Ending Russian Oil Imports: Kremlin",
            "summary": "The Kremlin has stated that it has received no official signal from India regarding an end to Russian oil imports. This clarifies India's continued stance on energy procurement, maintaining its trade relations with Russia despite international pressures.",
            "key_points": [
                "Kremlin reports no official signal from India on ending Russian oil imports.",
                "Confirms India's continued energy trade with Russia.",
                "Highlights India's independent stance on energy procurement."
            ]
        },
        {
            "headline": "SCO Countries Aim to Establish Equal, Indivisible Security in Eurasia: SCO Secretary General",
            "summary": "The Shanghai Cooperation Organisation (SCO) member countries are committed to establishing equal and indivisible security across Eurasia, according to the SCO Secretary General. This collective goal emphasizes regional stability and mutual security arrangements among the diverse member states.",
            "key_points": [
                "SCO countries aim for equal and indivisible security in Eurasia.",
                "Statement made by the SCO Secretary General.",
                "Emphasizes regional stability and mutual security arrangements."
            ]
        },
        {
            "headline": "India, Armenia Hold Talks on Military Cooperation and Security: Defense Ministry",
            "summary": "India and Armenia have engaged in discussions concerning military cooperation and broader security matters, as confirmed by India's Defense Ministry. These talks signify strengthening bilateral defense ties and a shared commitment to regional stability.",
            "key_points": [
                "India and Armenia hold talks on military cooperation.",
                "Discussions also cover broader security issues.",
                "Signifies strengthening bilateral defense ties."
            ]
        },
        {
            "headline": "Russian Security Council Secretary Visits Myanmar to Boost Defense Industry Cooperation",
            "summary": "The Secretary of Russia's Security Council has visited Myanmar, with the objective of enhancing cooperation in the defense industry sector. This visit underscores Russia's efforts to strengthen strategic partnerships and expand its influence in Southeast Asia.",
            "key_points": [
                "Russian Security Council Secretary visited Myanmar.",
                "Aims to boost defense industry cooperation.",
                "Part of Russia's effort to strengthen strategic partnerships."
            ]
        },
        {
            "headline": "Macron Greenlights Plan to Eliminate Unwanted African Leaders: Russian Foreign Intel",
            "summary": "Russian Foreign Intelligence claims that French President Macron has greenlighted a plan to 'eliminate unwanted African leaders.' This explosive accusation, if true, suggests a controversial and interventionist foreign policy.",
            "key_points": [
                "Russian Foreign Intelligence claims Macron approved plan to 'eliminate' African leaders.",
                "Accusation suggests controversial French interventionist foreign policy.",
                "Raises questions about international relations in Africa."
            ]
        },
        {
            "headline": "Taliban Takes the Helm at Afghan Embassy in Delhi: What India Stands to Gain?",
            "summary": "The Taliban has reportedly assumed control of the Afghan Embassy in Delhi, prompting questions about India's potential gains or strategic implications. This development signifies a complex shift in diplomatic relations and engagement with the current Afghan regime.",
            "key_points": [
                "Taliban reportedly takes control of Afghan Embassy in Delhi.",
                "Raises questions about India's strategic gains and implications.",
                "Signifies a complex shift in diplomatic relations with the Afghan regime."
            ]
        },
        {
            "headline": "Imperialism or National Interest? Why Greenland Matters",
            "summary": "The article explores the strategic importance of Greenland, debating whether global interest in the region stems from imperialistic ambitions or genuine national interests. Its vast resources and geopolitical location make it a subject of international scrutiny.",
            "key_points": [
                "Examines the strategic importance of Greenland.",
                "Debates whether global interest is driven by imperialism or national interest.",
                "Highlights Greenland's vast resources and geopolitical location."
            ]
        }
    ],
    "Business": [
        {
            "headline": "India-US Trade Deal Reaches Advanced Stages, Shields Key Indian Sectors",
            "summary": "A comprehensive trade deal between India and the US is nearing finalization, with Indian officials securing significant concessions. The agreement prioritizes Indian agricultural products and dairy, signaling a strong bilateral relationship and potential gains for Indian exporters.",
            "key_points": [
                "India-US trade deal is in advanced stages, with a joint statement expected soon.",
                "India successfully shielded key agricultural products and dairy.",
                "Lower US tariffs on India could encourage MNCs to shift production from China.",
                "Deal is seen as beneficial for India, offering better terms than to competing countries."
            ]
        },
        {
            "headline": "Gold, silver price today: Gold up 7%, silver rates zoom 15% in international markets",
            "summary": "Gold and silver prices have seen significant increases in international markets, with gold up 7% and silver up 15%. This bull run is attributed to the weakening US dollar's status as a reserve currency and central banks, including China and India, increasing gold purchases. Analysts anticipate continued volatility but expect the upward trend to remain intact.",
            "key_points": [
                "Gold prices up 7%, silver prices up 15% internationally.",
                "Weakening US dollar and increased central bank gold purchases (India, China) are key drivers.",
                "Bull run expected to continue despite ongoing volatility."
            ]
        },
        {
            "headline": "Why Air India's precautionary grounding of a Boeing 787 shouldn't be ignored",
            "summary": "Air India has grounded another Boeing 787 due to a fuel control switch issue, months after a similar problem led to a horrific crash in Ahmedabad. It is crucial that the pilot's report is taken seriously and followed up rigorously to ensure aviation safety and prevent future incidents.",
            "key_points": [
                "Air India grounded a Boeing 787 due to a fuel control switch issue.",
                "This incident follows a similar problem after the Ahmedabad crash.",
                "Rigorous follow-up on pilot reports is essential for aviation safety."
            ]
        },
        {
            "headline": "‘A reset and fresh start’: India–China bilateral trade hits record $155 billion",
            "summary": "Bilateral trade between India and China reached an unprecedented $155 billion in 2025, marking over 12% year-on-year growth. Chinese Ambassador Xu Feihong highlighted this record achievement, underscoring both nations' commitment to the Global South's development agenda and China's support for India's BRICS presidency.",
            "key_points": [
                "India-China bilateral trade reached a record $155 billion in 2025.",
                "Achieved over 12% year-on-year growth.",
                "Highlights commitment to Global South development and China's support for India's BRICS presidency."
            ]
        },
        {
            "headline": "Aditya Birla Housing Finance raises Rs 2,750 crore from Advent",
            "summary": "Aditya Birla Housing Finance has successfully secured Rs 2,750 crore in funding from Advent International, a global private equity firm. This capital infusion is expected to strengthen the company's financial position and support its growth initiatives in the housing finance sector.",
            "key_points": [
                "Aditya Birla Housing Finance raised Rs 2,750 crore.",
                "Funding secured from global private equity firm Advent International.",
                "Aims to strengthen finances and support growth initiatives."
            ]
        },
        {
            "headline": "Wipro’s stand on ex gratia dispute with ex-staffer ruled abuse of law by Karnataka HC",
            "summary": "The Karnataka High Court has declared Wipro's position in a dispute over ex gratia payment with a former employee as an 'abuse of law,' imposing costs on the company. This ruling underscores judicial scrutiny on corporate labor practices and fair compensation.",
            "key_points": [
                "Karnataka HC ruled Wipro's stance in ex gratia dispute as 'abuse of law'.",
                "Costs were imposed on Wipro.",
                "Highlights judicial scrutiny on corporate labor practices and fair compensation."
            ]
        },
        {
            "headline": "BRICS De-Dollarization Helps Handle US-Driven Financial Storm: Expert",
            "summary": "An expert suggests that the de-dollarization efforts by BRICS nations can help member countries navigate and mitigate 'US-driven financial storms.' This strategy aims to reduce reliance on the US dollar, fostering greater economic sovereignty and stability within the bloc.",
            "key_points": [
                "BRICS de-dollarization helps member nations against 'US-driven financial storms'.",
                "Strategy aims to reduce reliance on the US dollar.",
                "Fosters greater economic sovereignty and stability within the bloc."
            ]
        },
        {
            "headline": "India Unveils Rare Earth Corridor to Reduce Heavy Import Reliance",
            "summary": "India has announced the unveiling of a 'Rare Earth Corridor' initiative, aimed at significantly reducing the country's heavy reliance on imports for these critical minerals. This strategic move is expected to bolster domestic production and enhance India's self-sufficiency in key technological and defense sectors.",
            "key_points": [
                "India unveils 'Rare Earth Corridor' initiative.",
                "Aims to significantly reduce reliance on rare earth imports.",
                "Expected to bolster domestic production and self-sufficiency in critical minerals."
            ]
        },
        {
            "headline": "India's Defence Budget Rises by 15%: What Does it Mean for Indian Military?",
            "summary": "India's defense budget has seen a significant 15% increase, prompting analysis into its implications for the Indian military. This rise is expected to facilitate modernization, procurement of advanced weaponry, and enhance preparedness against evolving security challenges.",
            "key_points": [
                "India's defense budget increased by 15%.",
                "Expected to facilitate military modernization and advanced weaponry procurement.",
                "Aims to enhance preparedness against evolving security challenges."
            ]
        },
        {
            "headline": "India’s Rare Earth Strategy Sparks Surge in Defence Stocks",
            "summary": "India's strategic initiatives concerning rare earth minerals have reportedly triggered a surge in defense stocks. This indicates investor confidence in the nation's push for self-reliance in critical materials, which are vital for defense technology.",
            "key_points": [
                "India's rare earth strategy sparks surge in defense stocks.",
                "Indicates investor confidence in national self-reliance.",
                "Rare earths are vital for defense technology."
            ]
        },
        {
            "headline": "EAEU in Talks for Free Trade Agreement With India: Russian Deputy PM",
            "summary": "The Eurasian Economic Union (EAEU) is actively engaged in discussions for a free trade agreement with India, as confirmed by the Russian Deputy Prime Minister. This potential agreement could significantly boost trade and economic ties between India and the EAEU member states.",
            "key_points": [
                "EAEU in talks for a free trade agreement with India.",
                "Confirmed by the Russian Deputy Prime Minister.",
                "Potential to significantly boost trade and economic ties."
            ]
        },
        {
            "headline": "RBI’s Digital Currency Plan to Challenge Dollar-Centric Payment Systems: Expert",
            "summary": "An expert believes that the Reserve Bank of India's (RBI) plans for a digital currency are poised to challenge established dollar-centric payment systems. This move by India aims to reduce global reliance on the US dollar for transactions and enhance financial autonomy.",
            "key_points": [
                "RBI's digital currency plan expected to challenge dollar-centric systems.",
                "Aims to reduce global reliance on the US dollar for transactions.",
                "Enhances India's financial autonomy in international payments."
            ]
        }
    ],
    "Technology": [
        {
            "headline": "‘Consent to share’ a sham, like pact between lion and lamb: SC warns WA over personal data",
            "summary": "India's Supreme Court has strongly reprimanded WhatsApp and its parent company Meta, comparing their 'consent to share' policy to a sham agreement between a lion and a lamb. The court criticized the social media giant for violating the right to privacy of Indian citizens, upholding a previous NCLAT decision against its abuse of dominant position.",
            "key_points": [
                "SC criticizes WhatsApp/Meta's data sharing policy as a 'sham'.",
                "Court upheld NCLAT finding of abuse of dominant position.",
                "Admonished Meta for violating Indian citizens' right to privacy."
            ]
        },
        {
            "headline": "Willow by Cricbuzz to stream Team USA T20 World Cup 2026 matches free on YouTube",
            "summary": "Willow by Cricbuzz has announced that all four Team USA matches at the ICC Men’s T20 World Cup 2026 will be streamed free on YouTube. This initiative is part of major updates for the new season, which also includes a partnership with Jomboy Media for alternate telecasts and a revamped viewing experience.",
            "key_points": [
                "Willow by Cricbuzz to stream Team USA T20 World Cup matches free on YouTube.",
                "Part of major updates for the 2026 season.",
                "Partnership with Jomboy Media for alternate telecasts also announced."
            ]
        },
        {
            "headline": "Spain considers blocking kids under 16 from social media",
            "summary": "Spain is currently deliberating a proposal to ban children under the age of 16 from accessing social media platforms. This move reflects growing concerns over the impact of social media on young people's mental health and development.",
            "key_points": [
                "Spain considering social media ban for under-16s.",
                "Driven by concerns over mental health and development in youth.",
                "Reflects growing global debate on youth social media use."
            ]
        },
        {
            "headline": "Most teens have smartphones; a study finds early use raises concerns",
            "summary": "A recent study indicates that the majority of teenagers now own smartphones, with early adoption raising significant concerns. Researchers are highlighting potential negative impacts associated with early smartphone use, prompting discussions about healthier digital habits for adolescents.",
            "key_points": [
                "Most teenagers now own smartphones.",
                "Early smartphone use is raising significant concerns.",
                "Study highlights potential negative impacts on youth."
            ]
        },
        {
            "headline": "ChatGPT services back after brief outage, OpenAI says",
            "summary": "OpenAI has announced that ChatGPT services have been restored following a brief outage. The company stated that the incident was resolved and provided no further details on the cause.",
            "key_points": [
                "ChatGPT services experienced a brief outage.",
                "OpenAI confirmed services are now restored.",
                "No specific cause for the incident was provided."
            ]
        },
        {
            "headline": "NCP uses AI-generated voice, video of Ajit Pawar in zilla parishad polls, sparks debate",
            "summary": "The Nationalist Congress Party (NCP) has utilized AI-generated voice and video of Ajit Pawar to deliver an emotional appeal in the zilla parishad polls, a move that has ignited debate. This marks a notable instance of advanced AI deployment in Indian political campaigns, raising questions about ethics and regulations.",
            "key_points": [
                "NCP used AI-generated voice and video of Ajit Pawar in zilla parishad polls.",
                "Aimed to make an emotional pitch to voters.",
                "Sparks debate on AI ethics and regulations in political campaigns."
            ]
        },
        {
            "headline": "Russian Private Company Developing Reusable Rocket: Chief Designer",
            "summary": "A Russian private company is reportedly engaged in the development of a reusable rocket, as confirmed by its chief designer. This initiative signifies Russia's entry into the burgeoning commercial space sector and its pursuit of cost-effective space launch capabilities.",
            "key_points": [
                "Russian private company developing a reusable rocket.",
                "Confirmed by the chief designer of the project.",
                "Signifies Russia's entry into the commercial space sector."
            ]
        },
        {
            "headline": "More Than a Plane: SJ-100 is India's Fast Track to Aviation Self-Reliance",
            "summary": "The SJ-100 aircraft is being touted as India's fast track to aviation self-reliance, symbolizing more than just a plane. This project is expected to significantly boost India's indigenous aerospace manufacturing capabilities and reduce dependence on foreign imports.",
            "key_points": [
                "SJ-100 aircraft seen as India's path to aviation self-reliance.",
                "Aims to boost indigenous aerospace manufacturing capabilities.",
                "Expected to reduce dependence on foreign imports in aviation."
            ]
        }
    ],
    "Entertainment": [
        {
            "headline": "'The Raja Saab' box office collections day 26: Prabhas film falls to just Rs 1 lakh",
            "summary": "Prabhas's film 'The Raja Saab' has seen a significant drop in its box office performance on day 26, earning only Rs 1 lakh. This indicates a poor run at the cinemas for the highly anticipated movie.",
            "key_points": [
                "Prabhas's film 'The Raja Saab' earned only Rs 1 lakh on day 26.",
                "Significant decline in box office collections.",
                "Indicates a poor overall performance at the cinemas."
            ]
        }
    ],
    "Sports": [
        {
            "headline": "T20 World Cup: Indispensable! Why Axar Patel remains India’s unsung MVP",
            "summary": "Axar Patel has emerged as an indispensable all-rounder for India across formats, overcoming injuries and showcasing quiet excellence. His crucial all-round skills will be vital for India's T20 World Cup title defense, starting February 7th, making him an unsung MVP for the team.",
            "key_points": [
                "Axar Patel is an indispensable all-rounder for India.",
                "His career is marked by patience, excellence, and overcoming injuries.",
                "He will be a vital player in India's T20 World Cup title defense."
            ]
        },
        {
            "headline": "Chicago Bulls vs Milwaukee Bucks injury report: Key players updates for February 3, 2026 match",
            "summary": "Ahead of the February 3, 2026 game, an injury report for the Chicago Bulls vs Milwaukee Bucks match details player availability. It provides updates on who is playing, injured, or questionable, alongside team statistics and head-to-head records.",
            "key_points": [
                "Injury report for Chicago Bulls vs Milwaukee Bucks provided.",
                "Includes player status (playing, injured, questionable).",
                "Offers team statistics and head-to-head records."
            ]
        },
        {
            "headline": "Philadelphia 76ers vs Golden State Warriors injury report: Key player updates for February 3, 2026 match",
            "summary": "An injury report for the Philadelphia 76ers vs Golden State Warriors game on February 3, 2026, details player statuses including those playing, injured, or questionable. The report also covers head-to-head records and team statistics, offering a comprehensive preview of the match.",
            "key_points": [
                "Injury report for 76ers vs Warriors match.",
                "Details player availability (playing, injured, questionable).",
                "Includes head-to-head records and team stats."
            ]
        },
        {
            "headline": "Stunning prediction! 'Shreyas Iyer can captain India to a World Cup win'",
            "summary": "A 'stunning prediction' suggests that cricketer Shreyas Iyer possesses the leadership qualities to captain India to a World Cup victory. This forecast highlights his potential as a future captain for the national team and the expectations surrounding his capabilities.",
            "key_points": [
                "Prediction claims Shreyas Iyer can lead India to a World Cup win.",
                "Highlights his potential as a future national team captain.",
                "Suggests strong leadership qualities for the cricketer."
            ]
        },
        {
            "headline": "From Clarke to Yuvraj: Cricketers who battled cancer with courage",
            "summary": "The article highlights the inspiring stories of cricketers, including Michael Clarke and Yuvraj Singh, who bravely fought and recovered from cancer. Their journeys serve as powerful testaments to resilience and courage beyond the playing field.",
            "key_points": [
                "Features cricketers like Clarke and Yuvraj who battled cancer.",
                "Stories emphasize resilience and courage in their fights.",
                "Inspiring accounts of fighting serious illness beyond the sport."
            ]
        },
        {
            "headline": "201 wickets, one favourite: Tendulkar's pick will surprise you",
            "summary": "Sachin Tendulkar has revealed his favorite among bowlers with 201 wickets, a choice that is expected to surprise many. The article delves into the legendary cricketer's unexpected preference, offering insights into his perspective on bowling greats.",
            "key_points": [
                "Sachin Tendulkar names his favorite among bowlers with 201 wickets.",
                "His pick is described as surprising to many.",
                "Reveals the legendary cricketer's unexpected preference."
            ]
        },
        {
            "headline": "Asia Cup 2025: Indian-origin Jatinder Singh to led Oman",
            "summary": "Indian-origin cricketer Jatinder Singh has been appointed to lead the Oman team in the Asia Cup 2025. This significant role marks a proud moment for the Indian diaspora in cricket and highlights his leadership capabilities.",
            "key_points": [
                "Jatinder Singh, of Indian origin, to captain Oman in Asia Cup 2025.",
                "Significant leadership role for him in international cricket.",
                "Marks a proud moment for the Indian diaspora in the sport."
            ]
        },
        {
            "headline": "Diamond League Final: Neeraj Chopra's event preview, time and live telecast in India",
            "summary": "This article provides a comprehensive preview of Neeraj Chopra's participation in the Diamond League Final, including event details, timings, and information on its live telecast in India. It prepares fans for the much-anticipated performance of the Indian javelin thrower.",
            "key_points": [
                "Comprehensive preview of Neeraj Chopra's Diamond League Final event.",
                "Includes event details, timings, and live telecast information for India.",
                "Prepares fans for the anticipated performance of the Indian javelin thrower."
            ]
        },
        {
            "headline": "FIDE WC in India: PM Modi says 'Chess is gaining popularity among our youth'",
            "summary": "Prime Minister Narendra Modi, speaking at the FIDE World Championship in India, noted the increasing popularity of chess among Indian youth. His remarks highlight a growing interest in strategic board games across the country, fostering intellectual development.",
            "key_points": [
                "PM Modi comments on chess popularity at FIDE WC in India.",
                "Notes increasing interest among Indian youth.",
                "Highlights growing appeal of strategic board games in the country."
            ]
        },
        {
            "headline": "Gully To Glory: Ramandeep Singh's journey from Chandigarh to Team India via KKR",
            "summary": "The article chronicles Ramandeep Singh's inspiring journey from local streets of Chandigarh to securing a spot in Team India, with a significant stop at Kolkata Knight Riders (KKR). His story is a testament to perseverance and talent in cricket, showcasing a rise through the ranks.",
            "key_points": [
                "Ramandeep Singh's inspiring journey from Chandigarh to Team India.",
                "He progressed through Kolkata Knight Riders (KKR).",
                "His story is a testament to perseverance and talent in cricket."
            ]
        },
        {
            "headline": "Jos Buttler Exclusive Interview: I owe Jayawardene for letting me open in T20",
            "summary": "In an exclusive interview, Jos Buttler credits Mahela Jayawardene for his success as a T20 opener. Buttler reveals his gratitude towards Jayawardene's decision, which significantly impacted his career and helped him thrive in the format.",
            "key_points": [
                "Jos Buttler credits Mahela Jayawardene for his T20 opening role.",
                "Jayawardene's decision significantly impacted Buttler's career.",
                "Buttler expresses gratitude for the opportunity to open."
            ]
        },
        {
            "headline": "'We can't forget Pahalgam': Sehwag under fire for promoting IND vs PAK",
            "summary": "Virender Sehwag is facing criticism for promoting an India vs Pakistan match, with many reminding him of the Pahalgam incident. The controversy highlights sensitivities surrounding cricketing ties between the two nations, especially in light of past events.",
            "key_points": [
                "Virender Sehwag criticized for promoting an India vs Pakistan match.",
                "Criticism linked to the Pahalgam incident.",
                "Highlights sensitivities in India-Pakistan cricketing ties."
            ]
        },
        {
            "headline": "Sehwag junior arrives! Aaryavir Sehwag smashes boundaries for fun",
            "summary": "Aaryavir Sehwag, son of legendary cricketer Virender Sehwag, is making headlines for his boundary-hitting prowess, reminiscent of his father. His impressive performance suggests a promising future in cricket, following in his father's footsteps.",
            "key_points": [
                "Aaryavir Sehwag, Virender Sehwag's son, makes headlines.",
                "Known for his boundary-hitting prowess, similar to his father.",
                "Suggests a promising future in cricket for the young player."
            ]
        },
        {
            "headline": "'Two reasons': Why was Dhoni promoted over Yuvraj? Sachin breaks silence",
            "summary": "Sachin Tendulkar has finally broken his silence, revealing 'two reasons' behind Mahendra Singh Dhoni's promotion over Yuvraj Singh in a crucial match. This disclosure sheds light on a long-standing cricketing debate and tactical decisions made during that period.",
            "key_points": [
                "Sachin Tendulkar reveals 'two reasons' for Dhoni's promotion over Yuvraj.",
                "Breaks silence on a long-standing cricketing debate.",
                "Sheds light on tactical decisions in a crucial match."
            ]
        },
        {
            "headline": "Hanuma Vihari joins Tripura after leaving Andhra Pradesh",
            "summary": "Cricketer Hanuma Vihari has made a significant move, joining the Tripura cricket team after his departure from Andhra Pradesh. This transfer is expected to bring new dynamics to both his career and the Tripura team's performance in domestic cricket.",
            "key_points": [
                "Hanuma Vihari joins Tripura cricket team.",
                "Moved after leaving Andhra Pradesh.",
                "Expected to bring new dynamics to his career and the team."
            ]
        },
        {
            "headline": "'I have to go back again ... ': Rohit Sharma opens up",
            "summary": "Rohit Sharma has candidly spoken about his future, hinting at a potential return to a past endeavor or team, stating, 'I have to go back again...' His statement has fueled speculation among fans and commentators alike regarding his next career move.",
            "key_points": [
                "Rohit Sharma hints at a potential return to a past endeavor.",
                "His statement 'I have to go back again...' sparks speculation.",
                "Fuels discussion among fans and commentators regarding his next career move."
            ]
        },
        {
            "headline": "Sarfaraz on fire! Back-to-back tons send strong message to selectors",
            "summary": "Sarfaraz Khan has delivered impressive back-to-back centuries, sending a strong message to national selectors. His consistent high-scoring performances are making a compelling case for his inclusion in higher-level cricket, showcasing his form.",
            "key_points": [
                "Sarfaraz Khan scores back-to-back centuries.",
                "Strong message sent to national selectors.",
                "Making a compelling case for higher-level cricket inclusion."
            ]
        },
        {
            "headline": "KCL thriller: Samson smashes century, but Muhammad steals show – Watch",
            "summary": "In a thrilling KCL match, Sanju Samson's magnificent century was overshadowed as Muhammad's performance 'stole the show.' The article invites viewers to watch highlights of the game's dramatic finish, emphasizing Muhammad's impact.",
            "key_points": [
                "Sanju Samson scored a magnificent century in a KCL match.",
                "Muhammad's performance 'stole the show', overshadowing Samson's century.",
                "The match was a thriller with a dramatic finish."
            ]
        }
    ],
    "Science": [
        {
            "headline": "97 million-year-old fossils suggest early animals navigated using Earth’s magnetic field",
            "summary": "Recent fossil discoveries, dating back 97 million years, indicate that some of the earliest animals on Earth possessed the ability to navigate using the planet's magnetic field. This finding provides new insights into the evolutionary history of animal navigation.",
            "key_points": [
                "Fossils from 97 million years ago reveal early animal navigation.",
                "Early animals navigated using Earth's magnetic field.",
                "Advances understanding of the evolutionary history of animal navigation."
            ]
        },
        {
            "headline": "Artemis II mission delayed: NASA postpones Moon journey due to rocket fuel leaks",
            "summary": "NASA has announced a delay for its Artemis II mission, pushing back the planned journey to the Moon. The postponement is attributed to persistent rocket fuel leaks, which need to be resolved before the mission can safely proceed.",
            "key_points": [
                "NASA's Artemis II Moon mission delayed.",
                "Postponement due to persistent rocket fuel leaks.",
                "Leaks must be resolved for mission safety."
            ]
        }
    ],
    "Health": [
        {
            "headline": "Good fasting sugar but high HbA1c: How is that possible? Doctor clears the confusion around diabetes tests",
            "summary": "A doctor explains the phenomenon of having normal fasting blood sugar levels while simultaneously showing a high HbA1c, a common point of confusion in diabetes diagnosis. The article clarifies the distinct information provided by each test and why a combination of tests offers a more complete picture of blood sugar control over time.",
            "key_points": [
                "Addresses confusion of good fasting sugar with high HbA1c.",
                "Doctor explains differences in what each diabetes test measures.",
                "Emphasizes comprehensive testing for accurate diagnosis and control."
            ]
        },
        {
            "headline": "Diabetes diet alert: Expert reveals these common foods spike your blood sugar more than sugar itself",
            "summary": "A health expert has issued a warning regarding common foods that can surprisingly elevate blood sugar levels even more significantly than direct sugar intake. This alert is crucial for individuals managing diabetes or seeking to prevent it, highlighting the importance of understanding glycemic impact beyond obvious sugary items.",
            "key_points": [
                "Expert warns about common foods spiking blood sugar more than sugar.",
                "Crucial information for diabetes management and prevention.",
                "Highlights the importance of understanding the glycemic impact of various foods."
            ]
        },
        {
            "headline": "Your urine could signal danger: Doctor explains what to watch for",
            "summary": "A doctor explains various changes in urine characteristics that could indicate underlying health problems, urging individuals to pay attention to these signals. Understanding what to watch for can help in early detection and timely medical intervention for potential health issues.",
            "key_points": [
                "Doctor details urine changes that signal potential health dangers.",
                "Urges individuals to pay attention to these physical indicators.",
                "Aids in early detection and timely medical intervention."
            ]
        }
    ]
}