{
    "World": [
        {
            "headline": "In terror acts, rights of accused subservient to national interest: Supreme Court",
            "summary": "India's Supreme Court ruled that individual rights of those accused in terror-related cases must be secondary to national interest. This significant judgment emphasizes a strong stance on national security over individual liberties in specific extreme circumstances, particularly concerning terrorism.",
            "key_points": [
                "Supreme Court prioritized national interest over individual rights for terror suspects.",
                "The ruling applies specifically to cases involving acts of terrorism.",
                "It reflects a firm judicial stance on national security."
            ]
        },
        {
            "headline": "Consider bringing back Sunali's husband, 3 others from Bangladesh: SC",
            "summary": "The Indian Supreme Court has directed authorities to consider the repatriation of Sunali's husband and three other individuals from Bangladesh. This case highlights legal complexities and humanitarian aspects of cross-border issues.",
            "key_points": [
                "SC ordered consideration for repatriation of four individuals from Bangladesh.",
                "The case involves an Indian citizen's husband and others.",
                "It underscores legal and humanitarian dimensions of international border cases."
            ]
        },
        {
            "headline": "'Rein In Israel, Or Hamas Will Strike': Arab Allies Warn U.S Over Gaza Situation | DETAILS",
            "summary": "Arab allies have reportedly issued a stern warning to the U.S., urging them to rein in Israel to prevent further escalation in Gaza. The warning suggests that failure to do so could provoke new attacks from Hamas, raising concerns about regional stability.",
            "key_points": [
                "Arab allies warned the U.S. to intervene with Israel regarding Gaza.",
                "Concerns were raised about potential new Hamas strikes if Israel is not controlled.",
                "The situation highlights growing tensions and fears of regional destabilization."
            ]
        },
        {
            "headline": "Russia Rejects Zelensky's Donbas Referendum Suggestion; 'Belongs To Us, Will Liberate The Rest'",
            "summary": "The Kremlin has firmly rejected Ukrainian President Zelensky's proposal for a referendum on the Donbas territories, asserting that the region belongs to Russia and will be fully 'liberated.' This statement underscores Russia's unwavering claim over the Donbas and a hardline stance against any democratic resolution.",
            "key_points": [
                "Kremlin rejected Zelensky's Donbas referendum proposal.",
                "Russia claims Donbas as its own territory and plans to 'liberate' it.",
                "The statement signals a continued hardline approach to the conflict."
            ]
        },
        {
            "headline": "Washington floods: Evacuations, road closures and Trump signs emergency declaration—what to know",
            "summary": "Major flooding in Washington has led to widespread evacuations and significant road closures across the region. Former President Trump has signed an emergency declaration to provide federal assistance, highlighting the severe impact of the natural disaster.",
            "key_points": [
                "Washington state is experiencing severe flooding, causing evacuations and road closures.",
                "Former President Trump issued an emergency declaration for federal aid.",
                "The declaration aims to support recovery efforts in affected areas."
            ]
        },
        {
            "headline": "EU dismisses Russia's lawsuit against Euroclear as 'speculative'",
            "summary": "The European Union has dismissed Russia's lawsuit against Euroclear as 'speculative,' amidst the EU's push to approve a reparations loan for Ukraine using frozen Russian assets. Russia's central bank has sued Euroclear, which holds €185 billion of its assets, in an attempt to recover these funds.",
            "key_points": [
                "EU rejects Russia's lawsuit against Euroclear as lacking merit.",
                "Russia is seeking to recover €185 billion in frozen assets held by Euroclear.",
                "The legal challenge comes as the EU considers using these assets for Ukraine's reparations."
            ]
        },
        {
            "headline": "Germany summons Russian ambassador over alleged election interference",
            "summary": "Germany has summoned the Russian ambassador following allegations of Russian interference in German elections. This diplomatic action highlights serious concerns within Germany about external attempts to influence its democratic processes.",
            "key_points": [
                "Germany summoned Russia's ambassador over alleged election interference.",
                "The move indicates serious concerns about Russian influence on German democracy.",
                "Allegations include cyberattacks impacting German political systems."
            ]
        },
        {
            "headline": "Gaza doctor allegedly killed hostage by injecting air into her veins",
            "summary": "A Gaza doctor is facing allegations of killing a hostage by injecting air into her veins. This shocking claim has emerged amidst ongoing conflicts and raised severe human rights concerns.",
            "key_points": [
                "A Gaza doctor is accused of killing a hostage via air injection.",
                "The allegations have surfaced during the ongoing conflict in the region.",
                "The incident raises serious human rights and ethical questions."
            ]
        },
        {
            "headline": "Zelenskyy appears in Kupyansk after Russia claimed it was occupied",
            "summary": "Ukrainian President Volodymyr Zelenskyy made an appearance in Kupyansk, directly refuting Russia's claims that the city had been fully occupied. His presence aimed to boost morale and demonstrate Ukrainian control over the contested area.",
            "key_points": [
                "Zelenskyy visited Kupyansk, countering Russian occupation claims.",
                "His presence aimed to affirm Ukrainian control and boost local morale.",
                "Kupyansk remains a contested and strategically important area."
            ]
        },
        {
            "headline": "US-seized tanker carrying Venezuelan crude sails toward Houston: Report",
            "summary": "A tanker carrying Venezuelan crude oil, previously seized by the U.S., is now reportedly en route to Houston. This development signifies ongoing U.S. enforcement actions against Venezuelan oil trade and potential impacts on global energy markets.",
            "key_points": [
                "U.S.-seized Venezuelan crude tanker is headed to Houston.",
                "The action reflects U.S. sanctions and enforcement against Venezuela's oil industry.",
                "This could have implications for global oil supplies and sanctions policy."
            ]
        },
        {
            "headline": "At UN, India Calls for a Practical Engagement With Afghan Taliban",
            "summary": "At the United Nations, India has advocated for a pragmatic engagement approach with the Afghan Taliban, emphasizing the need for realistic dialogue to address the humanitarian situation and regional stability. This stance highlights India's evolving diplomatic strategy regarding Afghanistan.",
            "key_points": [
                "India urged the UN for practical engagement with the Afghan Taliban.",
                "The call focuses on addressing humanitarian crises and regional stability.",
                "It reflects India's cautious but pragmatic diplomatic approach to Afghanistan."
            ]
        },
        {
            "headline": "Jail, fines or deportation? What Ted Cruz said about claims over Ilhan Omar’s marriage to brother",
            "summary": "Senator Ted Cruz has commented on the claims surrounding Ilhan Omar's alleged marriage to her brother, discussing potential legal repercussions such as jail time, fines, or deportation. The remarks highlight the ongoing controversy and the severe implications of such allegations.",
            "key_points": [
                "Senator Ted Cruz addressed allegations of Ilhan Omar's marriage to her brother.",
                "He outlined potential consequences including jail, fines, or deportation.",
                "The controversy continues to draw significant political attention."
            ]
        },
        {
            "headline": "Croatia purchases German-made Leopards after donating tanks to Ukraine",
            "summary": "Croatia has announced the purchase of German-made Leopard tanks, following its previous donation of tanks to Ukraine. This move signals a modernization of Croatia's military capabilities while also reflecting its continued support for Ukraine against Russian aggression.",
            "key_points": [
                "Croatia is acquiring German Leopard tanks.",
                "The purchase comes after Croatia donated tanks to Ukraine.",
                "It indicates both military modernization and ongoing support for Ukraine."
            ]
        },
        {
            "headline": "France struggles to contain cattle virus as farmers' protests spread",
            "summary": "France is facing challenges in containing a widespread cattle virus, leading to growing protests from farmers concerned about their livelihoods. The situation underscores the difficulties in managing agricultural health crises and the socio-economic impact on farming communities.",
            "key_points": [
                "France is battling to control a spreading cattle virus.",
                "Farmers are protesting due to the virus's impact on their incomes.",
                "The crisis highlights challenges in agricultural disease management."
            ]
        },
        {
            "headline": "Paris Agreement at 10: Hope for change clouded by climate reality",
            "summary": "Ten years after its inception, the Paris Agreement's promise of significant climate change mitigation is being overshadowed by grim climate realities. Despite initial hopes, global efforts appear insufficient to curb rising temperatures and extreme weather events.",
            "key_points": [
                "The Paris Agreement marks its 10th anniversary with mixed feelings.",
                "Initial hopes for climate change mitigation are clouded by current climate realities.",
                "Global efforts are proving insufficient to meet the agreement's goals."
            ]
        },
        {
            "headline": "Skydiver dangles at 4,500 metres after parachute catches on plane’s tail",
            "summary": "A skydiver experienced a terrifying ordeal, dangling at 4,500 meters after their parachute became entangled with the plane's tail. Rescuers managed a successful retrieval in a dramatic operation, avoiding what could have been a catastrophic accident.",
            "key_points": [
                "A skydiver was left dangling at 4,500 meters after a parachute malfunction.",
                "The parachute became caught on the plane's tail during the jump.",
                "Rescuers successfully rescued the individual in a high-stakes operation."
            ]
        },
        {
            "headline": "Indian-origin man charged with murder in California; was driving Tesla at 150mph before killing a 41-year-old woman",
            "summary": "An Indian-origin man in California has been charged with murder after allegedly driving his Tesla at 150mph, resulting in the death of a 41-year-old woman. The incident has raised serious questions about reckless driving and accountability.",
            "key_points": [
                "Indian-origin man charged with murder in California.",
                "He allegedly drove a Tesla at 150mph, causing a fatal accident.",
                "The case highlights concerns about extreme reckless driving."
            ]
        },
        {
            "headline": "New York house fire: Hyderabad cyber security professional dies in US; another from Telangana battling for life",
            "summary": "A cybersecurity professional from Hyderabad has tragically died in a house fire in New York, while another individual from Telangana is critically injured. The incident has sent shockwaves through the Indian expatriate community and is currently under investigation.",
            "key_points": [
                "A Hyderabad cybersecurity professional died in a New York house fire.",
                "Another person from Telangana is in critical condition.",
                "The tragedy has impacted the Indian expatriate community in the US."
            ]
        }
    ],
    "Business": [
        {
            "headline": "IndiGo crisis puts India’s two-player markets under scanner. Why it can be a trap",
            "summary": "The ongoing crisis at IndiGo has brought India's two-player airline market under scrutiny, raising concerns about potential traps for consumers and regulatory challenges. This situation highlights the vulnerabilities and competitive issues within concentrated market structures.",
            "key_points": [
                "IndiGo's crisis exposes risks in India's two-player airline market.",
                "Concerns are raised about potential consumer traps and regulatory oversight.",
                "The situation prompts a review of competitive landscapes in concentrated industries."
            ]
        },
        {
            "headline": "Cabinet clears SHANTI bill to open nuclear power to pvt sector",
            "summary": "The Indian Cabinet has approved the SHANTI bill, a landmark move aimed at opening the nuclear power sector to private players. This initiative is expected to boost energy production and attract significant investment into a previously government-dominated industry.",
            "key_points": [
                "Indian Cabinet approved SHANTI bill to privatize nuclear power.",
                "The move is expected to increase energy production.",
                "It aims to attract private investment into the nuclear sector."
            ]
        },
        {
            "headline": "FDI reform push: Cabinet clears bill to raise foreign investment in insurance to 100%; key guardrails, LIC changes included",
            "summary": "India's Cabinet has cleared a bill to increase foreign direct investment (FDI) in the insurance sector to 100%, alongside significant changes for LIC and implementing key guardrails. This reform aims to attract greater foreign capital and expertise into the Indian insurance market.",
            "key_points": [
                "Cabinet approved raising FDI in insurance to 100%.",
                "The bill includes changes for LIC and new regulatory guardrails.",
                "It seeks to attract more foreign investment and expertise to the sector."
            ]
        },
        {
            "headline": "Fidelity International acquires 6.3% stake in Meesho",
            "summary": "Fidelity International has acquired a 6.3% stake in Indian e-commerce platform Meesho, signifying growing investor confidence in India's digital market. This investment is expected to bolster Meesho's growth and expansion plans in a competitive e-commerce landscape.",
            "key_points": [
                "Fidelity International purchased a 6.3% stake in Meesho.",
                "The investment highlights confidence in India's e-commerce sector.",
                "It is expected to support Meesho's expansion and market position."
            ]
        },
        {
            "headline": "Rupee at historic low: How 9% real depreciation could reshape India’s economy - explained",
            "summary": "The Indian Rupee has fallen to a historic low, with a 9% real depreciation that could significantly reshape India's economy. This depreciation impacts imports, exports, and inflation, necessitating strategic economic adjustments.",
            "key_points": [
                "Indian Rupee reached a historic low with 9% real depreciation.",
                "The depreciation is expected to reshape India's economy.",
                "It will affect imports, exports, and inflation levels."
            ]
        },
        {
            "headline": "India Imports 38% Russian Crude Worth $3.04 Billion Despite New US Sanctions: CREA Reports",
            "summary": "India continues to import a significant volume of Russian crude oil, accounting for 38% of its total crude imports and valued at $3.04 billion, despite new US sanctions. This trend highlights India's strategic energy decisions amidst geopolitical pressures and its reliance on Russian supply.",
            "key_points": [
                "India imported 38% of its crude oil from Russia, totaling $3.04 billion.",
                "Imports persist despite new US sanctions against Russia.",
                "This reflects India's strategic energy policy and geopolitical balancing act."
            ]
        },
        {
            "headline": "India’s Corporate Bond Market Could Grow to $1.3 Trillion by 2030: NITI Aayog",
            "summary": "NITI Aayog, India's policy think tank, projects that the country's corporate bond market could expand to $1.3 trillion by 2030. This anticipated growth signals increased opportunities for corporate fundraising and a deepening of India's financial markets.",
            "key_points": [
                "India's corporate bond market is projected to reach $1.3 trillion by 2030.",
                "The forecast comes from NITI Aayog, a key policy think tank.",
                "This growth indicates expanded corporate fundraising avenues and market depth."
            ]
        },
        {
            "headline": "Diamond market outlook: Russian miner ALROSA CEO says India will adapt to US tariffs; natural stones to stay resilient as synthetic prices plunge",
            "summary": "The CEO of Russian diamond miner ALROSA stated that India is expected to adapt to new US tariffs, and natural diamond prices will remain resilient despite a plunge in synthetic diamond prices. This outlook indicates a stable demand for natural stones in the Indian market, a key player in the global diamond industry.",
            "key_points": [
                "India is anticipated to adapt to new US tariffs on diamonds.",
                "Natural diamond prices are expected to remain stable.",
                "Synthetic diamond prices have seen a significant drop."
            ]
        },
        {
            "headline": "Uber stock falls after analyst warnings: Europe adds pressure; investors react",
            "summary": "Uber's stock has experienced a decline following warnings from analysts, with additional pressure stemming from European market conditions. Investors are reacting to concerns about profitability, regulatory challenges, and competition in key international markets.",
            "key_points": [
                "Uber's stock declined after analyst warnings.",
                "European market pressures are contributing to investor concerns.",
                "Profitability and regulatory challenges are key issues."
            ]
        },
        {
            "headline": "'Let's prove them wrong': Spanish economy minister responds to US",
            "summary": "Spain's economy minister has issued a defiant response to the US, challenging negative economic projections and affirming confidence in Spain's economic resilience. This statement comes amidst global economic uncertainties and differing views on European market performance.",
            "key_points": [
                "Spanish economy minister challenged US economic skepticism.",
                "She expressed confidence in Spain's economic resilience.",
                "The statement reflects ongoing international economic debates."
            ]
        },
        {
            "headline": "Crypto king Do Kwon jailed for 15 years over $40bn stablecoin fraud",
            "summary": "Do Kwon, known as the 'crypto king,' has been sentenced to 15 years in jail for his role in a $40 billion stablecoin fraud. This landmark conviction sends a strong message to the cryptocurrency industry regarding accountability and regulatory enforcement.",
            "key_points": [
                "Crypto entrepreneur Do Kwon received a 15-year jail sentence.",
                "He was convicted for a $40 billion stablecoin fraud.",
                "The case marks a significant enforcement action in the crypto sector."
            ]
        },
        {
            "headline": "Here's why Chinese carmakers are beating the Europeans in Kazakhstan",
            "summary": "Chinese automakers are reportedly outperforming European manufacturers in the Kazakhstan market, attributed to competitive pricing, diverse models, and adaptation to local preferences. This trend highlights a shift in global automotive market dynamics and China's growing influence in Central Asia.",
            "key_points": [
                "Chinese carmakers are surpassing European rivals in Kazakhstan.",
                "Factors include competitive pricing and tailored models.",
                "This indicates a significant shift in regional automotive market dominance."
            ]
        },
        {
            "headline": "Ryanair threatens to cut 20 more EU routes over ‘sky-high’ taxes",
            "summary": "Ryanair has threatened to cut an additional 20 routes across the EU, citing 'sky-high' taxes as the primary reason. The airline's announcement underscores its ongoing dispute with European governments over operating costs and its impact on regional connectivity.",
            "key_points": [
                "Ryanair plans to cut 20 more EU routes.",
                "The decision is attributed to high taxes in European countries.",
                "This move impacts regional travel and highlights airline-government tax disputes."
            ]
        },
        {
            "headline": "Amid Russia's war in Ukraine, how much are weapons companies making?",
            "summary": "Amidst Russia's ongoing war in Ukraine, significant attention is being drawn to the profits made by weapons manufacturing companies. The conflict has led to a surge in demand for armaments, fueling debate over the ethics and economic impact of the defense industry during wartime.",
            "key_points": [
                "Weapons companies are seeing increased profits during the Russia-Ukraine war.",
                "The conflict has boosted demand for defense armaments.",
                "This raises ethical questions about wartime economic gains."
            ]
        }
    ],
    "Technology": [
        {
            "headline": "AI Express eyes IndiGo pilots, its own aviators up in arms",
            "summary": "AI Express is reportedly attempting to recruit pilots from rival IndiGo, leading to unrest among its own aviators. This aggressive recruitment strategy highlights intense competition for skilled personnel in the Indian aviation sector, exacerbated by AI Express's internal challenges.",
            "key_points": [
                "AI Express is trying to poach pilots from IndiGo.",
                "This has caused discontent among AI Express's existing pilots.",
                "The situation underscores pilot shortages and intense competition in Indian aviation."
            ]
        },
        {
            "headline": "OpenAI releases new GPT-5.2 update amid ‘code red’ reports",
            "summary": "OpenAI has launched its new GPT-5.2 update, following internal 'code red' reports suggesting significant breakthroughs and potential safety concerns. The update brings advanced capabilities, pushing the boundaries of AI language models, while also reigniting discussions on responsible AI development.",
            "key_points": [
                "OpenAI released the GPT-5.2 update.",
                "The release follows 'code red' reports indicating major AI advancements.",
                "Discussions around AI safety and responsible development are ongoing."
            ]
        },
        {
            "headline": "Trump signs executive order blocking US states from enforcing AI rules",
            "summary": "Former President Trump signed an executive order preventing individual US states from enforcing their own AI regulations, centralizing authority at the federal level. This move aims to create a uniform national approach to AI governance but could spark debate over states' rights and local innovation.",
            "key_points": [
                "Trump issued an executive order blocking state-level AI regulations.",
                "The order aims to centralize AI governance federally.",
                "It could create debate over states' autonomy in tech regulation."
            ]
        },
        {
            "headline": "Analysis: Trump's policies set to widen EU-US innovation gap",
            "summary": "An analysis suggests that Trump's proposed policies could exacerbate the innovation gap between the European Union and the United States. Such policies, particularly those related to trade and technology, might hinder transatlantic collaboration and divergent regulatory frameworks could slow down technological progress.",
            "key_points": [
                "Trump's policies are projected to increase the EU-US innovation gap.",
                "Trade and technology policies are cited as primary drivers.",
                "This could impede transatlantic tech collaboration and development."
            ]
        },
        {
            "headline": "Scale AI after Meta deal: Workers report strain; rivals rise in fast-changing market",
            "summary": "Following its deal with Meta, Scale AI is reportedly facing internal challenges, with workers reporting strain amidst a fast-evolving market where rivals are quickly emerging. This highlights the pressures on AI companies to deliver rapidly while managing workforce demands and competitive landscapes.",
            "key_points": [
                "Scale AI workers report strain after the Meta deal.",
                "The company faces rising competition in a rapidly changing market.",
                "Challenges include managing workforce demands and market pressures."
            ]
        },
        {
            "headline": "Digitised states at higher cyber risk, says report",
            "summary": "A new report indicates that increasingly digitized states are facing higher cybersecurity risks due to expanded digital infrastructure and data reliance. The findings emphasize the urgent need for robust cybersecurity measures and strategies to protect critical information and services.",
            "key_points": [
                "Digitized states are at increased risk of cyber threats.",
                "Expanded digital infrastructure contributes to vulnerability.",
                "There's an urgent need for stronger cybersecurity defenses."
            ]
        },
        {
            "headline": "Disney deal with OpenAI brings Mickey Mouse to Sora AI video tool",
            "summary": "Disney has struck a deal with OpenAI, integrating its iconic characters like Mickey Mouse into the Sora AI video tool. This collaboration signals a significant step in how AI will be used to generate creative content and intellectual property in the entertainment industry.",
            "key_points": [
                "Disney is partnering with OpenAI to use Sora AI video tool.",
                "Iconic characters like Mickey Mouse will be integrated.",
                "This collaboration marks a new era for AI in creative content generation."
            ]
        },
        {
            "headline": "Mathematicians inspire young minds at IISER Kolkata, tell students to use AI as tool but use own judgment",
            "summary": "Mathematicians at IISER Kolkata are encouraging young students to view AI as a powerful tool while stressing the importance of independent critical thinking. They advise students to leverage AI's capabilities but always apply their own judgment and reasoning, fostering a balanced approach to emerging technologies.",
            "key_points": [
                "IISER Kolkata mathematicians are inspiring students to use AI.",
                "They emphasize AI as a tool, not a replacement for human judgment.",
                "The message promotes critical thinking alongside technological adoption."
            ]
        },
        {
            "headline": "Reddit challenges Australia's new under-16 social media ban in court",
            "summary": "Reddit is challenging Australia's new law banning social media access for users under 16, taking the matter to court. The lawsuit highlights a clash between government efforts to protect minors online and platform operators' concerns over age verification feasibility and user access.",
            "key_points": [
                "Reddit is challenging Australia's under-16 social media ban in court.",
                "The law aims to restrict access for minors to online platforms.",
                "The case raises questions about age verification and internet freedom."
            ]
        }
    ],
    "Entertainment": [
        {
            "headline": "'Dhurandhar' Day 8: Ranveer–Akshaye starrer earns Rs 30 cr, weekend total hits Rs 250 cr",
            "summary": "The Ranveer Singh and Akshaye Khanna-starrer 'Dhurandhar' has amassed Rs 30 crore on its eighth day, pushing its weekend total to a massive Rs 250 crore. The film continues its strong run at the box office, indicating significant audience reception.",
            "key_points": [
                "'Dhurandhar' earned Rs 30 crore on Day 8.",
                "Its weekend total reached an impressive Rs 250 crore.",
                "The film, starring Ranveer Singh and Akshaye Khanna, is a box office success."
            ]
        },
        {
            "headline": "Amitabh Bachchan says Abhishek Bachchan brings ‘pride and respect’; asks ‘what have I done to be deserving?’",
            "summary": "Legendary actor Amitabh Bachchan expressed immense pride and respect for his son Abhishek Bachchan, humbly questioning his own deservingness of such happiness. This heartfelt sentiment underscores the deep bond and mutual admiration within the Bachchan family.",
            "key_points": [
                "Amitabh Bachchan voiced pride and respect for Abhishek Bachchan.",
                "He humbly questioned his own deservingness of such joy.",
                "The statement highlighted the strong family bond and mutual admiration."
            ]
        },
        {
            "headline": "‘Tere Ishk Mein’ box office collection day 15: Kriti Sanon and Dhanush’s romantic drama sees major drop amid 'Dhurandhar' success; enters week 3 with Rs 109.80 crore collection",
            "summary": "Kriti Sanon and Dhanush's romantic drama ‘Tere Ishk Mein’ has entered its third week with a collection of Rs 109.80 crore, despite a significant drop in earnings on Day 15. The film's performance has been impacted by the strong competition from 'Dhurandhar'.",
            "key_points": [
                "‘Tere Ishk Mein’ entered its third week with Rs 109.80 crore.",
                "The film saw a major drop in box office collection on Day 15.",
                "Its performance was affected by the success of 'Dhurandhar'."
            ]
        },
        {
            "headline": "'Zootopia 2' hits USD 1 billion in just 17 days",
            "summary": "Disney's animated sequel 'Zootopia 2' has achieved a remarkable feat, grossing USD 1 billion worldwide in just 17 days since its release. This rapid box office success establishes it as one of the fastest animated films to reach this significant milestone.",
            "key_points": [
                "'Zootopia 2' crossed USD 1 billion worldwide.",
                "It achieved this milestone in only 17 days.",
                "The film is a major box office success for Disney."
            ]
        },
        {
            "headline": "BB19 Success Party: Salman, Gaurav, Farrhana, Tanya arrive in style",
            "summary": "The success party for 'Bigg Boss 19' saw a star-studded attendance, with Salman Khan, Gaurav, Farrhana, and Tanya arriving in glamorous style. The event celebrated the show's achievements and offered a glimpse into the celebrity's fashion choices.",
            "key_points": [
                "Bigg Boss 19's success party featured Salman Khan and other stars.",
                "Celebrities including Gaurav, Farrhana, and Tanya attended in style.",
                "The event celebrated the show's success and showcased celebrity fashion."
            ]
        },
        {
            "headline": "TGIKS4: Priyanka Chopra shakes a leg with Navjot Singh Sidhu",
            "summary": "Priyanka Chopra was seen shaking a leg with Navjot Singh Sidhu on the set of 'The Great Indian Kapil Show Season 4,' creating a memorable moment for fans. This unexpected celebrity pairing added a lively touch to the popular comedy program.",
            "key_points": [
                "Priyanka Chopra danced with Navjot Singh Sidhu on TGIKS4.",
                "The moment was a highlight for fans of the show.",
                "The celebrity interaction added a lively element to the comedy program."
            ]
        },
        {
            "headline": "Eurovision champion Nemo returns trophy to protest Israel's inclusion",
            "summary": "Eurovision champion Nemo has publicly returned their trophy in protest of Israel's participation in the song contest. This symbolic act highlights growing political tensions and calls for boycotts within international cultural events.",
            "key_points": [
                "Eurovision winner Nemo returned their trophy.",
                "The act was a protest against Israel's inclusion in the contest.",
                "It reflects increasing political activism in cultural events."
            ]
        },
        {
            "headline": "TIME Person of the Year 2025 announced – and it’s not a person",
            "summary": "TIME Magazine has announced its Person of the Year for 2025, with the surprising revelation that it is not an individual person. This unconventional choice is expected to spark wide discussion and reflect a broader cultural or societal shift recognized by the publication.",
            "key_points": [
                "TIME Magazine's 2025 Person of the Year is not an individual.",
                "The unconventional choice is expected to spark debate.",
                "It likely reflects a broader cultural or societal recognition."
            ]
        }
    ],
    "Sports": [
        {
            "headline": "Watch: Kolkata erupts as Lionel Messi touches down at 2.26am",
            "summary": "Kolkata witnessed a massive outpouring of excitement as football superstar Lionel Messi touched down at 2:26 AM, greeted by an ecstatic crowd. His arrival has electrified the city, anticipating his participation in a highly awaited football event.",
            "key_points": [
                "Lionel Messi arrived in Kolkata at 2:26 AM.",
                "He was met by a huge, enthusiastic crowd.",
                "His visit has generated immense excitement for an upcoming football event."
            ]
        },
        {
            "headline": "Stunning prediction! 'Shreyas Iyer can captain India to a World Cup win'",
            "summary": "A bold prediction suggests that Indian cricketer Shreyas Iyer has the potential to lead India to a World Cup victory. This forecast highlights his growing stature and leadership qualities within the national team.",
            "key_points": [
                "Shreyas Iyer is predicted to captain India to a World Cup win.",
                "The prediction underscores his leadership potential.",
                "It reflects his rising prominence in Indian cricket."
            ]
        },
        {
            "headline": "Diamond League Final: Neeraj Chopra's event preview, time and live telecast in India",
            "summary": "An event preview for Neeraj Chopra's participation in the Diamond League Final includes details on its scheduled time and live telecast information for Indian viewers. All eyes are on the Olympic gold medalist as he aims for another strong performance on the international stage.",
            "key_points": [
                "Preview available for Neeraj Chopra's Diamond League Final event.",
                "Includes broadcast times and live telecast details for India.",
                "Chopra is expected to deliver another strong performance."
            ]
        },
        {
            "headline": "'Two reasons': Why was Dhoni promoted over Yuvraj? Sachin breaks silence",
            "summary": "Sachin Tendulkar has finally broken his silence, revealing 'two reasons' behind MS Dhoni's promotion ahead of Yuvraj Singh in a crucial match. His insights shed light on a long-debated strategic decision in Indian cricket history.",
            "key_points": [
                "Sachin Tendulkar explained Dhoni's promotion over Yuvraj.",
                "He cited 'two reasons' for the strategic decision.",
                "The revelation addresses a long-standing question in Indian cricket."
            ]
        },
        {
            "headline": "Bryse Wilson joins the Philadelphia Phillies after the struggles with the Chicago White Sox and limited success",
            "summary": "Pitcher Bryse Wilson has signed with the Philadelphia Phillies, seeking a fresh start after a period of struggles with the Chicago White Sox and limited success. The move hopes to revitalize his career within a new team environment.",
            "key_points": [
                "Bryse Wilson joined the Philadelphia Phillies.",
                "He is looking for a fresh start after struggling with the White Sox.",
                "The move aims to revitalize his baseball career."
            ]
        },
        {
            "headline": "Paige Bueckers and Caitlin Clark combined net worth in 2025: WNBA legends, career, family, business and more",
            "summary": "The combined net worth of WNBA stars Paige Bueckers and Caitlin Clark in 2025 is being analyzed, considering their burgeoning careers, endorsements, and ventures. Both players are emerging as influential figures both on and off the court.",
            "key_points": [
                "Combined net worth of WNBA stars Paige Bueckers and Caitlin Clark is under review.",
                "Their careers, endorsements, and business ventures contribute to their wealth.",
                "Both players are influential figures in women's basketball."
            ]
        },
        {
            "headline": "Christian McCaffrey injury update: Will the 49ers star push through illness to play Titans in Week 15?",
            "summary": "An injury update on 49ers star Christian McCaffrey focuses on whether he will overcome an illness to play against the Titans in Week 15. His potential absence could significantly impact the 49ers' offensive strategy for the crucial game.",
            "key_points": [
                "Christian McCaffrey is battling an illness ahead of Week 15.",
                "His participation against the Titans is uncertain.",
                "His status is critical for the 49ers' game plan."
            ]
        }
    ],
    "Science": [
        {
            "headline": "The day the world will go dark: Scientists warn it could happen sooner than you think",
            "summary": "Scientists are issuing warnings about the possibility of a global blackout, suggesting it could occur sooner than previously anticipated due to various astronomical or geopolitical events. The implications for society and infrastructure would be profound, necessitating preparedness.",
            "key_points": [
                "Scientists warn of a potential global blackout.",
                "The event could happen sooner than expected due to various factors.",
                "Such an event would have profound societal and infrastructural impacts."
            ]
        },
        {
            "headline": "Russia Plans to Launch Its Cancer Vaccine in 2026",
            "summary": "Russia has announced plans to launch its own cancer vaccine in 2026, marking a significant development in medical research and public health. This initiative aims to provide a new tool in the global fight against various forms of cancer.",
            "key_points": [
                "Russia plans to introduce its cancer vaccine in 2026.",
                "This represents a major advancement in cancer research.",
                "The vaccine aims to contribute to global cancer treatment efforts."
            ]
        },
        {
            "headline": "​5 animals that have unique superpowers like none other in the world​",
            "summary": "A feature highlights five animals possessing extraordinary abilities, likened to superpowers, that are unmatched in the natural world. These unique adaptations showcase the incredible diversity and evolutionary marvels of the animal kingdom.",
            "key_points": [
                "Five animals with unique abilities akin to superpowers are featured.",
                "These abilities demonstrate extraordinary adaptations in nature.",
                "The article highlights evolutionary marvels within the animal kingdom."
            ]
        },
        {
            "headline": "​5 longest animals found across the world​",
            "summary": "An article explores the five longest animals discovered globally, detailing their impressive lengths and habitats. This compilation sheds light on some of Earth's most colossal creatures and their ecological roles.",
            "key_points": [
                "The article lists the five longest animals found worldwide.",
                "It details their impressive lengths and natural habitats.",
                "The focus is on Earth's colossal creatures and their ecological significance."
            ]
        }
    ],
    "Health": [
        {
            "headline": "King Charles cancer: All we know about his present condition and treatment",
            "summary": "Updates on King Charles's cancer diagnosis provide details on his current condition and ongoing treatment. The public continues to monitor the health of the monarch, with royal doctors providing carefully released information on his progress.",
            "key_points": [
                "Information provided on King Charles's current cancer condition.",
                "Details are shared regarding his ongoing treatment plan.",
                "The public remains updated on the monarch's health status."
            ]
        },
        {
            "headline": "Can blocked stents stay stable for years? Top doctors answer this",
            "summary": "Leading medical experts address the question of whether blocked stents can maintain stability for several years. Their insights provide crucial information for patients with cardiovascular conditions, guiding expectations regarding long-term stent performance and necessary medical follow-up.",
            "key_points": [
                "Top doctors discuss the long-term stability of blocked stents.",
                "Insights are crucial for patients with cardiovascular conditions.",
                "It provides guidance on stent performance and follow-up care."
            ]
        },
        {
            "headline": "Harvard gastroenterologist warns! 7 breakfast habits that are harming your gut every morning",
            "summary": "A Harvard gastroenterologist has issued a warning about seven common breakfast habits that are detrimental to gut health. The expert advises on simple dietary adjustments to promote a healthier digestive system and overall well-being.",
            "key_points": [
                "A Harvard expert identified 7 harmful breakfast habits for gut health.",
                "The warning highlights common practices that negatively affect digestion.",
                "Recommendations are provided for healthier morning eating habits."
            ]
        },
        {
            "headline": "Struggling to sleep with sinus issues? Try these sleeping positions that can improve sinus breathing at night",
            "summary": "For individuals suffering from sinus issues affecting sleep, certain sleeping positions can significantly improve breathing and provide relief. Adopting these specific postures can help alleviate congestion and lead to a more restful night's sleep.",
            "key_points": [
                "Specific sleeping positions can aid those with sinus issues.",
                "These positions aim to improve breathing and reduce congestion.",
                "Adopting them can lead to a more restful night's sleep."
            ]
        },
        {
            "headline": "The biggest pushup mistakes that make them useless",
            "summary": "Common mistakes made during pushups can render the exercise ineffective and even lead to injury. Understanding and correcting these errors is crucial for maximizing the benefits of this foundational strength-building movement.",
            "key_points": [
                "Many people make pushup mistakes that reduce effectiveness.",
                "Incorrect form can lead to injury and minimize benefits.",
                "Correcting these errors is crucial for optimal results."
            ]
        },
        {
            "headline": "5 vegetables that are healthier raw than cooked",
            "summary": "Certain vegetables retain more nutritional value when consumed raw rather than cooked due to the preservation of heat-sensitive vitamins and enzymes. Incorporating these five vegetables uncooked can enhance one's diet and provide maximum health benefits.",
            "key_points": [
                "Five specific vegetables are healthier raw than cooked.",
                "Raw consumption preserves heat-sensitive vitamins and enzymes.",
                "Incorporating them uncooked can boost dietary nutrition."
            ]
        },
        {
            "headline": "China's new 'condom tax' prompts scepticism, fear over health risks",
            "summary": "China's introduction of a new 'condom tax' has met with widespread skepticism and raised fears over potential public health risks. Critics worry that the tax could discourage condom use, leading to increased rates of STIs and unintended pregnancies.",
            "key_points": [
                "China implemented a new 'condom tax'.",
                "The tax is met with skepticism and concerns about public health.",
                "Critics fear it could increase STIs and unintended pregnancies."
            ]
        },
        {
            "headline": "Vegetarian and vegan diets can be healthy for kids, study finds",
            "summary": "A new study has concluded that well-planned vegetarian and vegan diets can be perfectly healthy and nutritionally adequate for children. This research provides reassurance for parents considering plant-based diets for their families, emphasizing the importance of proper meal planning.",
            "key_points": [
                "Study confirms well-planned vegetarian/vegan diets are healthy for children.",
                "The research reassures parents opting for plant-based diets.",
                "Proper meal planning is key for nutritional adequacy in kids."
            ]
        },
        {
            "headline": "Slow tapering and therapy can help people quit antidepressants: study",
            "summary": "A recent study suggests that a gradual reduction (tapering) of antidepressants combined with therapy can effectively help individuals discontinue medication. This approach offers a safer and more supported pathway for those seeking to cease antidepressant use, minimizing withdrawal symptoms.",
            "key_points": [
                "Gradual tapering of antidepressants, combined with therapy, aids cessation.",
                "This method offers a safer way to discontinue medication.",
                "It helps minimize withdrawal symptoms for individuals."
            ]
        }
    ]
}