{
    "World": [
        {
            "headline": "'Operation Hawkeye Strike': US carries out 'large-scale' airstrikes in Syria; targets ISIS",
            "summary": "The US military conducted significant airstrikes in Syria, targeting ISIS infrastructure as part of \"Operation Hawkeye Strike.\" These actions are reportedly in retaliation for a recent ISIS ambush in Palmyra.",
            "key_points": [
                "US launched \"large-scale\" airstrikes in Syria.",
                "Targets were identified as ISIS.",
                "Actions are a response to an ISIS ambush."
            ]
        },
        {
            "headline": "'WILL FIRE ORESHNIK': Russia Threatens Europe; Putin Aide Blasts Macron Over Ukraine 'BULLS**T'",
            "summary": "Russia has issued a stark warning to Europe, threatening to deploy its Oreshnik missile system. A Putin aide also vehemently criticized French President Macron's stance on Ukraine, escalating tensions.",
            "key_points": [
                "Russia threatens Europe with \"Oreshnik\" missile deployment.",
                "Putin's aide strongly criticized French President Macron.",
                "Tensions are escalating between Russia and Europe over Ukraine."
            ]
        },
        {
            "headline": "Iran Captures 200 ‘Israeli-American Terror Organisers’; Trump ‘READY’ for ‘Iranian Mission’ |DETAILS",
            "summary": "Iran claims to have apprehended 200 individuals identified as \"Israeli-American terror organisers.\" Concurrently, former US President Trump has declared he is \"ready\" for an \"Iranian Mission,\" indicating potential US action.",
            "key_points": [
                "Iran claims to have captured \"Israeli-American terror organisers\".",
                "Former President Trump states readiness for an \"Iranian Mission\".",
                "The situation suggests escalating tensions between Iran and the US/Israel."
            ]
        },
        {
            "headline": "How Donald Trump’s ‘Donroe Doctrine’ is shaking global order",
            "summary": "Donald Trump's \"Donroe Doctrine\" is presented as a new foreign policy approach that is significantly impacting and reshaping the established global order. This doctrine outlines a distinct stance on international relations and alliances.",
            "key_points": [
                "Donald Trump's \"Donroe Doctrine\" is influencing global order.",
                "The doctrine represents a new approach to foreign policy.",
                "It is causing a significant shake-up in international relations."
            ]
        },
        {
            "headline": "BRICS POWERPLAY: Russia, China, Iran Unite In Africa As Trump Goes Berserk From East To West",
            "summary": "BRICS nations, specifically Russia, China, and Iran, are reportedly strengthening their unity and influence in Africa. This move comes as former US President Trump is depicted as reacting strongly to global developments from various directions.",
            "key_points": [
                "Russia, China, and Iran are uniting under BRICS in Africa.",
                "This signifies a shift in global power dynamics.",
                "The development is framed against Trump's strong reactions to international events."
            ]
        },
        {
            "headline": "One Hundred People Killed in US Attack on Venezuela: Interior Minister",
            "summary": "Venezuela's Interior Minister claims that 100 people were killed in a recent US attack on the country. This statement, if verified, highlights a severe escalation in US-Venezuela relations and potential civilian casualties.",
            "key_points": [
                "Venezuela claims 100 killed in US attack.",
                "Statement from Interior Minister.",
                "Suggests severe escalation in US-Venezuela tensions."
            ]
        },
        {
            "headline": "UK Allocates $270Mln to Prepare for Possible Troop Deployment in Ukraine",
            "summary": "The United Kingdom has allocated $270 million to enhance its readiness for a potential deployment of troops to Ukraine. This significant financial commitment signals a heightened level of involvement and preparation in the ongoing conflict.",
            "key_points": [
                "UK allocated $270 million for Ukraine troop deployment.",
                "Funds are for preparation and readiness.",
                "Indicates increased UK involvement in the conflict."
            ]
        },
        {
            "headline": "North Korea Shoots Down South Korean Surveillance Drone After 8km Incursion: Reports",
            "summary": "North Korea has reportedly shot down a South Korean surveillance drone following an 8km incursion into its airspace. This incident marks a significant escalation of tensions on the Korean Peninsula.",
            "key_points": [
                "North Korea shot down a South Korean drone.",
                "Incident followed an 8km incursion.",
                "Marks an escalation of tensions on the Korean Peninsula."
            ]
        },
        {
            "headline": "India Rejects US Commerce Secretary's Claim on PM Modi",
            "summary": "India has officially rejected a claim made by the US Commerce Secretary regarding Prime Minister Modi. This public rebuttal underscores a diplomatic disagreement and India's firm stance on the matter.",
            "key_points": [
                "India rejected a claim by US Commerce Secretary.",
                "Claim was related to PM Modi.",
                "Highlights a diplomatic disagreement."
            ]
        },
        {
            "headline": "India Doubles Down on Multipolarity Amid US Attacks on Multilateral Groupings",
            "summary": "India is increasingly emphasizing a multipolar world order, pushing back against perceived US attempts to undermine multilateral groupings. This stance reaffirms India's independent foreign policy and its vision for global power distribution.",
            "key_points": [
                "India advocates for a multipolar world.",
                "Pushing back against perceived US actions on multilateral groups.",
                "Reaffirms India's independent foreign policy."
            ]
        },
        {
            "headline": "India Concerned by Developments in Venezuela: Jaishankar",
            "summary": "India's External Affairs Minister Jaishankar has expressed concern over the recent developments in Venezuela. This statement indicates India's interest in regional stability and its diplomatic engagement with the evolving situation.",
            "key_points": [
                "Jaishankar expressed concern over Venezuela.",
                "Highlights India's interest in regional stability.",
                "Demonstrates India's diplomatic engagement."
            ]
        },
        {
            "headline": "Kim Jong-Un Reaffirms North Korea's Support For Russia in a Letter to Putin",
            "summary": "North Korean leader Kim Jong-Un has reiterated his country's support for Russia in a formal letter to President Putin. This reaffirmation strengthens the ties between the two nations amidst ongoing international scrutiny.",
            "key_points": [
                "Kim Jong-Un reaffirmed support for Russia.",
                "Done via a letter to President Putin.",
                "Strengthens ties between North Korea and Russia."
            ]
        },
        {
            "headline": "Russian Air Defenses Shoot Down 129 Ukrainian Drones: MoD",
            "summary": "The Russian Ministry of Defense reported that its air defense systems successfully shot down 129 Ukrainian drones across various regions. This indicates ongoing aerial combat and Russia's defensive operations.",
            "key_points": [
                "Russian air defenses shot down 129 Ukrainian drones.",
                "Reported by the Ministry of Defense.",
                "Indicates ongoing aerial combat."
            ]
        },
        {
            "headline": "Ukraine Losses Over 425 Soldiers in Battles With Russian Forces: MoD",
            "summary": "Ukraine has reportedly sustained losses of over 425 soldiers in recent battles against Russian forces, according to the Russian Ministry of Defense. These figures highlight the intensity of the ongoing conflict.",
            "key_points": [
                "Ukraine reportedly lost over 425 soldiers.",
                "Losses occurred in battles with Russian forces.",
                "Figures reported by Russian MoD."
            ]
        },
        {
            "headline": "Shadow minister Priti Patel calls for UK intervention to protect Hindus in Bangladesh",
            "summary": "UK Shadow Minister Priti Patel has urged for British intervention to safeguard the Hindu minority in Bangladesh. Her call highlights concerns over religious freedom and human rights in the region.",
            "key_points": [
                "UK Shadow Minister Priti Patel called for intervention in Bangladesh.",
                "Aim is to protect Hindu minorities.",
                "Raises concerns about religious freedom."
            ]
        },
        {
            "headline": "Indian envoy to Bangladesh meets new BNP chief Tarique",
            "summary": "India's envoy to Bangladesh held a meeting with Tarique Rahman, the newly appointed chief of the Bangladesh Nationalist Party (BNP). This diplomatic engagement signifies ongoing bilateral relations and discussions.",
            "key_points": [
                "Indian envoy met Bangladesh's new BNP chief.",
                "Meeting involved Tarique Rahman.",
                "Highlights diplomatic engagement between the two nations."
            ]
        }
    ],
    "Business": [
        {
            "headline": "State leaders ask for GST comp, capex aid in pre-Budget talks with Sitharaman",
            "summary": "State leaders engaged in pre-Budget discussions with Finance Minister Sitharaman, primarily seeking compensation for Goods and Services Tax (GST) and increased capital expenditure aid. These discussions aim to address fiscal concerns and development needs ahead of the Union Budget.",
            "key_points": [
                "State leaders held pre-Budget talks with Finance Minister Sitharaman.",
                "Key demands included GST compensation and capital expenditure aid.",
                "Discussions focused on state fiscal burdens and development."
            ]
        },
        {
            "headline": "Explained: How a possible 500% tariff could 'stop' all India exports to US",
            "summary": "An analysis details how a potential 500% tariff imposed by the US could effectively halt all Indian exports to the United States. Such a drastic measure would have severe repercussions for India's economy and trade relations.",
            "key_points": [
                "A 500% US tariff could stop India's exports.",
                "This would have severe economic repercussions for India.",
                "The analysis highlights significant trade risk."
            ]
        },
        {
            "headline": "Techno Paints plans to raise Rs 500 crore via IPO in FY27",
            "summary": "Techno Paints, an Indian company, has announced its intentions to raise Rs 500 crore through an Initial Public Offering (IPO) in the financial year 2027. This move aims to fuel the company's expansion and growth initiatives.",
            "key_points": [
                "Techno Paints plans a Rs 500 crore IPO.",
                "The IPO is scheduled for FY27.",
                "Funds will support company expansion and growth."
            ]
        },
        {
            "headline": "No tax relief for Flipkart co-founder Binny Bansal",
            "summary": "Flipkart co-founder Binny Bansal will not receive any tax relief, according to recent developments. This decision impacts his financial dealings and could set a precedent for similar high-profile cases.",
            "key_points": [
                "Binny Bansal denied tax relief.",
                "The decision impacts his financial situation.",
                "It could set a precedent for future cases."
            ]
        },
        {
            "headline": "Sebi chief hints at nod for NSE IPO",
            "summary": "The Securities and Exchange Board of India (SEBI) chief has provided indications that the regulator might soon approve the Initial Public Offering (IPO) for the National Stock Exchange (NSE). This move would be a significant development for India's capital markets.",
            "key_points": [
                "SEBI chief hinted at NSE IPO approval.",
                "This would be a major development for Indian capital markets.",
                "Approval is expected soon from the regulator."
            ]
        },
        {
            "headline": "Indian Railways timetable 2026: 549 trains sped up, 122 new added; what TAG 2026 means for passengers",
            "summary": "Indian Railways has updated its timetable for 2026, accelerating 549 trains and introducing 122 new services. This \"TAG 2026\" initiative aims to improve efficiency and connectivity for passengers across the country.",
            "key_points": [
                "Indian Railways updated its 2026 timetable.",
                "549 trains sped up, 122 new trains added.",
                "\"TAG 2026\" aims for improved efficiency and connectivity."
            ]
        },
        {
            "headline": "Service charge row: CCPA cracks down on 27 restaurants for mandatory levy; refunds, penalties ordered",
            "summary": "The Central Consumer Protection Authority (CCPA) has taken action against 27 restaurants for mandating service charges. The crackdown has resulted in orders for refunds to affected customers and the imposition of penalties on the establishments.",
            "key_points": [
                "CCPA cracked down on 27 restaurants.",
                "Action taken for mandatory service charges.",
                "Refunds and penalties were ordered."
            ]
        },
        {
            "headline": "NuScale Power shares rise on Bank of America upgrade: Investors optimistic",
            "summary": "NuScale Power's shares have seen a significant increase following an upgrade from Bank of America, signaling investor optimism. This positive outlook reflects confidence in the company's future performance and technology.",
            "key_points": [
                "NuScale Power shares rose.",
                "Rise followed a Bank of America upgrade.",
                "Investors show optimism in the company."
            ]
        },
        {
            "headline": "US Oil Embargo Threatens Well-Being of Millions of Venezuelans: Russian Official",
            "summary": "A Russian official has stated that the US oil embargo against Venezuela poses a significant threat to the well-being of millions of Venezuelan citizens. The embargo's impact on the country's economy and social stability is a growing concern.",
            "key_points": [
                "US oil embargo threatens Venezuelans' well-being.",
                "Statement from a Russian official.",
                "Raises concerns about economic and social stability in Venezuela."
            ]
        },
        {
            "headline": "US Actions in Venezuela Threaten Global Supply Chain Stability: Chinese Foreign Ministry",
            "summary": "The Chinese Foreign Ministry has voiced concerns that US actions in Venezuela could destabilize global supply chains. This statement underscores the interconnectedness of international trade and the potential broader economic consequences of geopolitical tensions.",
            "key_points": [
                "Chinese FM warns on US actions in Venezuela.",
                "Actions threaten global supply chain stability.",
                "Highlights broader economic consequences of geopolitics."
            ]
        }
    ],
    "Technology": [
        {
            "headline": "1st Isro launch of '26 will put another 'eye in the sky' tomorrow",
            "summary": "India's space agency, ISRO, is set for its first launch of 2026, which will deploy a new satellite designed as an \"eye in the sky.\" This mission aims to enhance India's Earth observation capabilities.",
            "key_points": [
                "ISRO's first launch of 2026 is scheduled.",
                "A new \"eye in the sky\" satellite will be deployed.",
                "The mission enhances India's Earth observation capabilities."
            ]
        },
        {
            "headline": "Elon Musk's Grok sparks global outrage: AI chatbot's explicit content triggers government crackdown",
            "summary": "Elon Musk's AI chatbot, Grok, has ignited global controversy due to its explicit content, prompting government crackdowns in several regions. The incident highlights concerns over AI content moderation and regulatory oversight.",
            "key_points": [
                "Grok AI chatbot caused global outrage.",
                "Explicit content led to government crackdowns.",
                "Raises concerns about AI content moderation."
            ]
        },
        {
            "headline": "Meta secures Nuclear power for AI data centers: TerraPower, Oklo, Vistra Deals explained",
            "summary": "Meta has announced strategic partnerships with TerraPower, Oklo, and Vistra to secure nuclear power for its AI data centers. This move underscores the tech giant's commitment to sustainable and high-capacity energy solutions for its growing AI infrastructure.",
            "key_points": [
                "Meta partnered for nuclear power.",
                "Power will fuel AI data centers.",
                "Deals involve TerraPower, Oklo, and Vistra."
            ]
        },
        {
            "headline": "Is H-1B just a gatekeeping tool shaped by politics, price and perception?",
            "summary": "The H-1B visa program is being questioned as potentially more of a gatekeeping tool influenced by political agendas, cost factors, and public perception rather than solely a means for skilled immigration. This perspective suggests systemic issues beyond its stated purpose.",
            "key_points": [
                "H-1B visa questioned as gatekeeping tool.",
                "Influenced by politics, price, and perception.",
                "Suggests systemic issues in the program."
            ]
        },
        {
            "headline": "'Law of the Land is Supreme': India's Stern Message to X on Grok",
            "summary": "India has delivered a firm message to the social media platform X (formerly Twitter) regarding its AI chatbot Grok, asserting that \"the law of the land is supreme.\" This emphasizes India's demand for compliance with its regulations concerning digital platforms and AI content.",
            "key_points": [
                "India gave a stern message to X regarding Grok.",
                "Stated \"the law of the land is supreme\".",
                "Emphasizes compliance with Indian digital regulations."
            ]
        },
        {
            "headline": "India Should Present Unique AI Model to World: PM Modi",
            "summary": "Prime Minister Narendra Modi has advocated for India to develop and present its own unique AI model to the global community. He emphasized leveraging India's strengths to contribute distinctively to the artificial intelligence landscape.",
            "key_points": [
                "PM Modi called for India to develop a unique AI model.",
                "Aims for global presentation of this model.",
                "Emphasizes India's distinct contribution to AI."
            ]
        }
    ],
    "Entertainment": [
        {
            "headline": "'Dhurandhar' day 37: Ranveer Singh film mints Rs 5.75 crore on Sat",
            "summary": "Ranveer Singh's latest film, 'Dhurandhar,' continued its strong box office run, collecting Rs 5.75 crore on its 37th Saturday. The movie has shown consistent performance, indicating audience appreciation.",
            "key_points": [
                "Ranveer Singh's film 'Dhurandhar' earned Rs 5.75 crore on Day 37.",
                "The movie is showing strong box office performance.",
                "It reflects continued audience interest."
            ]
        },
        {
            "headline": "The Raja Saab: Prabhas film opens big but Day 2 sees a sharp drop; mixed reviews impact run",
            "summary": "Prabhas's highly anticipated film, 'The Raja Saab,' experienced a strong opening at the box office, but saw a significant drop in collections on its second day. Mixed reviews from critics and audiences are reportedly impacting its overall run.",
            "key_points": [
                "Prabhas's 'The Raja Saab' had a big opening.",
                "Day 2 collections dropped sharply.",
                "Mixed reviews are impacting the film's run."
            ]
        },
        {
            "headline": "‘Ikkis’ earns Rs 27.55 crore in 10 days",
            "summary": "The film 'Ikkis' has accumulated Rs 27.55 crore at the box office within its first 10 days of release. This collection indicates a fair performance for the movie in its initial run.",
            "key_points": [
                "'Ikkis' collected Rs 27.55 crore.",
                "Achieved this figure in 10 days.",
                "Indicates a decent box office performance."
            ]
        },
        {
            "headline": "T.K. Carter Dies At 69: Veteran actor found at California home",
            "summary": "Veteran actor T.K. Carter has passed away at the age of 69. He was found at his California home, marking the end of a long career in entertainment.",
            "key_points": [
                "Veteran actor T.K. Carter died at 69.",
                "He was found at his California residence.",
                "Marks the passing of a notable entertainment figure."
            ]
        },
        {
            "headline": "‘The Traitors Season 4’ and ‘Ponies’: Fun begins this week",
            "summary": "The fourth season of 'The Traitors' and the new show 'Ponies' are set to premiere this week, promising new entertainment for viewers. These releases are highly anticipated by their respective fan bases.",
            "key_points": [
                "'The Traitors Season 4' is launching this week.",
                "New show 'Ponies' also premieres.",
                "Both are anticipated entertainment releases."
            ]
        }
    ],
    "Sports": [
        {
            "headline": "Did ICC suggest Hyderabad, Chennai as alternate venues to Bangladesh? BCB reveals",
            "summary": "The Bangladesh Cricket Board (BCB) has disclosed information regarding potential alternate venues proposed by the ICC for upcoming matches, with Hyderabad and Chennai in India reportedly being suggested. This revelation could impact future cricket tournaments.",
            "key_points": [
                "ICC reportedly suggested Hyderabad and Chennai as alternate venues.",
                "BCB revealed this information.",
                "Could impact future international cricket tournaments."
            ]
        },
        {
            "headline": "Kohli chose to play 'easiest format'? Gill gives verdict on Manjrekar's comment",
            "summary": "Shubman Gill has offered his opinion on Sanjay Manjrekar's controversial comment suggesting Virat Kohli chose to play the \"easiest format\" of cricket. Gill's verdict adds to the ongoing debate among cricket fans and pundits.",
            "key_points": [
                "Shubman Gill responded to Manjrekar's comment on Kohli.",
                "Manjrekar suggested Kohli chose the \"easiest format\".",
                "The comment has sparked debate in the cricket world."
            ]
        },
        {
            "headline": "FIDE WC in India: PM Modi says 'Chess is gaining popularity among our youth'",
            "summary": "Prime Minister Narendra Modi has highlighted the growing popularity of chess among Indian youth, especially with the FIDE World Cup being held in India. He emphasized the sport's role in developing strategic thinking.",
            "key_points": [
                "PM Modi noted chess's growing popularity in India.",
                "Mention came during the FIDE World Cup in India.",
                "Emphasized chess for strategic thinking development."
            ]
        },
        {
            "headline": "Diamond League Final: Neeraj Chopra's event preview, time and live telecast in India",
            "summary": "Details for Neeraj Chopra's participation in the Diamond League Final, including event preview, timing, and live telecast information for Indian audiences, have been released. Fans are eagerly anticipating his performance.",
            "key_points": [
                "Neeraj Chopra to compete in Diamond League Final.",
                "Event details for Indian viewers are out.",
                "Anticipation is high for his performance."
            ]
        },
        {
            "headline": "Sarfaraz on fire! Back-to-back tons send strong message to selectors",
            "summary": "Cricketer Sarfaraz Khan has delivered back-to-back centuries, sending a powerful message to national selectors regarding his form and readiness for higher-level cricket. His impressive performance puts him in strong contention.",
            "key_points": [
                "Sarfaraz Khan scored consecutive centuries.",
                "Performance sends a strong message to selectors.",
                "He is in strong contention for selection."
            ]
        },
        {
            "headline": "'We can't forget Pahalgam': Sehwag under fire for promoting IND vs PAK",
            "summary": "Former cricketer Virender Sehwag is facing criticism for promoting an India vs. Pakistan match, with many reminding him of the Pahalgam incident. The controversy highlights sensitivities surrounding the rivalry.",
            "key_points": [
                "Virender Sehwag criticized for promoting IND vs PAK match.",
                "Criticism links back to the Pahalgam incident.",
                "Highlights sensitivities in the cricket rivalry."
            ]
        }
    ],
    "Science": [
        {
            "headline": "ISS spacewalk delayed: What's wrong with the Crew-11 astronaut and will the mission end early?",
            "summary": "A spacewalk scheduled from the International Space Station (ISS) has been postponed due to an undisclosed issue with a Crew-11 astronaut. Concerns are rising about the astronaut's condition and whether the overall mission might need to conclude prematurely.",
            "key_points": [
                "ISS spacewalk was delayed.",
                "Due to an issue with a Crew-11 astronaut.",
                "Questions arise about the mission's early conclusion."
            ]
        },
        {
            "headline": "Dogs build their vocabularies like toddlers",
            "summary": "New research suggests that dogs acquire and understand new words in a manner similar to human toddlers, gradually building their vocabulary. This discovery sheds light on canine cognitive abilities and language processing.",
            "key_points": [
                "Dogs build vocabularies like toddlers.",
                "Research shows similarities in word acquisition.",
                "Highlights canine cognitive abilities."
            ]
        },
        {
            "headline": "ASI preps for deeper digs to trace Krishna's ancient Dwarka",
            "summary": "The Archaeological Survey of India (ASI) is preparing for more extensive excavations to unearth and trace the ancient city of Dwarka, believed to be the kingdom of Lord Krishna. These deeper digs aim to provide further historical and archaeological insights.",
            "key_points": [
                "ASI plans deeper excavations for ancient Dwarka.",
                "Aims to trace Lord Krishna's kingdom.",
                "Seeks historical and archaeological insights."
            ]
        }
    ],
    "Health": [
        {
            "headline": "US Flu season intensifies: New dominant strain H3N2 subclade K drives record hospitalizations",
            "summary": "The US is experiencing an intensifying flu season, marked by a new dominant strain, H3N2 subclade K, which is leading to record levels of hospitalizations. Health authorities are urging precautions and vaccinations amidst the surge.",
            "key_points": [
                "US flu season is intensifying.",
                "H3N2 subclade K is the new dominant strain.",
                "It is causing record hospitalizations."
            ]
        },
        {
            "headline": "Glaucoma, the disease you don’t feel until you can’t see: Doctors share who is at risk and how to prevent late diagnosis",
            "summary": "Doctors are raising awareness about glaucoma, often dubbed the \"silent thief of sight,\" as it progresses without noticeable symptoms until vision loss occurs. They are providing critical information on risk factors and strategies for early detection and prevention.",
            "key_points": [
                "Glaucoma often has no early symptoms.",
                "Doctors shared risk factors and prevention tips.",
                "Early diagnosis is crucial to prevent vision loss."
            ]
        },
        {
            "headline": "Inherited cancers: Doctor reveals which ones run in families and how you can stop them early",
            "summary": "A doctor has shed light on specific types of cancers that have a hereditary component, running in families. The expert also outlined preventative measures and early intervention strategies for individuals at risk of inherited cancers.",
            "key_points": [
                "Doctor revealed cancers with hereditary links.",
                "Shared information on family-run cancers.",
                "Provided early prevention and intervention strategies."
            ]
        },
        {
            "headline": "When your chest feels like a traffic jam: Doctor explains what mucus buildup really does",
            "summary": "A doctor has explained the physiological effects of mucus buildup in the chest, describing the sensation as a \"traffic jam.\" The explanation details how this common issue impacts respiratory function and what it signifies for one's health.",
            "key_points": [
                "Doctor explained mucus buildup in the chest.",
                "Described it as a \"traffic jam\" sensation.",
                "Detailed impacts on respiratory function."
            ]
        },
        {
            "headline": "‘No clue of food poisoning’: Nepalese man dead, 6 hospitalised in Bengaluru; police suspect coal stove smoke suffocation",
            "summary": "A Nepalese man has died and six others were hospitalized in Bengaluru, initially suspected to be food poisoning, but police now suspect suffocation from coal stove smoke. Investigations are ongoing into the tragic incident.",
            "key_points": [
                "Nepalese man dead, 6 hospitalized in Bengaluru.",
                "Initial suspicion of food poisoning, now coal stove smoke.",
                "Police investigation is underway."
            ]
        },
        {
            "headline": "Man wakes from surgery speaking fluent ‘native-level’ Spanish despite only knowing how to count to 10",
            "summary": "A man who knew only basic Spanish prior to surgery remarkably woke up speaking fluent, native-level Spanish. This unusual post-surgical phenomenon is baffling doctors and generating significant medical interest.",
            "key_points": [
                "Man woke from surgery speaking fluent Spanish.",
                "He previously knew only minimal Spanish.",
                "The case is a medical mystery."
            ]
        },
        {
            "headline": "Madhya Pradesh's gaumutra, gobar cancer cure project turned into Rs 3.5cr scam: Probe reveals misuse of funds; scheme launched in 2011",
            "summary": "A project in Madhya Pradesh promoting cow urine and dung as a cancer cure, launched in 2011, has been exposed as a Rs 3.5 crore scam. A probe revealed significant misuse of funds allocated for the scheme.",
            "key_points": [
                "Cow urine and dung cancer cure project revealed as scam.",
                "Rs 3.5 crore funds misused in Madhya Pradesh.",
                "Scheme launched in 2011."
            ]
        }
    ]
}