{
    "World": [
        {
            "headline": "Ukraine’s ‘Deadliest’ Drone Strike Hits New Year Crowd, Kills 24 In Russia-Controlled Kherson",
            "summary": "A devastating drone strike in Russia-controlled Kherson on New Year's Eve resulted in 24 fatalities among celebrating crowds. Ukraine has been accused of targeting civilians, further escalating tensions in the ongoing conflict. This incident marks a significant and deadly turn in the conflict.",
            "key_points": [
                "24 people killed in a drone strike in Kherson on New Year's.",
                "Attack targeted New Year celebrants in Russia-controlled territory.",
                "Incident signifies a major escalation in the Ukraine conflict."
            ]
        },
        {
            "headline": "New Year Horror In Switzerland; Over 40 Killed, 100 Injured As Deadly Fire Engulfs Luxury Ski Resort",
            "summary": "A luxury ski resort in Switzerland was tragically engulfed by a deadly fire on New Year's Eve, resulting in over 40 deaths and 100 injuries. Investigations are underway to determine the cause of the blaze. The incident has cast a somber shadow over New Year celebrations globally.",
            "key_points": [
                "Over 40 killed and 100 injured in a Swiss luxury ski resort fire.",
                "The blaze occurred during New Year's celebrations.",
                "Investigations are ongoing to uncover the cause of the tragedy."
            ]
        },
        {
            "headline": "Europe Burns In Riots: New Year Celebrations Turn Violent; Clashes In Germany, Netherlands, France",
            "summary": "New Year's celebrations across Europe turned violent as riots and clashes erupted in major cities in Germany, the Netherlands, and France. Authorities struggled to contain the widespread unrest. These incidents highlight underlying social tensions spilling over during festive periods.",
            "key_points": [
                "New Year's celebrations in several European countries erupted into violence.",
                "Riots and clashes were reported in Germany, Netherlands, and France.",
                "The unrest points to underlying social tensions during festive periods."
            ]
        },
        {
            "headline": "Russia to Provide US Decrypted Data From Ukrainian Drone That Flew Towards Putin’s Residence",
            "summary": "Russia has announced its intention to provide the United States with decrypted data concerning a Ukrainian drone that targeted President Putin's residence. This move signals a potential diplomatic channel or an attempt to internationalize the incident's implications. The release of such data could significantly influence international perceptions of the ongoing conflict.",
            "key_points": [
                "Russia will share decrypted drone data with the US.",
                "The data concerns a Ukrainian drone targeting Putin's residence.",
                "This action could have diplomatic or international implications for the conflict."
            ]
        },
        {
            "headline": "Drone Attack on Putin’s Residence Could Have Triggered Nuclear War: Expert",
            "summary": "An expert has warned that the recent drone attack on President Putin's residence had the potential to trigger a nuclear war, underscoring the extreme fragility of global security. This assessment highlights the profound risks associated with direct attacks on national leadership in a nuclear-armed state. The incident serves as a stark reminder of escalation dangers.",
            "key_points": [
                "Expert warns drone attack on Putin's residence risked nuclear war.",
                "Incident highlights global security fragility and dangers of escalation.",
                "Direct attacks on leaders of nuclear powers carry profound risks."
            ]
        },
        {
            "headline": "Modi's Condemnation of Ukrainian Attack Against Putin's Residence Crucial: Experts",
            "summary": "Experts deem Prime Minister Modi's condemnation of the Ukrainian attack on President Putin's residence as \"crucial,\" signaling India's position on a highly sensitive international issue. India's stance reflects its independent foreign policy and could influence global diplomatic efforts. This emphasizes the weight of India's voice on the world stage.",
            "key_points": [
                "PM Modi condemned Ukraine's attack on Putin's residence.",
                "Experts view Modi's stance as crucial for India's foreign policy.",
                "India's position could impact global diplomatic efforts."
            ]
        },
        {
            "headline": "‘Pushed Bangladesh towards darkness’: Sheikh Hasina takes aim at Muhammad Yunus",
            "summary": "Bangladesh Prime Minister Sheikh Hasina has launched a strong critique against Nobel laureate Muhammad Yunus, accusing him of pushing the country towards darkness. This public attack intensifies the long-standing political rivalry between the two figures. The remarks come amid ongoing political developments in Bangladesh.",
            "key_points": [
                "Sheikh Hasina criticized Muhammad Yunus, claiming he harmed Bangladesh.",
                "The comments highlight deep-seated political animosity.",
                "The accusation was made during a period of political tension in Bangladesh."
            ]
        },
        {
            "headline": "'Act by Jan 26': Canada asks Air India for action against 'tipsy' pilot",
            "summary": "Canadian authorities have reportedly demanded that Air India take action by January 26 against a pilot accused of being \"tipsy\" before a flight. The incident raises serious safety concerns and puts pressure on the airline to ensure strict adherence to protocols. This highlights international scrutiny on aviation safety standards.",
            "key_points": [
                "Canada demanded Air India act against a \"tipsy\" pilot by Jan 26.",
                "The incident raises significant aviation safety concerns.",
                "Air India faces international pressure over its operational standards."
            ]
        },
        {
            "headline": "California delays cancellation of 17,000 immigrant commercial driver’s licences",
            "summary": "California has decided to delay the cancellation of 17,000 commercial driver's licenses held by immigrants, a move that has drawn criticism from the Trump administration. The administration argues this decision puts American citizens at risk. This highlights the ongoing debate on immigration policies and their implications.",
            "key_points": [
                "California delayed canceling 17,000 immigrant commercial driver's licenses.",
                "The Trump administration criticized the move, citing public safety risks.",
                "The decision underscores tensions in US immigration policy debates."
            ]
        },
        {
            "headline": "New Putin-Trump Phone Call to Take Place in Very Near Future: Kremlin",
            "summary": "The Kremlin has announced that a new phone call between President Putin and Donald Trump is expected to take place in the \"very near future.\" This anticipated conversation could signal potential shifts in international relations or discussions on global issues. The dialogue between the two leaders always garners significant international attention.",
            "key_points": [
                "A new phone call between Putin and Trump is expected soon.",
                "The conversation could influence international relations.",
                "Dialogue between these leaders draws significant global attention."
            ]
        }
    ],
    "Business": [
        {
            "headline": "Can India grab this $ 100 billion opportunity in medical tourism",
            "summary": "India has a significant opportunity to capture a $100 billion market in medical tourism, a sector showing immense growth potential. Leveraging its advanced healthcare infrastructure and cost-effectiveness, the country can attract more international patients. This could be a major boost for the Indian economy and healthcare industry.",
            "key_points": [
                "India eyes a $100 billion opportunity in the medical tourism sector.",
                "The country can capitalize on its healthcare infrastructure and affordability.",
                "This growth could significantly benefit India's economy and health sector."
            ]
        },
        {
            "headline": "Govt proposes 90-day work a year for gig workers to get social security",
            "summary": "The Indian government is proposing a new policy that would allow gig workers to qualify for social security benefits if they complete 90 days of work annually. This initiative aims to provide essential safety nets for the rapidly growing gig economy workforce. The move could significantly improve the welfare of millions of precarious workers.",
            "key_points": [
                "Gig workers may get social security with 90 days of annual work.",
                "The proposal aims to provide a social safety net for the gig economy.",
                "This could enhance welfare for millions of gig workers in India."
            ]
        },
        {
            "headline": "India Most Optimistic Consumer Market for 2026: Report",
            "summary": "A new report identifies India as the most optimistic consumer market for 2026, driven by rising disposable incomes and strong economic growth projections. This positive outlook suggests robust consumer spending and confidence in the coming year. The report positions India as a key player in the global economy.",
            "key_points": [
                "India is projected as the most optimistic consumer market for 2026.",
                "The outlook is fueled by rising incomes and economic growth.",
                "This indicates strong consumer spending and confidence."
            ]
        },
        {
            "headline": "India Poised to Become $26 Trillion Economy by 2047: Report",
            "summary": "A recent report projects India to become a $26 trillion economy by 2047, coinciding with 100 years of its independence. This ambitious forecast underscores significant economic growth potential and policy reforms. Achieving this milestone would solidify India's position as a global economic powerhouse.",
            "key_points": [
                "India is forecast to become a $26 trillion economy by 2047.",
                "The projection highlights massive economic growth potential.",
                "This would establish India as a major global economic force."
            ]
        },
        {
            "headline": "Indian-origin venture capitalist says she doesn't understand why billionaires are fleeing California",
            "summary": "An Indian-origin venture capitalist has expressed bewilderment regarding the exodus of billionaires from California, especially given their significant tax contributions. She questions the motivations behind this trend, which impacts the state's economic landscape. Her comments highlight concerns over the implications of wealth migration.",
            "key_points": [
                "An Indian-origin VC questions why billionaires are leaving California.",
                "She notes their substantial contribution to the state's tax base.",
                "The comments underscore concerns about wealth migration's economic impact."
            ]
        },
        {
            "headline": "Petrol, diesel vehicles eat into EV pie after GST cut",
            "summary": "Following a GST cut, the sales of petrol and diesel vehicles have seen an uptick, impacting the market share of electric vehicles (EVs). This trend suggests that price sensitivity remains a major factor for consumers in the automotive market. The shift could pose challenges for India's EV adoption goals.",
            "key_points": [
                "GST cut led to increased sales of petrol/diesel vehicles.",
                "This surge is impacting the market share of electric vehicles.",
                "Consumer price sensitivity remains a key factor in vehicle purchases."
            ]
        },
        {
            "headline": "Tax relief helps carmakers clock record sales in 2025",
            "summary": "Carmakers achieved record sales in 2025, largely attributed to significant tax relief measures. These incentives spurred consumer demand, boosting the automotive sector's performance. The record numbers indicate a strong recovery and positive sentiment in the market.",
            "key_points": [
                "Tax relief measures helped carmakers achieve record sales in 2025.",
                "Incentives fueled strong consumer demand for vehicles.",
                "The automotive sector saw significant growth and positive market sentiment."
            ]
        },
        {
            "headline": "Would India-EAEU FTA Blunt the Impact of US Tariffs?",
            "summary": "The article explores whether a Free Trade Agreement (FTA) between India and the Eurasian Economic Union (EAEU) could mitigate the effects of US tariffs on Indian trade. Such an agreement could diversify India's trade partnerships and reduce its vulnerability to protectionist measures. This strategy aims to enhance India's economic resilience in a volatile global trade environment.",
            "key_points": [
                "An India-EAEU FTA might counter US tariff impacts.",
                "The agreement could diversify India's trade relations.",
                "This strategy aims to boost India's economic resilience."
            ]
        }
    ],
    "Technology": [
        {
            "headline": "Javed Akhtar calls out his AI-generated fake video; warns to take legal action",
            "summary": "Renowned lyricist Javed Akhtar has publicly denounced an AI-generated fake video featuring him, warning of legal action. He is considering reporting the incident to cyber police, highlighting the growing concerns over deepfake technology and its misuse. This incident underscores the need for robust laws against digital impersonation.",
            "key_points": [
                "Javed Akhtar condemned an AI-generated fake video of himself.",
                "He is considering legal action and reporting it to cyber police.",
                "The incident highlights rising concerns about deepfake technology misuse."
            ]
        },
        {
            "headline": "HAL Unveils India's Next-Gen Civil Helicopter",
            "summary": "Hindustan Aeronautics Limited (HAL) has officially unveiled India's next-generation civil helicopter, marking a significant advancement in indigenous aerospace technology. This development aims to bolster India's capabilities in the aviation sector and reduce reliance on foreign manufacturers. The new helicopter could serve various civilian applications, from passenger transport to disaster relief.",
            "key_points": [
                "HAL unveiled India's next-generation civil helicopter.",
                "This advances indigenous aerospace technology and reduces foreign reliance.",
                "The helicopter is intended for diverse civilian applications."
            ]
        },
        {
            "headline": "Why Does Indo-Russian Tech Cooperation Matter More Than Ever Just Now?",
            "summary": "The article examines the increasing importance of Indo-Russian technological cooperation, especially in the current geopolitical climate. This partnership is crucial for India's strategic autonomy and for diversifying its tech supply chains. The collaboration addresses pressing needs in defense, space, and energy sectors.",
            "key_points": [
                "Indo-Russian tech cooperation is gaining critical importance now.",
                "Partnership enhances India's strategic autonomy and tech diversification.",
                "Collaboration is key in defense, space, and energy."
            ]
        }
    ],
    "Entertainment": [
        {
            "headline": "'Dhurandhar' BO collection day 28: Ranveer Singh starrer ends week 4 with Rs 100 cr haul",
            "summary": "Ranveer Singh's film 'Dhurandhar' has achieved a significant milestone, concluding its fourth week with a total box office collection of Rs 100 crore. This commercial success solidifies its position as a major hit. The film's strong performance reflects positive audience reception and sustained interest.",
            "key_points": [
                "Ranveer Singh's film 'Dhurandhar' collected Rs 100 crore in 4 weeks.",
                "The movie is considered a significant commercial success.",
                "Its strong performance indicates positive audience reception."
            ]
        },
        {
            "headline": "Stranger Things Season 5 Finale reactions: Fans call ending predictable, Emotional and Disappointing",
            "summary": "Fans have reacted to the \"Stranger Things\" Season 5 finale with mixed emotions, describing it as predictable, emotional, and disappointing. The highly anticipated conclusion left some viewers underwhelmed with its resolution. This highlights the challenge of satisfying a dedicated fanbase for a long-running series.",
            "key_points": [
                "Fans had mixed reactions to the Stranger Things Season 5 finale.",
                "Many found the ending predictable, emotional, and disappointing.",
                "The response shows the difficulty of concluding popular series."
            ]
        },
        {
            "headline": "Ikkis box office Day 1: Agastya's film earns 7 cr, beats 'Tu Meri'",
            "summary": "Agastya's new film 'Ikkis' has debuted strongly at the box office, raking in 7 crore on its opening day and surpassing the earnings of 'Tu Meri'. This impressive start positions 'Ikkis' as a promising contender. The initial success indicates positive audience turnout and critical buzz.",
            "key_points": [
                "Agastya's 'Ikkis' earned 7 crore on its first day.",
                "The film's opening surpassed that of 'Tu Meri'.",
                "The strong debut suggests a promising run at the box office."
            ]
        },
        {
            "headline": "Isiah Whitlock Junior passes at 71: Reflecting on his role in 'The Wire' and beyond",
            "summary": "Renowned actor Isiah Whitlock Junior has passed away at the age of 71, leaving behind a significant legacy in film and television. He was celebrated for his iconic role in \"The Wire\" and various other memorable performances. His death marks the loss of a talented and respected figure in the acting community.",
            "key_points": [
                "Actor Isiah Whitlock Junior died at 71.",
                "He was best known for his role in \"The Wire\".",
                "His passing is a loss to the acting community."
            ]
        }
    ],
    "Sports": [
        {
            "headline": "'This is how greatness is built': Pathan backs Gill to follow Kohli's path",
            "summary": "Irfan Pathan has publicly endorsed Shubman Gill, stating that the young cricketer has the potential to follow in Virat Kohli's footsteps towards greatness. Pathan's comments highlight high expectations for Gill's future in Indian cricket. This backing could further motivate the rising star.",
            "key_points": [
                "Irfan Pathan believes Shubman Gill can achieve greatness like Virat Kohli.",
                "Pathan's remarks reflect high expectations for Gill's career.",
                "The endorsement signals confidence in the young cricketer's potential."
            ]
        },
        {
            "headline": "FIDE WC in India: PM Modi says 'Chess is gaining popularity among our youth'",
            "summary": "Prime Minister Narendra Modi noted the growing popularity of chess among Indian youth during the FIDE World Cup in India. His statement underscores the government's recognition of the sport's increasing appeal. This could lead to further support and development for chess in the country.",
            "key_points": [
                "PM Modi observed chess is growing in popularity among Indian youth.",
                "His comments were made during the FIDE World Cup in India.",
                "This recognition may lead to more support for chess development."
            ]
        },
        {
            "headline": "Sarfaraz on fire! Back-to-back tons send strong message to selectors",
            "summary": "Sarfaraz Khan has delivered back-to-back centuries, sending a powerful message to national selectors regarding his form and readiness. His consistent high-scoring performances are difficult to ignore. This impressive display strengthens his case for a spot in higher-level cricket.",
            "key_points": [
                "Sarfaraz Khan scored consecutive centuries.",
                "His performances are a strong statement to selectors.",
                "This boosts his chances for selection in elite cricket."
            ]
        },
        {
            "headline": "Lamar Jackson injury update: Ravens receive massive boost as QB confirms availability for crucial Steelers showdown",
            "summary": "The Baltimore Ravens have received a significant boost with quarterback Lamar Jackson confirming his availability for the crucial showdown against the Steelers. This news alleviates concerns about his injury, providing the team with their star player for an important match. His return is critical for the team's playoff aspirations.",
            "key_points": [
                "Lamar Jackson confirmed his availability for the Steelers game.",
                "This is a major boost for the Baltimore Ravens.",
                "His return is crucial for the team's performance in the upcoming match."
            ]
        }
    ],
    "Science": [
        {
            "headline": "Shark vs Piranha: Understanding the surprising power behind the world’s most feared bites",
            "summary": "An analysis compares the bite forces of sharks and piranhas, two of the most feared creatures in the animal kingdom, revealing surprising insights into their destructive capabilities. While sharks are larger, piranhas possess an incredibly strong bite relative to their size. This study helps understand the unique adaptations that make each a formidable predator.",
            "key_points": [
                "The article compares the bite forces of sharks and piranhas.",
                "Piranhas have a surprisingly strong bite relative to their small size.",
                "The analysis sheds light on the unique predatory adaptations of both species."
            ]
        }
    ],
    "Health": [
        {
            "headline": "Indore water contamination: Deathly silence in Bhagirathpura; toll rises to nine",
            "summary": "The tragic toll from water contamination in Indore's Bhagirathpura has risen to nine deaths, casting a pall of silence over the community. Over 160 residents have been hospitalized after drinking contaminated water. Authorities are facing intense scrutiny amid the ongoing public health crisis.",
            "key_points": [
                "Water contamination in Indore's Bhagirathpura led to nine deaths.",
                "Over 160 residents were hospitalized due to the contaminated water.",
                "Authorities are under scrutiny amidst the public health crisis."
            ]
        },
        {
            "headline": "A new study reveals why ‘healthy’ young Indians are just dropping dead",
            "summary": "A new study has uncovered alarming reasons behind the sudden deaths of seemingly 'healthy' young Indians, a phenomenon causing widespread concern. The research points to underlying cardiovascular issues and lifestyle factors often overlooked. This highlights an urgent need for preventive health measures and awareness among the youth.",
            "key_points": [
                "Study explains sudden deaths among 'healthy' young Indians.",
                "Underlying cardiovascular issues and lifestyle factors are implicated.",
                "Urgent need for preventive health measures and awareness for youth."
            ]
        },
        {
            "headline": "Why jaundice with abdominal pain should never be ignored: The hidden danger of bile duct obstruction",
            "summary": "The presence of jaundice accompanied by abdominal pain should never be overlooked, as it can signal the hidden and dangerous condition of bile duct obstruction. This medical emergency requires prompt diagnosis and treatment to prevent serious complications. Early recognition of these symptoms is crucial for effective intervention.",
            "key_points": [
                "Jaundice with abdominal pain can indicate bile duct obstruction.",
                "This condition is a serious medical emergency requiring prompt treatment.",
                "Early symptom recognition is vital for preventing severe complications."
            ]
        },
        {
            "headline": "Kidney damage: 10 symptoms of kidney problems people mistake for dehydration",
            "summary": "Many common symptoms of kidney damage are often mistakenly attributed to simple dehydration, delaying crucial diagnosis and treatment. Recognizing the distinct signs of kidney problems, such as persistent fatigue or swelling, is vital for early intervention. This awareness can prevent the progression of severe kidney disease.",
            "key_points": [
                "Kidney damage symptoms are often mistaken for dehydration.",
                "Early recognition of signs like persistent fatigue or swelling is crucial.",
                "Awareness can help prevent severe kidney disease progression."
            ]
        },
        {
            "headline": "When throat clearing isn’t a habit but a hidden diagnosis: What is laryngopharyngeal reflux",
            "summary": "Persistent throat clearing, often dismissed as a mere habit, can actually be a symptom of an underlying condition called laryngopharyngeal reflux (LPR). LPR occurs when stomach acid travels up to the throat, irritating the vocal cords and pharynx. Understanding this less-known form of reflux is important for proper diagnosis and treatment.",
            "key_points": [
                "Persistent throat clearing can be a sign of laryngopharyngeal reflux (LPR).",
                "LPR involves stomach acid irritating the throat and vocal cords.",
                "Recognizing LPR is crucial for correct diagnosis and treatment."
            ]
        }
    ]
}