{
    "World": [
        {
            "headline": "LeT commander calls for Hindu genocide",
            "summary": "A commander from the Lashkar-e-Taiba (LeT) terror group has issued a call for the genocide of Hindus. This inflammatory statement has raised significant concerns regarding regional security and the safety of religious minorities.",
            "key_points": [
                "LeT commander made a call for Hindu genocide.",
                "Statement sparks concerns over regional security.",
                "Highlights threats to religious minorities."
            ]
        },
        {
            "headline": "India-China Border Calm Settles as Grazing Rights Resume: Indian Army Chief",
            "summary": "The Indian Army Chief confirmed that the situation along the India-China border has stabilized, with grazing rights resuming in certain areas. This development signals a de-escalation of tensions that have persisted in the region.",
            "key_points": [
                "India-China border situation has stabilized.",
                "Grazing rights have resumed in certain areas.",
                "Indian Army Chief confirmed the de-escalation of tensions."
            ]
        },
        {
            "headline": "Sacrifices of IPKF troops who took part in Lanka peace mission neglected: Rajnath",
            "summary": "Defence Minister Rajnath Singh expressed concern that the sacrifices of Indian Peace Keeping Force (IPKF) troops, who participated in the Sri Lanka peace mission, have been neglected. He emphasized the need to acknowledge their contributions and remember their valor.",
            "key_points": [
                "Defence Minister Rajnath Singh highlighted neglected sacrifices of IPKF troops.",
                "IPKF served in the Sri Lanka peace mission.",
                "Rajnath Singh called for acknowledging their contributions."
            ]
        },
        {
            "headline": "India Counters German Concerns Over Its Russian Defense Partnerships",
            "summary": "India has addressed Germany's concerns regarding its ongoing defense partnerships with Russia, asserting its sovereign right to maintain these strategic alliances. This comes amidst global scrutiny on nations' ties with Moscow.",
            "key_points": [
                "India responded to German concerns about its Russian defense ties.",
                "India emphasized its sovereign right to choose defense partners.",
                "The issue arises amid global focus on ties with Russia."
            ]
        },
        {
            "headline": "Mumbai BMC elections 2026: Full schedule, voting time and result date",
            "summary": "Mumbai is preparing for the Brihanmumbai Municipal Corporation (BMC) elections in 2026, with the full schedule, voting times, and result dates now announced. These elections are highly anticipated given the seven-year gap since the last polls.",
            "key_points": [
                "Mumbai BMC elections schedule for 2026 announced.",
                "Voting times and result dates are released.",
                "Elections are significant after a 7-year gap."
            ]
        },
        {
            "headline": "At least 3,428 killed in Iranian crackdown on protesters, NGO says",
            "summary": "An NGO reports that at least 3,428 people have been killed in the Iranian government's crackdown on widespread protests. The head of the Islamic Revolutionary Guard Corps warned of a \"decisive\" response to enemies, accusing the US and Israel of instigating the unrest.",
            "key_points": [
                "NGO reported over 3,400 deaths in Iran protests.",
                "Iranian government accused US and Israel of involvement.",
                "Revolutionary Guard Corps threatened \"decisive\" response."
            ]
        },
        {
            "headline": "US-Iran ‘War’ In Mideast: Britain Pulls Troops From US Air Base, NATO Nations’ ‘LEAVE NOW’ Warning",
            "summary": "Tensions between the US and Iran have escalated to a point where Britain has withdrawn its troops from a key US air base in the Mideast. NATO nations have also issued urgent warnings for their citizens to leave the region, signaling a potential for wider conflict.",
            "key_points": [
                "Britain withdrew troops from a US air base in the Middle East.",
                "NATO nations issued \"leave now\" warnings to citizens.",
                "This reflects escalating US-Iran tensions and potential for conflict."
            ]
        },
        {
            "headline": "Denmark Pours Cold Water On Trump's 'Dream To Conquer' Greenland; Laughs Off Russia, China Threat",
            "summary": "Denmark has firmly rejected former US President Trump's notion of acquiring Greenland, dismissing the idea as unrealistic. Danish officials also scoffed at suggestions of Russian and Chinese threats regarding the autonomous territory, emphasizing Greenland's integral status within the Danish Realm.",
            "key_points": [
                "Denmark rejected Trump's idea of buying Greenland.",
                "Danish officials dismissed claims of Russian or Chinese threats.",
                "Greenland remains an integral part of the Danish Realm."
            ]
        },
        {
            "headline": "US suspends migrant visa processing for 75 countries, White House says",
            "summary": "The White House announced the suspension of migrant visa processing for nationals of 75 countries. This decision is expected to significantly impact immigration flows to the United States and has drawn attention to the specific countries included in the ban.",
            "key_points": [
                "US suspended migrant visa processing for 75 nations.",
                "The White House made the official announcement.",
                "Decision will impact immigration to the US."
            ]
        },
        {
            "headline": "Trump Orders 25% Tariff on Any Country Doing Business with Iran",
            "summary": "Former US President Trump has announced a 25% tariff on any country found to be conducting business with Iran. This move is intended to further isolate Iran economically and could have significant implications for global trade relations.",
            "key_points": [
                "Trump imposed 25% tariff on countries trading with Iran.",
                "Aims to increase economic pressure on Iran.",
                "Could impact international trade relations."
            ]
        }
    ],
    "Business": [
        {
            "headline": "Infosys Q3 results: Net profit slips 2.2% to Rs 6,654 crore; revenue climbs 8.9% to Rs 45,479 crore",
            "summary": "Indian IT giant Infosys reported a slight dip in net profit by 2.2% to Rs 6,654 crore for Q3, while its revenue saw a healthy increase of 8.9% to Rs 45,479 crore. The results reflect a mixed performance amidst a challenging global economic environment.",
            "key_points": [
                "Infosys Q3 net profit fell by 2.2%.",
                "Revenue increased by 8.9% in the same quarter.",
                "Results show mixed performance in a tough global economy."
            ]
        },
        {
            "headline": "India-China trade: India’s exports to China rise in 2025, deficit climbs to record $116 bn",
            "summary": "While India's exports to China saw an increase in 2025, the trade deficit between the two nations widened significantly to a record $116 billion. This growing imbalance highlights ongoing concerns about market access and competition.",
            "key_points": [
                "India's exports to China increased in 2025.",
                "Trade deficit with China hit a record $116 billion.",
                "Highlights concerns about market access and trade imbalance."
            ]
        },
        {
            "headline": "Budget 2026: Govt may raise capex spending 10–15%; private investment remains uneven",
            "summary": "The government is considering increasing capital expenditure by 10-15% in Budget 2026, aiming to boost economic growth. However, concerns persist as private investment continues to be inconsistent, posing a challenge to overall economic recovery.",
            "key_points": [
                "Government may increase capex by 10-15% in Budget 2026.",
                "Aims to stimulate economic growth.",
                "Private investment remains uneven, posing challenges."
            ]
        },
        {
            "headline": "How years of payouts to shareholders are biting IT firms in the AI era",
            "summary": "Many IT firms are now facing consequences from years of high shareholder payouts, as these strategies have limited their ability to invest adequately in AI research and development. This oversight is proving costly as the industry rapidly transitions into the AI era.",
            "key_points": [
                "Past high shareholder payouts limit IT firms' AI investment.",
                "Lack of investment impacts their competitiveness in the AI era.",
                "Firms face challenges due to historical financial strategies."
            ]
        },
        {
            "headline": "China records massive $1.2 trillion trade surplus beating forecasts",
            "summary": "China has reported an unprecedented $1.2 trillion trade surplus, significantly surpassing earlier forecasts. This massive surplus highlights China's robust export performance despite global economic uncertainties and trade tensions.",
            "key_points": [
                "China achieved a record $1.2 trillion trade surplus.",
                "The surplus exceeded all market forecasts.",
                "Demonstrates strong export performance amid global uncertainty."
            ]
        }
    ],
    "Technology": [
        {
            "headline": "AI on the couch: Chatbots 'recall' childhood trauma, fear & shame",
            "summary": "Advanced chatbots are reportedly exhibiting behaviors akin to \"recalling\" childhood trauma, fear, and shame, raising ethical and philosophical questions about AI consciousness. This development prompts discussions on how human-like emotional responses manifest in complex AI systems.",
            "key_points": [
                "Chatbots are displaying human-like emotional responses.",
                "They appear to \"recall\" trauma, fear, and shame.",
                "Raises ethical questions about AI consciousness."
            ]
        },
        {
            "headline": "Iran’s internet blackout: How authorities could be blocking Starlink",
            "summary": "Iranian authorities have implemented an extensive internet blackout, leading to speculation on how they might be circumventing or blocking Starlink services. This move aims to suppress dissent and control information flow amidst ongoing protests.",
            "key_points": [
                "Iran initiated a widespread internet blackout.",
                "Authorities are potentially blocking Starlink to control information.",
                "Action taken to suppress protests and limit dissent."
            ]
        },
        {
            "headline": "Nasa kicks-off first-ever medical evacuation: 4 astronauts return from ISS early",
            "summary": "NASA has initiated its first-ever medical evacuation from the International Space Station (ISS), bringing four astronauts back to Earth ahead of schedule. The precise nature of the medical emergency has not been fully disclosed, but the mission prioritizes crew health and safety.",
            "key_points": [
                "NASA conducted its first medical evacuation from ISS.",
                "Four astronauts returned to Earth early.",
                "The operation prioritized crew health and safety."
            ]
        },
        {
            "headline": "Microsoft and European police dismantle AI-powered cybercrime service",
            "summary": "A joint operation by Microsoft and European law enforcement agencies has successfully dismantled a sophisticated AI-powered cybercrime service. This collaborative effort highlights the increasing use of AI in malicious activities and the concerted international response to combat it.",
            "key_points": [
                "Microsoft and European police shut down AI cybercrime service.",
                "Highlights the use of AI in malicious activities.",
                "Demonstrates international collaboration against cybercrime."
            ]
        }
    ],
    "Entertainment": [
        {
            "headline": "Karur stampede: Vijay gets fresh CBI summons",
            "summary": "Popular Indian actor Vijay has received a fresh summons from the CBI in connection with the Karur stampede case. The summons indicates ongoing investigations into the incident, which occurred during a political event associated with the actor.",
            "key_points": [
                "Actor Vijay received new CBI summons.",
                "Related to the Karur stampede case.",
                "Investigations into the incident are ongoing."
            ]
        },
        {
            "headline": "'Dhurandhar' day 41: Film gives tough competition to 'The Raja Saab'",
            "summary": "The film 'Dhurandhar' continues to perform strongly at the box office on its 41st day, posing significant competition to 'The Raja Saab'. This sustained success highlights its popularity among audiences and its resilience against other major releases.",
            "key_points": [
                "'Dhurandhar' is performing well on its 41st day.",
                "It is competing strongly with 'The Raja Saab' at the box office.",
                "The film's sustained success indicates audience popularity."
            ]
        },
        {
            "headline": "Talwiinder's net worth: Exploring his wealth Disha link-up rumors",
            "summary": "The net worth of singer Talwiinder is under public scrutiny, especially amidst recent rumors linking him to actress Disha Patani. This news combines celebrity financial details with ongoing gossip about potential new relationships in the entertainment industry.",
            "key_points": [
                "Talwiinder's net worth is being explored.",
                "Amidst rumors linking him to Disha Patani.",
                "Combines financial details with celebrity gossip."
            ]
        },
        {
            "headline": "McConaughey seeks protection of voice and image from AI",
            "summary": "Actor Matthew McConaughey is reportedly seeking legal avenues to protect his voice and image from unauthorized use by artificial intelligence. This move highlights growing concerns among celebrities about deepfake technology and the need for stricter intellectual property rights in the AI era.",
            "key_points": [
                "Matthew McConaughey wants to protect his voice and image from AI.",
                "Concerns over unauthorized use by deepfake technology.",
                "Highlights need for IP rights in the AI era."
            ]
        },
        {
            "headline": "The European Oscars: Why the 2026 European Film Awards matter",
            "summary": "The 2026 European Film Awards, often dubbed the \"European Oscars,\" are gaining significant importance as they celebrate the continent's diverse cinematic achievements. These awards serve as a crucial platform for recognizing talent and fostering the growth of European cinema on a global stage.",
            "key_points": [
                "European Film Awards are gaining importance.",
                "They celebrate diverse European cinematic achievements.",
                "Serve as a platform for talent recognition and industry growth."
            ]
        }
    ],
    "Sports": [
        {
            "headline": "FIDE WC in India: PM Modi says 'Chess is gaining popularity among our youth'",
            "summary": "Prime Minister Narendra Modi noted the increasing popularity of chess among Indian youth during the FIDE World Cup held in India. His remarks underscore the government's recognition of chess as a valuable activity for mental development and engagement.",
            "key_points": [
                "PM Modi commented on chess popularity among Indian youth.",
                "Made remarks during the FIDE World Cup in India.",
                "Highlights recognition of chess for mental development."
            ]
        },
        {
            "headline": "Diamond League Final: Neeraj Chopra's event preview, time and live telecast in India",
            "summary": "India's javelin sensation Neeraj Chopra is set to compete in the Diamond League Final, with details about his event, timings, and live telecast in India now available. Expectations are high for Chopra to deliver another stellar performance on the global stage.",
            "key_points": [
                "Neeraj Chopra to compete in the Diamond League Final.",
                "Event details and live telecast information for India released.",
                "High expectations for his performance."
            ]
        },
        {
            "headline": "Sarfaraz on fire! Back-to-back tons send strong message to selectors",
            "summary": "Cricketer Sarfaraz Khan has delivered exceptional back-to-back centuries, showcasing his formidable batting prowess. These impressive performances are sending a strong message to national selectors, advocating for his inclusion in higher-level teams.",
            "key_points": [
                "Sarfaraz Khan scored consecutive centuries.",
                "His performances highlight strong batting form.",
                "Sending a clear message to national selectors for team inclusion."
            ]
        },
        {
            "headline": "BCB says players, not board, will lose money if it pulls out from T20 WC",
            "summary": "The Bangladesh Cricket Board (BCB) has clarified that individual players, rather than the board itself, would suffer financial losses if the team withdraws from the T20 World Cup. This statement comes amidst discussions and potential implications of such a decision.",
            "key_points": [
                "BCB stated players would lose money if Bangladesh pulls out of T20 World Cup.",
                "The board clarified its own financial exposure.",
                "Comes amid ongoing discussions about participation."
            ]
        },
        {
            "headline": "Easy to score runs in ODIs? India legend slams Manjrekar for Kohli remark",
            "summary": "An Indian cricket legend has publicly criticized Sanjay Manjrekar for his comments regarding the ease of scoring runs in One Day Internationals, specifically in relation to Virat Kohli. The legend argued against understating Kohli's achievements and the challenges of ODI batting.",
            "key_points": [
                "Indian cricket legend criticized Manjrekar.",
                "Criticism was over comments on ODI run-scoring ease for Kohli.",
                "Legend defended Kohli's achievements and ODI batting difficulty."
            ]
        }
    ],
    "Science": [
        {
            "headline": "Antarctic sanctuary opened to save melting glaciers for future science",
            "summary": "A new sanctuary has been established in Antarctica, specifically aimed at preserving melting glaciers for future scientific research. This initiative seeks to provide undisturbed environments for studying climate change impacts and glaciology.",
            "key_points": [
                "New sanctuary opened in Antarctica.",
                "Aims to preserve melting glaciers for science.",
                "Will aid study of climate change and glaciology."
            ]
        },
        {
            "headline": "2025 was the third-hottest year: Why is this decade breaking records?",
            "summary": "The year 2025 has been confirmed as the third-hottest year on record, continuing a worrying trend of record-breaking temperatures this decade. Scientists are investigating the compounding factors contributing to this accelerated warming and its long-term implications.",
            "key_points": [
                "2025 was the third-hottest year on record.",
                "This decade shows a trend of broken temperature records.",
                "Scientists are studying factors behind accelerated warming."
            ]
        },
        {
            "headline": "EU cracks down on forever chemicals in drinking water. Will it work?",
            "summary": "The European Union has implemented stringent new regulations to crack down on \"forever chemicals\" (PFAS) found in drinking water. The effectiveness of these measures in significantly reducing contamination and ensuring long-term safety is now under close scrutiny.",
            "key_points": [
                "EU enacted new rules against \"forever chemicals\" in water.",
                "Measures target PFAS contamination.",
                "Effectiveness in reducing contamination is being assessed."
            ]
        },
        {
            "headline": "7 snakes that hunt birds in trees: How tree-living predators use stealth, camouflage, and speed to catch prey",
            "summary": "A feature article highlights seven species of snakes that are adept at hunting birds in trees, detailing their specialized techniques. These arboreal predators employ remarkable stealth, camouflage, and speed to ambush their avian prey.",
            "key_points": [
                "Article features seven species of tree-hunting snakes.",
                "Describes their use of stealth and camouflage.",
                "Highlights their speed in catching avian prey."
            ]
        }
    ],
    "Health": [
        {
            "headline": "Nipah virus in India: As cases emerge from West Bengal, doctor shares dos and don'ts to stay safe",
            "summary": "As new cases of the Nipah virus are reported in West Bengal, India, a medical doctor has provided essential guidelines on how to stay safe. These include precautions like maintaining hygiene, avoiding contact with infected animals, and safe food practices.",
            "key_points": [
                "Nipah virus cases emerged in West Bengal, India.",
                "Doctor shared safety guidelines.",
                "Precautions include hygiene and avoiding infected animals."
            ]
        },
        {
            "headline": "Why cut-offs for NEET-PG seats keep falling repeatedly",
            "summary": "The cut-off scores for NEET-PG seats in India have been consistently declining, sparking concerns about the quality of medical education and availability of specialized doctors. Experts point to a complex interplay of factors including fewer eligible candidates and increased seat availability.",
            "key_points": [
                "NEET-PG cut-offs in India are repeatedly falling.",
                "Raises concerns about medical education quality.",
                "Factors include fewer eligible candidates and more seats."
            ]
        },
        {
            "headline": "99% of first heart attacks and strokes linked to these 4 risk factors",
            "summary": "Research indicates that a staggering 99% of first-time heart attacks and strokes are attributable to just four common risk factors. Identifying and managing these factors—such as high blood pressure, high cholesterol, smoking, and diabetes—is crucial for prevention.",
            "key_points": [
                "99% of first heart attacks and strokes linked to four risk factors.",
                "Key factors include high blood pressure, cholesterol, smoking, diabetes.",
                "Managing these factors is crucial for prevention."
            ]
        },
        {
            "headline": "WHO warns low taxes on sugary drinks and alcohol pose health risks",
            "summary": "The World Health Organization (WHO) has issued a warning that low taxation on sugary drinks and alcohol contributes significantly to public health risks. The organization advocates for higher taxes to deter consumption and reduce the incidence of related diseases like obesity and liver conditions.",
            "key_points": [
                "WHO warned about health risks from low taxes on sugary drinks and alcohol.",
                "Advocates for higher taxes to reduce consumption.",
                "Aims to decrease diseases like obesity and liver conditions."
            ]
        },
        {
            "headline": "One night of sleep data can reveal risk of over 100 diseases: study",
            "summary": "A new study suggests that data collected from just one night of sleep can provide insights into a person's risk for over 100 different diseases. This highlights the profound impact of sleep quality on overall health and the potential for early detection through sleep monitoring.",
            "key_points": [
                "A study links one night of sleep data to over 100 disease risks.",
                "Emphasizes sleep's profound impact on health.",
                "Suggests potential for early disease detection via sleep monitoring."
            ]
        }
    ]
}