{
    "World": [
        {
            "headline": "Trump Announces 25% Tariffs on Tehran's Trade Partners; Calls Order 'Final'",
            "summary": "Former US President Donald Trump has announced a final order to impose 25% tariffs on trade partners of Tehran. This move escalates economic pressure on Iran and signals a significant shift in US foreign policy under a potential new administration.",
            "key_points": [
                "Trump orders 25% tariffs on Iran's trade partners.",
                "The order is declared 'final,' indicating a firm stance.",
                "The move is part of broader US pressure on Iran."
            ]
        },
        {
            "headline": "Greenland and NATO Vow to Boost Arctic Security Amid Trump Threats",
            "summary": "Greenland and NATO have pledged to enhance Arctic security in response to perceived threats from former US President Donald Trump. Germany also committed to an increased role in the region, highlighting growing international concern over Arctic geopolitics.",
            "key_points": [
                "Greenland and NATO commit to strengthening Arctic security.",
                "The decision follows perceived threats from Donald Trump.",
                "Germany will also increase its involvement in Greenland's defense."
            ]
        },
        {
            "headline": "New York City Hospitals Paralysed as 15,000 Nurses Abandon Job, Hit Streets",
            "summary": "Thousands of nurses in New York City have gone on strike, leading to the paralysis of several hospitals. The walkout involves 15,000 nurses demanding better staffing levels, improved safety protocols, and addressing concerns related to the integration of AI in healthcare.",
            "key_points": [
                "15,000 nurses in NYC are on strike, impacting hospitals.",
                "Demands include better staffing, improved safety, and AI concerns.",
                "The strike has led to significant disruptions in healthcare services."
            ]
        },
        {
            "headline": "Taliban Takes the Helm at Afghan Embassy in Delhi; India's Stance Questioned",
            "summary": "The Taliban has officially assumed control of the Afghan embassy in Delhi, marking a significant development in diplomatic relations. This move raises important questions regarding India's evolving policy towards the Taliban regime in Afghanistan and potential geopolitical implications for the region.",
            "key_points": [
                "Taliban gains control of the Afghan embassy in Delhi.",
                "This development prompts questions about India's diplomatic position.",
                "The change has regional geopolitical implications."
            ]
        },
        {
            "headline": "Tehran Summons Western Ambassadors as Protester Death Toll Climbs",
            "summary": "Tehran has summoned Western ambassadors in a bid to reclaim the narrative amid rising protester deaths. The Iranian government called for nationwide rallies backing the Islamic republic, with Ayatollah Ali Khamenei issuing a 'warning' to the United States regarding the unrest.",
            "key_points": [
                "Iran summons Western ambassadors as protester deaths increase.",
                "Government organizes rallies to support the Islamic republic.",
                "Ayatollah Ali Khamenei issues a warning to the United States."
            ]
        },
        {
            "headline": "Case on Whether Myanmar Is Guilty of Rohingya Genocide Opens at ICJ",
            "summary": "A crucial case has opened at the International Court of Justice (ICJ) to determine if Myanmar is guilty of committing genocide against the Rohingya Muslim minority. This legal proceeding seeks to hold Myanmar accountable for alleged atrocities and deliver justice for the victims.",
            "key_points": [
                "ICJ case begins to investigate Rohingya genocide allegations against Myanmar.",
                "The court will examine evidence of atrocities.",
                "The proceedings aim for accountability and justice for victims."
            ]
        }
    ],
    "Business": [
        {
            "headline": "Maruti to Invest Nearly Rs 5,000 Crore for Second Gujarat Plant",
            "summary": "Maruti Suzuki has announced a significant investment of nearly Rs 5,000 crore to establish its second manufacturing plant in Gujarat. This expansion underscores the company's commitment to increasing production capacity and strengthening its presence in the Indian market.",
            "key_points": [
                "Maruti Suzuki plans Rs 5,000 crore investment.",
                "The investment is for a second plant in Gujarat.",
                "This aims to boost production capacity in India."
            ]
        },
        {
            "headline": "EU-India Trade Deal Could Be Agreed by February, Says German Chancellor Merz",
            "summary": "German Chancellor Friedrich Merz indicated that a trade deal between the European Union and India could be finalized by February. This potential agreement would significantly boost economic ties and open new avenues for trade and investment between the two major economies.",
            "key_points": [
                "EU-India trade deal potentially by February.",
                "German Chancellor Merz made the announcement.",
                "The agreement is expected to enhance economic cooperation."
            ]
        },
        {
            "headline": "Retail Inflation Inches Up to 3-Month High of 1.3% in December",
            "summary": "India's retail inflation saw an increase, reaching a three-month high of 1.3% in December. This uptick in consumer prices will be a key factor for policymakers to consider in their economic strategies.",
            "key_points": [
                "Retail inflation in India hit 1.3% in December.",
                "This marks a 3-month high for inflation.",
                "Policymakers will closely monitor this economic indicator."
            ]
        },
        {
            "headline": "Shadowfax to Launch Rs 1.9k Crore IPO This Month",
            "summary": "Logistics and last-mile delivery platform Shadowfax is set to launch its Initial Public Offering (IPO) of Rs 1,900 crore this month. The IPO is expected to generate significant interest from investors, reflecting confidence in the company's growth trajectory and the burgeoning e-commerce logistics sector.",
            "key_points": [
                "Shadowfax plans a Rs 1,900 crore IPO this month.",
                "The company operates in logistics and last-mile delivery.",
                "The IPO is anticipated to attract strong investor interest."
            ]
        },
        {
            "headline": "US Opens Criminal Investigation into Fed Chair Jerome Powell",
            "summary": "The United States Department of Justice has initiated a criminal investigation into Federal Reserve Chair Jerome Powell. This unprecedented move could have significant ramifications for the US financial markets and the central bank's leadership.",
            "key_points": [
                "Jerome Powell, Fed Chair, is under criminal investigation.",
                "The US Department of Justice initiated the probe.",
                "The investigation has potential impacts on financial markets and the Fed."
            ]
        },
        {
            "headline": "Gross Direct Tax Kitty Up 4%, Refunds Down 17%",
            "summary": "India's gross direct tax collection has increased by 4%, while tax refunds saw a decline of 17%. These figures reflect changes in tax compliance and collection efficiency, providing insights into the nation's fiscal health.",
            "key_points": [
                "Gross direct tax collection rose by 4%.",
                "Tax refunds decreased by 17%.",
                "Figures indicate shifts in fiscal health and tax administration."
            ]
        }
    ],
    "Technology": [
        {
            "headline": "ISRO PSLV-C62 Rocket Fails to Reach Orbit, Loses DRDO’s ‘Super-Eye’ and 15 Satellites",
            "summary": "In a significant setback for India's space program, the ISRO PSLV-C62 rocket failed to achieve orbit, resulting in the loss of DRDO’s 'super-eye' satellite and 15 other disruptive technology satellites. This marks the second consecutive failure for the PSLV series, prompting concerns and investigations within the space agency.",
            "key_points": [
                "PSLV-C62 rocket failed to reach orbit.",
                "DRDO’s ‘super-eye’ and 15 other satellites were lost.",
                "This is the second consecutive failure for the PSLV series."
            ]
        },
        {
            "headline": "Elon Musk's Grok AI Chatbot Sparks Global Outrage Over Explicit Content; Governments React",
            "summary": "Elon Musk's AI chatbot, Grok, has ignited global outrage due to its explicit content, prompting widespread government crackdowns and calls for regulation. Indonesia and Malaysia have already moved to block the AI, while India has issued a stern warning to X (formerly Twitter) regarding its content policy.",
            "key_points": [
                "Grok AI chatbot generates explicit content, causing global outrage.",
                "Indonesia and Malaysia have blocked the AI.",
                "India issued a stern message to X (Twitter) regarding Grok's content.",
                "The incident highlights challenges in AI content moderation."
            ]
        },
        {
            "headline": "Bill Gates Predicts AI to Be Society's Biggest Impact",
            "summary": "Microsoft co-founder Bill Gates has stated that artificial intelligence will have the most profound impact on society, surpassing other technological advancements. He believes AI will fundamentally change how people live and work, reshaping various aspects of daily life.",
            "key_points": [
                "Bill Gates believes AI will have the biggest societal impact.",
                "He predicts AI will fundamentally change how people live and work.",
                "AI's influence is expected to be more significant than other tech advancements."
            ]
        },
        {
            "headline": "UK Investigates Elon Musk’s X Over Sexualised AI Images",
            "summary": "The UK government has launched an investigation into Elon Musk’s social media platform, X, concerning the proliferation of sexualized AI-generated images. This probe underscores growing regulatory scrutiny over AI content and platform responsibility.",
            "key_points": [
                "UK government investigates X (formerly Twitter) over sexualized AI images.",
                "The investigation highlights concerns about AI-generated content.",
                "Regulatory bodies are increasing scrutiny on platform responsibility."
            ]
        }
    ],
    "Entertainment": [
        {
            "headline": "'Dhurandhar' Nears Rs 1,300 Crore Mark at Box Office",
            "summary": "The film 'Dhurandhar' is reportedly close to achieving a remarkable feat, nearing the Rs 1,300 crore mark at the global box office. This exceptional commercial success highlights its immense popularity and strong reception among audiences worldwide.",
            "key_points": [
                "'Dhurandhar' is approaching Rs 1,300 crore at the box office.",
                "The film has achieved significant commercial success.",
                "Its performance reflects strong global audience reception."
            ]
        },
        {
            "headline": "Legal Battle Over Release: Vijay’s Last Film Faces Court Stay; Censor Board Appeals Order",
            "summary": "Vijay’s upcoming film, anticipated to be his last, is embroiled in a legal battle, facing a court stay on its release. The Censor Board has appealed the order, indicating a complex dispute that could delay the movie's theatrical debut and disappoint fans.",
            "key_points": [
                "Vijay’s last film faces a court-ordered stay on its release.",
                "The Censor Board has appealed the court's decision.",
                "The legal dispute could delay the movie's premiere."
            ]
        },
        {
            "headline": "Leonardo DiCaprio's Viral Golden Globes 2026 Clip Has Internet in Splits",
            "summary": "A clip featuring Leonardo DiCaprio from the Golden Globes 2026 has gone viral, captivating the internet and being dubbed a 'matter of national curiosity.' The moment sparked widespread reactions and memes, solidifying its place as a trending topic.",
            "key_points": [
                "Leonardo DiCaprio's Golden Globes 2026 clip went viral.",
                "The clip became a 'matter of national curiosity' online.",
                "It sparked widespread internet reactions and memes."
            ]
        },
        {
            "headline": "'Toxic' Teaser: Complaint Filed Over Obscene Visuals",
            "summary": "The teaser for the film 'Toxic' has drawn controversy, with a complaint filed against it over alleged obscene visuals. This development could lead to scrutiny from regulatory bodies and potentially impact the film's promotional strategy.",
            "key_points": [
                "A complaint has been filed against the 'Toxic' teaser.",
                "The complaint cites alleged obscene visuals.",
                "The controversy may lead to regulatory scrutiny."
            ]
        }
    ],
    "Sports": [
        {
            "headline": "Citizenship Row in Kolkata: Sports Greats Protest SIR Hearings ‘Harassment’",
            "summary": "Several Indian sports greats who have proudly donned the national jersey are protesting against alleged 'harassment' during SIR hearings in Kolkata amidst a citizenship row. Their public stand highlights broader concerns about the treatment of citizens and the impact on respected personalities.",
            "key_points": [
                "Indian sports personalities protest SIR hearings in Kolkata.",
                "They allege 'harassment' amidst a citizenship row.",
                "The protest raises concerns about citizen treatment."
            ]
        },
        {
            "headline": "Sarfaraz on Fire! Back-to-Back Tons Send Strong Message to Selectors",
            "summary": "Sarfaraz Khan has delivered back-to-back centuries, showcasing exceptional form and sending a strong message to national selectors. His consistent high performance is making a compelling case for his inclusion in the Indian cricket team.",
            "key_points": [
                "Sarfaraz Khan scored consecutive centuries.",
                "His performance sends a strong message to selectors.",
                "He is making a strong case for national team selection."
            ]
        },
        {
            "headline": "Stunning Prediction: 'Shreyas Iyer Can Captain India to a World Cup Win'",
            "summary": "A bold prediction has emerged suggesting that Shreyas Iyer possesses the leadership qualities to captain India to a World Cup victory. This forecast has sparked considerable debate and excitement among cricket enthusiasts, highlighting Iyer's potential as a future leader.",
            "key_points": [
                "Shreyas Iyer is predicted to lead India to a World Cup win.",
                "The prediction emphasizes his leadership potential.",
                "It has generated discussion among cricket fans."
            ]
        },
        {
            "headline": "Diamond League Final: Neeraj Chopra's Event Preview, Time and Live Telecast in India",
            "summary": "Details for Neeraj Chopra's appearance at the Diamond League Final have been released, including event previews, timing, and live telecast information for Indian viewers. All eyes will be on the Olympic gold medalist as he aims for another strong performance on the international stage.",
            "key_points": [
                "Neeraj Chopra's Diamond League Final event details are out.",
                "Information on time and live telecast in India is available.",
                "The Olympic gold medalist is set to compete on the international stage."
            ]
        }
    ],
    "Science": [
        {
            "headline": "DRDO Flight-Tests Man-Portable Anti-Tank Guided Missile Against a Moving Target",
            "summary": "India's Defence Research and Development Organisation (DRDO) has successfully conducted a flight-test of its indigenously developed Man-Portable Anti-Tank Guided Missile (MPATGM) against a moving target. This successful test marks a significant boost to India's defense capabilities and self-reliance in advanced weaponry.",
            "key_points": [
                "DRDO successfully flight-tested MPATGM against a moving target.",
                "The missile is indigenously developed and man-portable.",
                "This enhances India's defense capabilities and self-reliance."
            ]
        },
        {
            "headline": "Indian-Origin Scientist Shri Kulkarni Wins Royal Astronomical Society’s Gold Medal",
            "summary": "Indian-origin scientist Shri Kulkarni has been awarded the prestigious Gold Medal by the Royal Astronomical Society for his outstanding contributions to astronomy. This recognition highlights his groundbreaking work and significant impact in the field of astrophysics.",
            "key_points": [
                "Shri Kulkarni, an Indian-origin scientist, received the Gold Medal.",
                "The award is from the Royal Astronomical Society.",
                "It recognizes his outstanding contributions to astronomy."
            ]
        },
        {
            "headline": "Teens Build Pen-Sized Device to Remove Microplastics from Water",
            "summary": "Two innovative teenagers, Victoria Ou and Justin Huang, have developed a pen-sized device capable of removing microplastics from water. Their invention offers a promising and practical solution to address the pervasive environmental problem of plastic pollution.",
            "key_points": [
                "Victoria Ou and Justin Huang invented a pen-sized microplastic remover.",
                "The device aims to combat water pollution.",
                "This innovation offers a practical environmental solution."
            ]
        }
    ],
    "Health": [
        {
            "headline": "Health Scare in Bengal: Two Barasat Nurses Hospitalized with Nipah Virus Symptoms; Centre Sends Team",
            "summary": "A health scare has emerged in Bengal as two nurses from Barasat have been hospitalized exhibiting symptoms of the Nipah virus. The central government has dispatched a team to investigate and contain any potential outbreak, raising concerns about public health in the region.",
            "key_points": [
                "Two nurses in Barasat, Bengal, hospitalized with Nipah virus symptoms.",
                "The central government sent a team to investigate.",
                "The incident raises public health concerns in the region."
            ]
        },
        {
            "headline": "One Night of Sleep Data Can Reveal Risk of Over 100 Diseases: Study",
            "summary": "A new study suggests that analyzing just one night of sleep data can help reveal the risk of developing over 100 different diseases. This groundbreaking research underscores the critical link between sleep patterns and long-term health, potentially revolutionizing early disease detection.",
            "key_points": [
                "A study links one night of sleep data to over 100 disease risks.",
                "Research highlights the crucial connection between sleep and health.",
                "This could impact early disease detection strategies."
            ]
        },
        {
            "headline": "Seven Ways to Boost Your Gut Health for Overall Well-being",
            "summary": "Experts recommend seven effective strategies to enhance gut health, which is increasingly recognized as fundamental to overall well-being. These methods include dietary changes, probiotic intake, and lifestyle adjustments aimed at improving digestive function and immunity.",
            "key_points": [
                "Seven strategies are recommended for improving gut health.",
                "Gut health is crucial for overall well-being and immunity.",
                "Tips include dietary changes and probiotic use."
            ]
        },
        {
            "headline": "‘Clean’ ECG but Dead 3 Days Later: Lessons from a Neurosurgeon’s Death",
            "summary": "The tragic death of a neurosurgeon, just three days after receiving a 'clean' ECG report, highlights critical lessons in cardiac diagnosis and preventive care. This case underscores the limitations of standard diagnostic tools and the importance of considering broader risk factors in patient assessment.",
            "key_points": [
                "Neurosurgeon died 3 days after a 'clean' ECG.",
                "The case reveals limitations of standard cardiac diagnostics.",
                "It emphasizes the need for comprehensive risk factor assessment."
            ]
        }
    ]
}