{
    "World": [
        {
            "headline": "MHA notifies Census 2027 schedule, lists 33 questions",
            "summary": "India's Ministry of Home Affairs has released the schedule for the 2027 Census, detailing 33 questions to be asked nationwide. This comprehensive exercise aims to collect vital demographic and socio-economic data for policymaking.",
            "key_points": [
                "India's MHA announced Census 2027 schedule.",
                "The census will include 33 questions for data collection.",
                "Aims to gather vital demographic and socio-economic information."
            ]
        },
        {
            "headline": "Lula discusses strategic ties with PM Modi, to visit in February",
            "summary": "Brazilian President Lula da Silva engaged in talks with Prime Minister Modi to strengthen strategic ties, confirming his upcoming visit to India in February. The discussions aim to enhance bilateral cooperation across various sectors.",
            "key_points": [
                "Brazilian President Lula discussed strategic ties with PM Modi.",
                "Lula is scheduled to visit India in February.",
                "Focus is on strengthening bilateral cooperation."
            ]
        },
        {
            "headline": "India Demands Accountability After Khalistanis Vandalise its Embassy in Croatia",
            "summary": "India has lodged a strong demand for accountability from Croatian authorities following an incident where Khalistani elements vandalized its embassy in Croatia. This highlights India's firm stance against acts targeting its diplomatic missions abroad.",
            "key_points": [
                "Indian embassy in Croatia was vandalized by Khalistanis.",
                "India demanded accountability from Croatian authorities.",
                "Incident raises concerns about extremist activities against Indian missions."
            ]
        },
        {
            "headline": "Unlike West, India Gives UAE a True Partnership Free of Conditions: Expert",
            "summary": "An expert highlighted that India provides the UAE with a genuine, unconditional partnership, distinguishing its approach from Western nations. This emphasizes India's unique diplomatic strategy and growing influence in fostering strong international relations.",
            "key_points": [
                "India's partnership with UAE is unconditional, unlike Western counterparts.",
                "Reflects India's unique diplomatic strategy.",
                "Strengthens India's influence in international relations."
            ]
        },
        {
            "headline": "UN failing, BRICS outpacing G7: South Africa’s High Commissioner to India",
            "summary": "South Africa's High Commissioner to India declared the UN as failing and stated that BRICS nations are rapidly surpassing the G7 in global influence. This perspective underscores a significant shift in the world's power dynamics towards emerging economies.",
            "key_points": [
                "UN is perceived as failing.",
                "BRICS nations are outpacing G7 in global influence.",
                "Highlights a shift in global power dynamics."
            ]
        },
        {
            "headline": "Trump Hurts Himself At Board Of Peace Signing; Viral Pics Show Heavy Bruise On Left Hand",
            "summary": "Former US President Donald Trump reportedly sustained a heavy bruise on his left hand during a \"Board of Peace\" signing event, with viral images circulating widely. The incident drew public attention amidst his diplomatic engagements.",
            "key_points": [
                "Donald Trump injured his hand at a \"Board of Peace\" signing event.",
                "Viral pictures showed a significant bruise.",
                "Incident occurred during his diplomatic activities."
            ]
        },
        {
            "headline": "Zelensky Picks Trump Over Europe, Announces Russia-US-Ukraine Trilateral | 'EU Needs To Be Stronger'",
            "summary": "Ukrainian President Zelensky has expressed a preference for collaborating with former US President Trump, proposing a Russia-US-Ukraine trilateral discussion. He concurrently called for a stronger European Union to address current geopolitical challenges.",
            "key_points": [
                "Zelensky prefers Trump for trilateral talks on Ukraine.",
                "He advocates for a stronger European Union.",
                "The proposal suggests a new diplomatic approach for Ukraine."
            ]
        },
        {
            "headline": "Macron TROLLS Trump, Credits Europe's Unity For Defusing Greenland Tensions | 'Command Respect'",
            "summary": "French President Emmanuel Macron reportedly \"trolled\" Donald Trump by crediting Europe's unity for successfully resolving tensions over Greenland, asserting that this approach commanded global respect. His remarks highlight a divergence in diplomatic styles and European cohesion.",
            "key_points": [
                "Macron credited European unity for defusing Greenland tensions.",
                "Implied a contrast with Trump's diplomatic style.",
                "Emphasized Europe's need for global respect."
            ]
        },
        {
            "headline": "'Collapse of NATO' is 'Only Good Outcome’ of US-Europe Dispute Over Greenland: Ex-Pentagon Analyst",
            "summary": "A former Pentagon analyst controversially suggested that the \"collapse of NATO\" would be the \"only good outcome\" from the US-Europe dispute over Greenland. This analysis points to deep-seated tensions within the alliance regarding strategic priorities.",
            "key_points": [
                "Ex-Pentagon analyst suggested NATO's collapse as a \"good outcome.\"",
                "Stemmed from the US-Europe dispute over Greenland.",
                "Highlights significant tensions within the alliance."
            ]
        }
    ],
    "Business": [
        {
            "headline": "Top stocks to buy today: Stock recommendations for January 23 — check list",
            "summary": "A curated list of top stock recommendations for January 23, 2026, has been released to guide investors. This provides actionable insights for daily trading decisions and potential investment opportunities in the market.",
            "key_points": [
                "Stock recommendations for January 23, 2026, are provided.",
                "Aims to guide investors on potential buying opportunities.",
                "Offers insights for daily trading and investment strategies."
            ]
        },
        {
            "headline": "Russia Stays Vital to India’s Oil Supply: Oil Analyst Rejects US Claim",
            "summary": "An oil analyst confirmed Russia's continued critical role in India's oil supply, disputing US assertions that India could easily switch to alternative sources. This underscores India's strategic energy decisions amid evolving global energy dynamics.",
            "key_points": [
                "Russia remains vital for India's oil supply.",
                "US claims about easy alternatives were rejected by an analyst.",
                "Highlights India's strategic energy decisions."
            ]
        },
        {
            "headline": "Walmart to cut 10 percent stake in PhonePe IPO",
            "summary": "Walmart plans to divest a 10% stake in PhonePe during the Indian digital payments giant's upcoming Initial Public Offering. This strategic move will adjust Walmart's ownership in one of India's leading fintech platforms.",
            "key_points": [
                "Walmart will reduce its stake in PhonePe by 10%.",
                "The divestment is planned during PhonePe's IPO.",
                "Impacts ownership structure of a leading Indian fintech company."
            ]
        },
        {
            "headline": "EU keeps preferential tariff list for Indian goods for 3 years",
            "summary": "The European Union has extended its preferential tariff list for Indian goods for an additional three years, providing a significant advantage for Indian exporters. This decision fosters continued access for Indian products to European markets under favorable terms.",
            "key_points": [
                "EU extended preferential tariffs for Indian goods for three years.",
                "Benefits Indian exporters significantly.",
                "Ensures continued favorable market access to Europe."
            ]
        },
        {
            "headline": "India Rejects US Trade Deal Push at Davos: IT Minister",
            "summary": "India's IT Minister firmly rejected a US proposal for a trade deal during the Davos summit, signaling India's resolute stance on its trade policies. This highlights India's commitment to protecting its economic interests in global trade negotiations.",
            "key_points": [
                "India's IT Minister rejected a US trade deal proposal at Davos.",
                "Signals India's firm stance on its trade policies.",
                "Emphasizes protection of India's economic interests."
            ]
        },
        {
            "headline": "TikTok to avoid US ban: Majority American-led joint venture formed with Chinese ownership",
            "summary": "To prevent a US ban, TikTok has established a new joint venture with a majority American leadership, while still retaining Chinese ownership. This restructuring aims to comply with US regulatory demands and maintain its market presence.",
            "key_points": [
                "TikTok formed a US-led joint venture to avoid a ban.",
                "The venture retains Chinese ownership.",
                "Aims to meet US regulatory requirements."
            ]
        },
        {
            "headline": "IndiGo profit dives 78% in December quarter over flight disruptions",
            "summary": "IndiGo reported a substantial 78% decline in profit for its December quarter, primarily due to widespread flight disruptions. This financial setback reflects the operational challenges faced by the Indian airline industry.",
            "key_points": [
                "IndiGo's profit fell 78% in the December quarter.",
                "Flight disruptions were the main reason for the decline.",
                "Highlights operational challenges in the airline sector."
            ]
        },
        {
            "headline": "Eternal CEO transition: Zomato founder Deepinder Goyal gives up Rs 1,000 crore in stock options; what it means for shareholders",
            "summary": "Zomato founder Deepinder Goyal has foregone Rs 1,000 crore worth of his stock options, a move described as an \"eternal CEO transition\" with significant implications for shareholders. This decision impacts the company's future leadership and financial outlook.",
            "key_points": [
                "Zomato founder Deepinder Goyal relinquished Rs 1,000 crore in stock options.",
                "Termed an \"eternal CEO transition.\"",
                "Has significant implications for shareholders and company leadership."
            ]
        },
        {
            "headline": "RBI’s Digital Currency Plan to Challenge Dollar-Centric Payment Systems: Expert",
            "summary": "An expert indicates that the Reserve Bank of India's (RBI) digital currency initiative aims to disrupt dollar-centric global payment systems. This strategic move positions India at the forefront of financial innovation and aims for greater economic autonomy.",
            "key_points": [
                "RBI's digital currency aims to challenge dollar-centric payment systems.",
                "Positions India in financial innovation.",
                "Seeks greater economic autonomy."
            ]
        }
    ],
    "Technology": [
        {
            "headline": "India wants its cars to ‘talk to each other’. Will it make roads safer for you?",
            "summary": "India is moving towards implementing vehicle-to-vehicle (V2V) communication technology to enable cars to \"talk to each other,\" enhancing road safety. This initiative aims to reduce accidents and improve traffic efficiency across the country.",
            "key_points": [
                "India plans V2V communication for cars.",
                "Aims to improve road safety and prevent accidents.",
                "Seeks to enhance traffic efficiency through connectivity."
            ]
        },
        {
            "headline": "Why Does Indo-Russian Tech Cooperation Matter More Than Ever Just Now?",
            "summary": "An analysis highlights the increasing strategic importance of Indo-Russian technological cooperation in the current global climate. This partnership is crucial for India's technological advancement and its pursuit of strategic autonomy.",
            "key_points": [
                "Indo-Russian tech cooperation is increasingly strategically important.",
                "Crucial for India's technological advancement.",
                "Supports India's goal of strategic autonomy."
            ]
        }
    ],
    "Entertainment": [
        {
            "headline": "'Border 2' review: Sunny Deol starrer breaks Dhurandhar's record in advance booking",
            "summary": "Sunny Deol's highly anticipated film 'Border 2' has shattered previous advance booking records set by 'Dhurandhar,' indicating immense public interest. The film is generating considerable buzz ahead of its theatrical release.",
            "key_points": [
                "'Border 2' broke advance booking records.",
                "Surpassed previous record holder 'Dhurandhar'.",
                "Sunny Deol's film is highly anticipated."
            ]
        },
        {
            "headline": "BTS World Tour Arirang tickets SOLD OUT in hours",
            "summary": "Tickets for the \"BTS World Tour Arirang\" were completely sold out within hours, showcasing the global K-Pop sensation's unparalleled popularity. This rapid sell-out underlines the massive demand for their live performances worldwide.",
            "key_points": [
                "BTS World Tour tickets sold out in hours.",
                "Demonstrates the group's immense global popularity.",
                "High demand for their live concerts."
            ]
        },
        {
            "headline": "'Sinners' earns 16 Oscar nominations breaking previous records",
            "summary": "The film 'Sinners' has achieved a historic feat by securing 16 Oscar nominations, setting a new record and positioning it as a top contender for multiple awards. This achievement reflects its significant critical acclaim and industry impact.",
            "key_points": [
                "'Sinners' received a record 16 Oscar nominations.",
                "Positioned as a major contender for multiple awards.",
                "Highlights its significant critical acclaim."
            ]
        },
        {
            "headline": "Shark Tank India 5 judge Kanika Tekriwal recalls battling cancer",
            "summary": "Kanika Tekriwal, a judge on 'Shark Tank India 5', openly shared her battle with cancer, providing an inspirational account of her journey. Her story highlights resilience and overcoming significant personal health challenges.",
            "key_points": [
                "Kanika Tekriwal, 'Shark Tank India 5' judge, shared her cancer battle.",
                "Her story is an inspiring account of resilience.",
                "Highlights overcoming personal health challenges."
            ]
        },
        {
            "headline": "Aanand L Rai reacts to Rs 84 crore lawsuit over Raanjhanaa IP row",
            "summary": "Filmmaker Aanand L Rai has publicly responded to an Rs 84 crore lawsuit concerning an intellectual property dispute related to his film 'Raanjhanaa'. The legal battle underscores ongoing issues within the film industry regarding creative rights.",
            "key_points": [
                "Aanand L Rai is facing an Rs 84 crore lawsuit.",
                "The dispute is over intellectual property for his film 'Raanjhanaa'.",
                "Highlights ongoing creative rights issues in the film industry."
            ]
        }
    ],
    "Sports": [
        {
            "headline": "'Your captain is Hindu': Ex-India cricketer warns Bangladesh over shifting T20 WC matches",
            "summary": "An former Indian cricketer issued a controversial warning to Bangladesh regarding shifting T20 World Cup matches, including a provocative religious remark about their captain. The comment stirred debate, blending sports, religion, and geopolitical tensions.",
            "key_points": [
                "Former Indian cricketer warned Bangladesh against shifting T20 WC matches.",
                "Made a controversial religious remark about the captain.",
                "Sparked debate combining sports, religion, and politics."
            ]
        },
        {
            "headline": "FIDE WC in India: PM Modi says 'Chess is gaining popularity among our youth'",
            "summary": "Prime Minister Narendra Modi observed the growing popularity of chess among Indian youth during the FIDE World Cup in India. His statement highlights the increasing engagement of young people with the sport and government recognition.",
            "key_points": [
                "PM Modi noted increasing popularity of chess among Indian youth.",
                "The FIDE World Cup is being held in India.",
                "Highlights growing youth engagement in the sport."
            ]
        },
        {
            "headline": "Diamond League Final: Neeraj Chopra's event preview, time and live telecast in India",
            "summary": "A detailed preview for Neeraj Chopra's performance at the Diamond League Final includes information on event timing and live telecast options for Indian viewers. This ensures widespread access for fans to support India's javelin star.",
            "key_points": [
                "Neeraj Chopra's Diamond League Final event preview released.",
                "Includes timing and live telecast details for India.",
                "Aims to facilitate fan support for the Indian athlete."
            ]
        },
        {
            "headline": "Stunning prediction! 'Shreyas Iyer can captain India to a World Cup win'",
            "summary": "A \"stunning prediction\" suggests that cricketer Shreyas Iyer possesses the leadership qualities to guide India to a World Cup victory. This speculation sparks discussion among cricket enthusiasts about future team leadership and potential successes.",
            "key_points": [
                "Prediction: Shreyas Iyer could captain India to a World Cup win.",
                "Sparks discussion among cricket fans.",
                "Focuses on potential future leadership in Indian cricket."
            ]
        },
        {
            "headline": "Sarfaraz on fire! Back-to-back tons send strong message to selectors",
            "summary": "Sarfaraz Khan has delivered impressive back-to-back centuries, sending a clear message to national selectors about his exceptional form. His consistent performance strongly positions him for a call-up to higher levels of cricket.",
            "key_points": [
                "Sarfaraz Khan scored consecutive centuries.",
                "His strong performance impressed selectors.",
                "He is now a strong contender for national team selection."
            ]
        }
    ],
    "Science": [
        {
            "headline": "Australian study finds heart cells can regenerate post-heart attack; India’s leading cardiologist calls it a ‘big step’",
            "summary": "An Australian study has made a significant discovery that heart cells can regenerate after a heart attack, a finding that India's leading cardiologists are hailing as a \"big step\" forward. This breakthrough offers new avenues for treatment and recovery in cardiac care.",
            "key_points": [
                "Australian study discovered heart cell regeneration post-heart attack.",
                "Indian cardiologists call it a \"big step.\"",
                "Opens new avenues for cardiac treatment and recovery."
            ]
        }
    ],
    "Health": [
        {
            "headline": "Measles spread; renew fear that US could lose its long standing elimination status",
            "summary": "A recent resurgence of measles outbreaks has led to concerns that the US may lose its long-held elimination status for the disease. This emphasizes the critical importance of public health vigilance and vaccination efforts.",
            "key_points": [
                "Measles outbreaks raise fears of US losing elimination status.",
                "Highlights the importance of public health vigilance.",
                "Underscores the necessity of vaccination efforts."
            ]
        },
        {
            "headline": "Doctor's Advice On Common Traps: Dr Ankur Gahlot warns about hidden",
            "summary": "Dr. Ankur Gahlot offered advice on navigating common health \"traps,\" cautioning the public about often-overlooked dangers that can affect well-being. His guidance aims to educate individuals on proactive health management.",
            "key_points": [
                "Dr. Ankur Gahlot warned about common health \"traps.\"",
                "Focused on often-overlooked dangers to well-being.",
                "Aims to educate on proactive health management."
            ]
        },
        {
            "headline": "Are artery plaque and tooth plaque the same? Cardiologist and dentist explain the link",
            "summary": "A cardiologist and a dentist teamed up to clarify whether artery plaque and tooth plaque are identical, discussing their differences, similarities, and any potential systemic connections. This collaboration addresses a common public health question about plaque.",
            "key_points": [
                "Cardiologist and dentist explained artery and tooth plaque.",
                "Discussed their differences, similarities, and systemic links.",
                "Addressed a common public health query."
            ]
        },
        {
            "headline": "Colin Egglesfield opens up about his cancer journey: ‘The urgency of life is always right now’",
            "summary": "Actor Colin Egglesfield candidly shared his personal cancer journey, profoundly remarking that \"the urgency of life is always right now.\" His story serves as an inspiring reminder to embrace life's present moments fully.",
            "key_points": [
                "Colin Egglesfield opened up about his cancer journey.",
                "Stressed the urgency of living in the present.",
                "Offers an inspiring message on embracing life."
            ]
        }
    ]
}